Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/3d.po
Languages: es, sv, uk, zh_hans

source: 3-D Geometries
es: Geometrías 3-D
sv: 3-D geometrier
uk: Тривимірні геометрії
zh_hans: 三维几何

source: So far, we have been working with 2-D geometries, with only X and Y coordinates. But PostGIS supports additional dimensions on all geometry types, a "Z" dimension to add height information and a "M" dimension for additional dimensional information (commonly time, or road-mile, or upstream-distance information) for each coordinate.
es: Hasta ahora hemos trabajado con geometrías bidimensionales, con coordenadas X e Y únicamente. Pero PostGIS soporta dimensiones adicionales en todos los tipos de geometría, una dimensión "Z" para añadir información de altura y una dimensión "M" para información dimensional adicional (comúnmente información de tiempo, o millas de carretera, o distancia río arriba) para cada coordenada.
sv: Hittills har vi arbetat med 2D-geometrier, med endast X- och Y-koordinater. Men PostGIS stöder ytterligare dimensioner för alla geometrityper, en "Z"-dimension för att lägga till höjdinformation och en "M"-dimension för ytterligare dimensionell information (vanligtvis tid, vägkilometer eller information om avstånd uppströms) för varje koordinat.
uk: Поки що ми працювали з двовимірними геометріями, що мають лише координати X та Y. Але PostGIS підтримує додаткові виміри для всіх типів геометрій — вимір «Z» для додавання інформації про висоту та вимір «M» для додаткової інформації (зазвичай це час, кілометраж дороги або відстань за течією) для кожної координати.
zh_hans: 目前我们使用的都是仅含X/Y坐标的二维几何体。实际上PostGIS支持所有几何类型的多维扩展：通过"Z"维度表示高程信息，通过"M"维度存储附加维度信息（通常用于时间、道路里程或上游距离等数据）。

source: For 3-D and 4-D geometries, the extra dimensions are added as extra coordinates for each vertex in the geometry, and the geometry type is enhanced to indicate how to interpret the extra dimensions. Adding the extra dimensions results in three extra possible geometry types for each geometry primitive:
es: Para las geometrías 3D y 4D, las dimensiones adicionales se añaden como coordenadas adicionales para cada vértice de la geometría, y el tipo de geometría se mejora para indicar cómo interpretar las dimensiones adicionales. La adición de las dimensiones adicionales da como resultado tres tipos de geometría adicionales posibles para cada primitiva geométrica:
sv: För 3D- och 4D-geometrier läggs de extra dimensionerna till som extra koordinater för varje vertex i geometrin, och geometritypen förbättras för att ange hur de extra dimensionerna ska tolkas. Genom att lägga till de extra dimensionerna skapas tre extra möjliga geometrityper för varje geometriprimitiv:
uk: Для тривимірних (3D) та чотиривимірних (4D) геометрій додаткові виміри додаються як додаткові координати для кожної вершини геометрії, а тип геометрії розширюється, щоб вказати, як інтерпретувати ці додаткові виміри. Додавання додаткових вимірів призводить до появи трьох нових можливих типів геометрії для кожного примітиву геометрії:
zh_hans: 对于三维(3-D)和四维(4-D)几何体，每个顶点坐标会增加额外的维度值，并通过扩展几何类型标识符来定义这些额外维度的解释方式。每类基本几何体因此衍生出三种额外类型：

source: Point (a 2-D type) is joined by PointZ, PointM and PointZM types.
es: Point (un tipo 2-D ) es complementada por los tipos PointM y PointZM .
sv: Point (en 2D-typ) får sällskap av typerna PointZ, PointM och PointZM.
uk: До типу Point (двовимірний тип) додаються типи PointZ, PointM та PointZM.
zh_hans: 点（二维类型）与 PointZ、PointM 和 PointZM 类型并存。

source: Linestring (a 2-D type) is joined by LinestringZ, LinestringM and LinestringZM types.
es: Linestring (un tipo 2-D) es complementado con los tipos LinestringZ, LinestringM y LinestringZM.
sv: Linestring (en 2D-typ) får sällskap av LinestringZ-, LinestringM- och LinestringZM-typerna.
uk: До типу Linestring (двовимірний тип) додаються типи LinestringZ, LinestringM та LinestringZM.
zh_hans: 线（二维类型）与 LinestringZ、LinestringM 和 LinestringZM 类型并存。

source: Polygon (a 2-D type) is joined by PolygonZ, PolygonM and PolygonZM types.
es: Polygon (un tipo 2D) se une a los tipos PolygonZ, PolygonM y PolygonZM.
sv: Polygon (en 2D-typ) förenas med typerna PolygonZ, PolygonM och PolygonZM.
uk: До типу Polygon (двовимірний тип) додаються типи PolygonZ, PolygonM та PolygonZM.
zh_hans: 多边形（二维类型）与 PolygonZ、PolygonM 和 PolygonZM 类型并存。

source: And so on.
es: Y así sucesivamente.
sv: Och så vidare.
uk: І так далі.
zh_hans: 依此类推。

source: For well-known text (:term:`WKT`) representation, the format for higher dimensional geometries is given by the ISO SQL/MM specification. The extra dimensionality information is simply added to the text string after the type name, and the extra coordinates added after the X/Y information. For example:
es: Para el formato de texto bien conocido (:term:`WKT`), el formato para geometrías de mayor dimensionalidad viene dado por la especificación ISO SQL/MM. La información sobre la dimensionalidad adicional simplemente se añade a la cadena de texto después del nombre del tipo, y las coordenadas adicionales se añaden después de la información X/Y. Por ejemplo:
sv: För välkänd text (:term:`WKT`) representation, formatet för högre dimensionella geometrier ges av ISO SQL/MM specifikationen. Den extra dimensionalitetsinformationen läggs helt enkelt till i textsträngen efter typnamnet och de extra koordinaterna läggs till efter X/Y-informationen. Till exempel:
uk: Для представлення у форматі well-known text (:term:WKT) формат для багатовимірних геометрій визначений у специфікації ISO SQL/MM. Інформація про додаткові виміри просто додається до текстового рядка після назви типу, а додаткові координати — після координат X/Y. Наприклад:
zh_hans: 对于知名文本格式 (:term:`WKT`) 的高维几何表示，其规范由ISO SQL/MM标准定义。维度扩展信息直接追加在几何类型名称之后，额外坐标值则续接在X/Y坐标之后。例如：

source: POINT ZM (1 2 3 4)
sv: PUNKT ZM (1 2 3 4)

source: POLYGON Z ((0 0 0, 0 1 0, 1 1 0, 1 0 0, 0 0 0))
sv: POLYGON Z ((0 0 0, 0 1 0, 1 1 0, 1 0 0, 0 0 0, 0 0 0))

source: The ST_AsText() function will return the above representations when dealing with 3-D and 4-D geometries.
es: La función ST_AsText() devolverá las representaciones mostradas anteriormente cuando se trate de geometrías 3D y 4D.
sv: Funktionen ST_AsText() returnerar ovanstående representationer vid hantering av 3-D- och 4-D-geometrier.
uk: Функція ST_AsText() повертатиме наведені вище подання при роботі з тривимірними (3D) та чотиривимірними (4D) геометріями.
zh_hans: ST_AsText() 函数处理 3D 或 4D 几何对象时会返回上述的格式。

source: For well-known binary (:term:`WKB`) representation, the format for higher dimensional geometries is given by the ISO SQL/MM specification. The BNF form of the format is available from https://git.osgeo.org/gitea/postgis/postgis/src/branch/master/doc/bnf-wkb.txt.
es: Para la representación binaria (:term:`WKB`), el formato para geometrías de mayor dimensión viene dado por la especificación ISO SQL/MM. La forma BNF del formato está disponible en https://git.osgeo.org/gitea/postgis/postgis/src/branch/master/doc/bnf-wkb.txt.
sv: För välkänd binär (:term:`WKB`) representation ges formatet för högre dimensionella geometrier av ISO SQL/MM-specifikationen. BNF-formatet för formatet finns tillgängligt från https://git.osgeo.org/gitea/postgis/postgis/src/branch/master/doc/bnf-wkb.txt.
uk: Для подання у форматі well-known binary (:term:WKB) формат для багатовимірних геометрій визначено у специфікації ISO SQL/MM. BNF-форма цього формату доступна за посиланням: https://git.osgeo.org/gitea/postgis/postgis/src/branch/master/doc/bnf-wkb.txt.
zh_hans: 对于二进制格式（:term:`WKB`）表示法，高维几何体的规范由ISO SQL/MM标准定义。该格式的巴科斯范式(BNF)定义详见：https://git.osgeo.org/gitea/postgis/postgis/src/branch/master/doc/bnf-wkb.txt。

source: In addition to higher-dimensional forms of the standard types, PostGIS includes a few new types that make sense in a 3-D space:
es: Además de las formas de mayor dimensión, PostGIS incluye algunos tipos nuevos que tienen sentido en un espacio tridimensional:
sv: Förutom högre dimensionella former av standardtyperna innehåller PostGIS några nya typer som är meningsfulla i ett 3D-rum:
uk: Окрім багатовимірних варіантів стандартних типів, PostGIS включає кілька нових типів, які мають сенс у тривимірному просторі:
zh_hans: 除了标准类型的高维形式外，PostGIS 还引入了若干专为三维空间设计的新类型：

source: The TIN type allows you to model triangular meshes as rows in your database.
es: El tipo TIN permite modelar mallas triangulares como filas en la base de datos.
sv: Med typen TIN kan du modellera triangulära maskor som rader i din databas.
uk: Тип TIN дозволяє моделювати трикутні сітки у вигляді рядків у вашій базі даних.
zh_hans: TIN 类型支持将三角网模型以数据库行形式存储。

source: The POLYHEDRALSURFACE allows you to model volumetric objects in your database.
es: El POLYHEDRALSURFACE permite modelar objetos volumétricos en su base de datos.
sv: Med POLYHEDRALSURFACE kan du modellera volymetriska objekt i din databas.
uk: Тип POLYHEDRALSURFACE дозволяє моделювати об’ємні об’єкти у вашій базі даних.
zh_hans: POLYHEDRALSURFACE 类型支持在数据库中存储三维体对象模型。

source: Since both these types are for modelling 3-D objects, it only really makes sense to use the Z variants. An example of a POLYHEDRALSURFACE Z would be the 1 unit cube:
es: Dado que ambos tipos sirven para modelar objetos tridimensionales, en realidad sólo tiene sentido utilizar las variantes Z. Un ejemplo de POLYHEDRALSURFACE Z sería el cubo de 1 unidad:
sv: Eftersom båda dessa typer är avsedda för modellering av 3D-objekt är det egentligen bara Z-varianterna som är meningsfulla att använda. Ett exempel på en POLYHEDRALSURFACE Z skulle vara kuben med 1 enhet:
uk: Оскільки обидва ці типи призначені для моделювання тривимірних об’єктів, має сенс використовувати лише варіанти з виміром Z. Прикладом POLYHEDRALSURFACE Z може бути куб зі стороною 1 одиниця:
zh_hans: 由于这两种类型均用于三维对象建模，实际应用中应优先选用 Z 坐标变体。以边长为1的单位立方体为例，其POLYHEDRALSURFACE Z定义如下：

source: 3-D Functions
es: Funciones 3D
sv: 3-D funktioner
uk: Функції для 3D
zh_hans: 3D 函数

source: There are a number of functions built to calculate relationships between 3-D objects:
es: Hay una serie de funciones creadas para calcular relaciones entre objetos tridimensionales:
sv: Det finns ett antal funktioner som är konstruerade för att beräkna relationer mellan 3D-objekt:
uk: Існує низка функцій, створених для обчислення взаємозв’язків між тривимірними об’єктами:
zh_hans: 这有一些函数用来计算 3D 对象的关系：

source: ST_3DClosestPoint — Returns the 3-dimensional point on g1 that is closest to g2. This is the first point of the 3D shortest line.
es: ST_3DClosestPoint - Devuelve el punto tridimensional de g1 más cercano a g2. Es el primer punto de la línea 3D más corta.
sv: ST_3DClosestPoint - Returnerar den 3-dimensionella punkt på g1 som ligger närmast g2. Detta är den första punkten på den kortaste 3D-linjen.
uk: ST_3DClosestPoint — повертає тривимірну точку на об’єкті g1, яка є найближчою до об’єкта g2. Це перша точка найкоротшої 3D лінії.
zh_hans: ST_3DClosestPoint — 返回距离 3D 点 g1 最近的点 g2. 这是到第一个点的最短距离。

source: ST_3DDistance — For geometry type Returns the 3-dimensional cartesian minimum distance (based on spatial ref) between two geometries in projected units.
es: ST_3DDistance - Para datos tipo geometría. Devuelve la distancia cartesiana mínima tridimensional (basada en la referencia espacial) entre dos geometrías en unidades proyectadas.
sv: ST_3DDistance - För geometrityp Returnerar det 3-dimensionella cartesiska minimiavståndet (baserat på spatial ref) mellan två geometrier i projicerade enheter.
uk: ST_3DDistance — для типу geometry повертає мінімальну тривимірну евклідову відстань (на основі просторової системи координат) між двома геометріями в одиницях проекції.
zh_hans: ST_3DDistance — 针对几何图形类型，返回两个三维几何对象在投影坐标系下的笛卡尔最小距离（基于空间参考系），单位为投影坐标单位。

source: ST_3DDWithin — For 3d (z) geometry type Returns true if two geometries 3d distance is within number of units.
es: ST_3DDWithin - Para el tipo de geometría 3D (z). Devuelve verdadero si la distancia 3D de dos geometrías está dentro de un número de unidades.
sv: ST_3DDWithin - För geometrityp 3d (z) Returnerar sant om två geometriers 3d-avstånd ligger inom ett antal enheter.
uk: ST_3DDWithin — для тривимірних (z) геометрій повертає true, якщо відстань між двома геометріями у 3D просторі не перевищує задану кількість одиниць.
zh_hans: ST_3DDWithin — 针对三维（Z轴）几何类型，当两个几何对象的三维距离小于等于指定单位值时返回 true。

source: ST_3DDFullyWithin — Returns true if all of the 3D geometries are within the specified distance of one another.
es: ST_3DDFullyWithin - Devuelve verdadero si todas las geometrías 3D se encuentran a la distancia especificada entre sí.
sv: ST_3DDFullyWithin - Returnerar true om alla 3D-geometrier ligger inom det angivna avståndet från varandra.
uk: ST_3DDFullyWithin — повертає true, якщо всі тривимірні геометрії знаходяться в межах заданої відстані одна від одної.
zh_hans: ST_3DDFullyWithin — 若所有三维几何对象彼此间的距离均小于等于指定值，则返回 true。

source: ST_3DIntersects — Returns TRUE if the Geometries "spatially intersect" in 3d - only for points and linestrings
es: ST_3DIntersects - Devuelve TRUE si las geometrías se "intersectan espacialmente" en 3D - sólo para puntos y cadenas de líneas
sv: ST_3DIntersects - Returnerar TRUE om geometrierna "spatialt korsar varandra" i 3d - endast för punkter och linjestrings
uk: ST_3DIntersects — повертає TRUE, якщо геометрії «просторово перетинаються» у 3D — працює лише для точок та лінійних рядків (linestrings)
zh_hans: ST_3DIntersects — 当几何图形在三维空间中"存在空间交集"时返回 TRUE（当前仅支持点与线串类型）

source: ST_3DLongestLine — Returns the 3-dimensional longest line between two geometries
es: ST_3DLongestLine - Devuelve la línea tridimensional más larga entre dos geometrías
sv: ST_3DLongestLine - Returnerar den 3-dimensionella längsta linjen mellan två geometrier
uk: ST_3DLongestLine — повертає найтривалішу тривимірну лінію між двома геометріями
zh_hans: ST_3DLongestLine — 返回两个三维几何图形之间的最长三维线段

source: ST_3DMaxDistance — For geometry type Returns the 3-dimensional cartesian maximum distance (based on spatial ref) between two geometries in projected units.
es: ST_3DMaxDistance - Para tipo geometría. Devuelve la distancia cartesiana máxima tridimensional (basada en ref. espacial) entre dos geometrías en unidades proyectadas.
sv: ST_3DMaxDistance - För geometrityp Returnerar det 3-dimensionella cartesiska maximala avståndet (baserat på spatial ref) mellan två geometrier i projicerade enheter.
uk: ST_3DMaxDistance — для типу geometry повертає максимальну тривимірну евклідову відстань (на основі просторової системи координат) між двома геометріями в одиницях проекції.
zh_hans: ST_3DMaxDistance — 针对几何图形类型，返回两个三维几何对象在投影坐标系下的笛卡尔最大距离（基于空间参考系），单位为投影坐标单位。

source: ST_3DShortestLine — Returns the 3-dimensional shortest line between two geometries
es: ST_3DShortestLine - Devuelve la línea tridimensional más corta entre dos geometrías
sv: ST_3DShortestLine - Returnerar den 3-dimensionella kortaste linjen mellan två geometrier
uk: ST_3DShortestLine — повертає найкоротшу тривимірну лінію між двома геометріями
zh_hans: ST_3DShortestLine — 返回两个三维几何图形之间的最短三维线段

source: For example, we can calculate the distance between our unit cube and a point using the ST_3DDistance function:
es: Por ejemplo, podemos calcular la distancia entre nuestro cubo unitario y un punto utilizando la función ST_3DDistance:
sv: Vi kan t.ex. beräkna avståndet mellan vår kub och en punkt med hjälp av funktionen ST_3DDistance:
uk: Наприклад, ми можемо обчислити відстань між нашим кубом зі стороною 1 та точкою за допомогою функції ST_3DDistance:
zh_hans: 例如，我们可以使用 ST_3DDistance 函数计算单位立方体与某点之间的三维距离：

source: N-D Indexes
es: Índices N-D
sv: N-D-index
uk: N-вимірні індекси
zh_hans: N维索引

source: Once you have data in higher dimensions it may make sense to index it. However, you should think carefully about the distribution of your data in all dimensions before applying a multi-dimensional index.
es: Una vez que tenga datos en dimensiones superiores, puede tener sentido indexarlos. Sin embargo, antes de aplicar un índice multidimensional se debe pensar detenidamente en la distribución de los datos en todas las dimensiones.
sv: När du har data i högre dimensioner kan det vara meningsfullt att indexera dem. Du bör dock noga tänka igenom fördelningen av dina data i alla dimensioner innan du använder ett flerdimensionellt index.
uk: Коли у вас є дані в багатовимірному форматі, може мати сенс їх індексувати. Проте варто ретельно обдумати розподіл ваших даних у всіх вимірах перед застосуванням багатовимірного індексу.
zh_hans: 当数据包含更高维度时，建立索引可能具有价值。但需在应用多维索引前，仔细评估数据在各个维度上的分布特性。

source: Indexes are only useful when they allow the database to drastically reduce the number of return rows as a result of a WHERE condition. For a higher dimension index to be useful, the data must cover a wide range of that dimension, relative to the kinds of queries you are constructing.
es: Los índices sólo son útiles cuando permiten a la base de datos reducir drásticamente el número de filas devueltas como resultado de una condición WHERE. Para que un índice de dimensión superior sea útil, los datos deben cubrir una amplia gama de esa dimensión, en relación con los tipos de consultas que se están construyendo.
sv: Index är bara användbara när de gör det möjligt för databasen att drastiskt minska antalet returrader som ett resultat av ett WHERE-villkor. För att ett index med en högre dimension ska vara användbart måste data täcka ett brett område av den dimensionen, i förhållande till de typer av frågor som du konstruerar.
uk: Індекси корисні лише тоді, коли вони дозволяють базі даних значно зменшити кількість рядків у результаті умови WHERE. Щоб багатовимірний індекс був ефективним, дані мають охоплювати широкий діапазон по відповідному виміру відносно типів запитів, які ви формуєте.
zh_hans: 索引的有效性取决于其通过WHERE条件大幅减少返回行数的能力。对于高维索引而言，只有当数据在相关维度上具有足够大的值域范围（相对于查询条件的设计）时，索引才能发挥效用。

source: A set of DEM points would probably be a *poor* candidate for a 3-D index, since the queries would usually be extracting a 2-D box of points, and rarely attempting to select a Z-slice of points.
es: Un conjunto de puntos MDE sería probablemente un candidato *pobre* para un índice 3D, ya que las consultas normalmente extraerían una caja 2D de puntos, y raramente intentarían seleccionar un conjunto Z de puntos.
sv: En uppsättning DEM-punkter skulle förmodligen vara en *dålig* kandidat för ett 3D-index, eftersom frågorna vanligtvis skulle extrahera en 2D-box med punkter och sällan försöka välja en Z-skiva av punkter.
uk: Набір точок DEM, ймовірно, буде поганим кандидатом для 3D-індексу, оскільки запити зазвичай витягують двовимірну область точок і рідко намагаються вибрати зріз по осі Z.
zh_hans: 数字高程模型（DEM）点集数据通常*不适合*建立三维索引，因为绝大多数查询仅涉及二维空间范围的点提取，极少需要按高程值（Z轴切片）进行筛选。

source: A set of GPS traces in X/Y/T space might be a *good* candidate for a 3-D index, if the GPS tracks overlapped each other frequently in all dimensions (for example, driving the same route over and over at different times), since there would be large variability in all dimensions of the data set.
es: Un conjunto de trazas de GPS en el espacio X/Y/T podría ser un *buen* candidato para un índice tridimensional, si las trazas de GPS se solaparan entre sí con frecuencia en todas las dimensiones (por ejemplo, recorriendo la misma ruta una y otra vez en diferentes momentos), ya que habría una gran variabilidad en todas las dimensiones del conjunto de datos.
sv: En uppsättning GPS-spår i X/Y/T-rymden kan vara en *bra* kandidat för ett 3D-index, om GPS-spåren ofta överlappar varandra i alla dimensioner (t.ex. om man kör samma rutt om och om igen vid olika tidpunkter), eftersom det skulle finnas stor variabilitet i alla dimensioner i datauppsättningen.
uk: Набір GPS-треків у просторі X/Y/T може бути хорошим кандидатом для 3D-індексу, якщо GPS-шляхи часто перекриваються у всіх вимірах (наприклад, багаторазове проїзджання того самого маршруту в різний час), оскільки в наборі даних буде велика варіабельність у всіх вимірах.
zh_hans: 在X/Y/时间三维空间中的GPS轨迹数据，若满足以下条件则可成为三维索引的理想应用场景：当轨迹数据在所有维度上均存在频繁重叠（例如车辆在不同时段重复行驶相同路线），此时数据集在各维度上均会呈现显著的可变性。

source: You can create a multi-dimensional index on data of any dimensionality (even mixed dimensionality). For example, to create a multi-dimensional index on the ``nyc_streets`` table,
es: Se puede crear un índice multidimensional sobre datos de cualquier dimensionalidad (incluso de dimensionalidad mixta). Por ejemplo, para crear un índice multidimensional en la tabla ``nyc_streets``,
sv: Du kan skapa ett flerdimensionellt index på data med vilken dimensionalitet som helst (även blandad dimensionalitet). Så här skapar du till exempel ett flerdimensionellt index på tabellen ``nyc_streets``,
uk: Ви можете створити багатовимірний індекс для даних будь-якої розмірності (навіть змішаної). Наприклад, щоб створити багатовимірний індекс для таблиці nyc_streets,.
zh_hans: 您可以为任意维度的数据（甚至混合维度数据）创建多维索引。例如，在``nyc_streets``表上创建多维索引的方法如下，

source: The ``gist_geometry_ops_nd`` parameter tells PostGIS to use the N-D index instead of the standard 2-D index.
es: El parámetro ``gist_geometry_ops_nd`` indica a PostGIS que utilice el índice N-D en lugar del índice estándar 2-D.
sv: Parametern ``gist_geometry_ops_nd`` säger till PostGIS att använda N-D index istället för standard 2-D index.
uk: Параметр ``gist_geometry_ops_nd`` вказує PostGIS використовувати N-вимірний індекс замість стандартного 2-вимірного індексу.
zh_hans: 参数 ``gist_geometry_ops_nd`` 用于指示 PostGIS 启用N维索引而非标准的二维索引。

source: Once you have the index built, you can use it in queries with the ``&&&`` index operator. ``&&&`` has the same semantics as ``&&``, "bounding boxes interact", but applies those semantics using all the dimensions of the input geometries. Geometries with mis-matching dimensionality do not interact.
es: Una vez construido el índice, puedes utilizarlo en las consultas con el operador de índice ``&&&``. ``&&&`` tiene la misma semántica que ``&&``, "los bbox interactúan", pero aplica esa semántica utilizando todas las dimensiones de las geometrías de entrada. Las geometrías cuya dimensionalidad no coincide no interactúan.
sv: När du har byggt upp indexet kan du använda det i frågor med indexoperatorn ``&&&``. ``&&&`` har samma semantik som ``&&``, "bounding boxes interagerar", men tillämpar denna semantik med hjälp av alla dimensioner i de ingående geometrierna. Geometrier med fel matchande dimensionalitet interagerar inte.
uk: Після створення індексу ви можете використовувати його в запитах з оператором індексу ``&&&``. Оператор ``&&&`` має таке саме значення, як і ``&&`` — «обмежувальні коробки взаємодіють», але застосовує ці правила до всіх вимірів вхідних геометрій. Геометрії з різною кількістю вимірів не взаємодіють.
zh_hans: 建立索引后，即可在查询中使用 ``&&&``索引运算符。 ``&&&``与``&&``具有相同的"边界框相交"语义，但会应用在输入几何图形的所有维度上。需注意：维度不匹配的几何图形将被判定为不相交。

source: To search the ``nyc_streets`` table using the N-D index, just replace the usual ``&&`` 2-D index operator with the ``&&&`` operator.
es: Para buscar en la tabla ``nyc_streets`` utilizando el índice N-D, basta con sustituir el operador habitual de índice 2D ``&&`` por el operador ``&&&``.
sv: Om du vill söka i tabellen ``nyc_streets`` med hjälp av N-D-index ersätter du bara den vanliga 2D-indexoperatorn ``&&`` med operatorn ``&&&``.
uk: Щоб виконати пошук у таблиці ``nyc_streets `` із використанням N-вимірного індексу, просто замініть звичайний оператор 2D-індексу ``&& `` на оператор ``&&& ``.
zh_hans: 要在 ``nyc_streets`` 表中启用N维索引搜索，只需将常规的二维索引运算符``&&`` 替换为多维运算符``&&&`` 即可。
