Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/3d.po
Languages: es, sv, uk, zh_hans

source: The results should be the same. In general the N-D index is very slightly slower than the 2-D index, so only use the N-D index where you are certain that N-D queries will improve the selectivity of your queries.
es: Los resultados deberían ser los mismos. En general, el índice N-D es ligeramente más lento que el índice 2-D, por lo que sólo debe utilizar el índice N-D cuando esté seguro de que las consultas N-D mejorarán la selectividad de sus consultas.
sv: Resultaten bör vara desamma. I allmänhet är N-D-indexet något långsammare än 2D-indexet, så använd N-D-indexet endast om du är säker på att N-D-frågorna kommer att förbättra selektiviteten i dina frågor.
uk: Результати мають бути однаковими. Загалом, N-вимірний індекс працює трохи повільніше за 2-вимірний, тому використовуйте N-вимірний індекс лише тоді, коли впевнені, що багатовимірні запити покращать селективність ваших запитів.
zh_hans: 查询结果应当保持一致。需注意的是，N维索引的性能通常略低于二维索引，因此建议仅在以下场景使用。

source: 3-D
uk: 3D (тривимірний)
zh_hans: 三维（3D）
