Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/backup.po
Languages: es, sv

source: PostgreSQL Backup and Restore
es: Copia de seguridad y restauración de PostgreSQL
sv: PostgreSQL säkerhetskopiering och återställning

source: There are lots of ways to backup a PostgreSQL database, and the one you choose will depend a great deal on how you are using the database.
es: Hay muchas formas de hacer copias de seguridad de una base de datos PostgreSQL, y la que elija dependerá en gran medida de cómo esté utilizando la base de datos.
sv: Det finns många sätt att säkerhetskopiera en PostgreSQL-databas, och den du väljer kommer att bero mycket på hur du använder databasen.

source: For relatively static databases, the basic pg_dump/pg_restore tools can be used to take periodic snapshots of the data.
es: Para bases de datos relativamente estáticas, se pueden utilizar las herramientas básicas pg_dump/pg_restore para tomar instantáneas (snapshots) periódicas de los datos.
sv: För relativt statiska databaser kan de grundläggande verktygen pg_dump/pg_restore användas för att ta periodiska ögonblicksbilder av data.

source: For frequently changing data, using an "online backup" scheme allows continuous archiving of updates to a secure location.
es: Para los datos que cambian con frecuencia, el uso de un esquema de "copia de seguridad en línea" permite archivar continuamente las actualizaciones en una ubicación segura.
sv: För data som ändras ofta kan man använda ett system med "online backup" för att kontinuerligt arkivera uppdateringar på en säker plats.

source: Online backup is the basis for replication and stand-by systems for `high availability <http://www.postgresql.org/docs/current/static/high-availability.html>`_, particularly for versions of PostgreSQL >= 9.0.
es: La copia de seguridad en línea es la base de los sistemas de replicación y de reserva para una `alta disponibilidad <http://www.postgresql.org/docs/current/static/high-availability.html>`_, en particular para las versiones de PostgreSQL >= 9.0.
sv: Online backup är grunden för replikering och standby-system för `hög tillgänglighet <http://www.postgresql.org/docs/current/static/high-availability.html>`_, särskilt för versioner av PostgreSQL >= 9.0.

source: Laying Out your Data
es: Organización de tus datos
sv: Lägga ut dina data

source: As discussed in :ref:`schemas`, ensuring that production data is always stored in separate schemas is a very important **best practice** in managing data. There are two reasons:
es: Como se discutió en :ref:`schemas`, asegurarse de que los datos de producción siempre se almacenen en esquemas separados es una **mejor práctica** muy importante en la gestión de datos. Hay dos razones:
sv: Som diskuterades i :ref:`schemas` är det en mycket viktig **best practice** vid datahantering att se till att produktionsdata alltid lagras i separata scheman. Det finns två skäl till detta:

source: Backing up and restoring data in schemas is much simpler than managing lists of tables to be backed up individually.
es: Respaldar y restaurar datos en esquemas es mucho más simple que gestionar listas de tablas a respaldar individualmente.
sv: Det är mycket enklare att säkerhetskopiera och återställa data i scheman än att hantera listor med tabeller som ska säkerhetskopieras individuellt.

source: Keeping data tables out of the "public" schema allows far easier upgrades, as discussed in :ref:`upgrades`.
es: Mantener las tablas de datos fuera del esquema "public" permite actualizaciones mucho más fáciles, como se discutió en :ref:`upgrades`.
sv: Genom att hålla datatabeller utanför det "offentliga" schemat blir det mycket enklare att göra uppgraderingar, vilket diskuteras i :ref:`upgrades`.

source: Basic Backup and Restore
es: Respaldo y restauración básicos
sv: Grundläggande säkerhetskopiering och återställning

source: Backing up a full database is easy using the pg_dump_ utility. The utility is a command-line tool, which makes it easy to automate with scripting, and it can also be invoke via a GUI in the PgAdmin utility.
es: Respaldar una base de datos completa es fácil usando la utilidad pg_dump_. La utilidad es una herramienta de línea de comandos, lo que hace fácil automatizarla con scripts, y también puede invocarse mediante una GUI en la utilidad PgAdmin.
sv: Det är enkelt att säkerhetskopiera en hel databas med hjälp av verktyget pg_dump_. Verktyget är ett kommandoradsverktyg, vilket gör det enkelt att automatisera med skript, och det kan också anropas via ett GUI i verktyget PgAdmin.

source: To backup our ``nyc`` database, we can use the GUI, just right-click the database you want to backup:
es: Para respaldar nuestra base de datos ``nyc``, podemos usar la GUI, simplemente haz clic derecho en la base de datos que quieres respaldar:
sv: För att säkerhetskopiera vår ``nyc``-databas kan vi använda GUI, högerklicka bara på den databas du vill säkerhetskopiera:

source: Enter the name of the backup file you want to create.
es: Ingresa el nombre del archivo de respaldo que quieres crear.
sv: Ange namnet på den backup-fil som du vill skapa.

source: Note that there are three backup format options: compress, tar and plain.
es: Ten en cuenta que hay tres opciones de formato de respaldo: compress, tar y plain.
sv: Observera att det finns tre alternativ för säkerhetskopieringsformat: compress, tar och plain.

source: **Plain** is just a textual SQL file. This is the simplest format and in many ways the most flexible, since it can be editing or altered easily and then loaded back into a database, allowing offline changes to things like ownership or other global information.
es: **Plain** es solo un archivo SQL textual. Este es el formato más simple y en muchos sentidos el más flexible, ya que puede editarse o modificarse fácilmente y luego cargarse de nuevo en una base de datos, permitiendo cambios sin conexión en cosas como propiedad u otra información global.
sv: **Plain** är bara en textuell SQL-fil. Detta är det enklaste formatet och på många sätt det mest flexibla, eftersom det enkelt kan redigeras eller ändras och sedan laddas tillbaka till en databas, vilket möjliggör offlineändringar av saker som ägande eller annan global information.

source: **Tar** using a UNIX archive format to hold components of the dump in separate files. Using the tar format allows the pg_restore_ utility to selectively restore parts of the dump.
es: **Tar** usa un formato de archivo de UNIX para guardar componentes del volcado en archivos separados. Usar el formato tar permite a la utilidad pg_restore_ restaurar de manera selectiva partes del volcado.
sv: **Tar** använder ett UNIX-arkivformat för att hålla komponenter i dumpningen i separata filer. Genom att använda tar-formatet kan verktyget pg_restore_ selektivt återställa delar av dumpen.

source: **Compress** is like the Tar format, but compresses the internal components individually, allowing them to be selectively restored without decompressing the entire archive.
es: **Compress** es como el formato Tar, pero comprime los componentes internos individualmente, permitiendo que se restauren selectivamente sin descomprimir todo el archivo.
sv: **Compress** är som Tar-formatet, men komprimerar de interna komponenterna individuellt, vilket gör att de kan återställas selektivt utan att hela arkivet behöver dekomprimeras.

source: We'll check the Compress option and go, saving out a backup file.
es: Marcaremos la opción Compress y procederemos, guardando un archivo de respaldo.
sv: Vi markerar alternativet Komprimera och sparar en backup-fil.

source: The same operation can be done with the command line like this:
es: La misma operación puede hacerse desde la línea de comandos así:
sv: Samma operation kan göras med kommandoraden på följande sätt:

source: Because the backup file is in Compress format, we can view the contents using the pg_restore_ command to list the manifest. In the PgAdmin GUI, "View" is an option in the panel.
es: Como el archivo de respaldo está en formato Compress, podemos ver el contenido usando el comando pg_restore_ para listar el manifiesto. En la GUI de PgAdmin, "View" es una opción en el panel.
sv: Eftersom säkerhetskopian är i Compress-format kan vi visa innehållet med hjälp av kommandot pg_restore_ för att lista manifestet. I PgAdmin GUI är "View" ett alternativ i panelen.

source: When you look at the manifest, one of the things you might notice is that there are a lot of "FUNCTION" signatures in there.
es: Cuando observas el manifiesto, una de las cosas que notarás es que hay muchas firmas de "FUNCTION".
sv: När du tittar på manifestet kanske du märker att det finns många "FUNCTION"-signaturer där.

source: That's because the pg_dump_ utility dumps **every** non-system object in the database, and that includes the PostGIS function definitions.
es: Eso se debe a que la utilidad pg_dump_ vuelca **todos** los objetos no del sistema en la base de datos, y eso incluye las definiciones de funciones de PostGIS.
sv: Det beror på att verktyget pg_dump_ dumpar **alla** icke-systemobjekt i databasen, och det inkluderar PostGIS-funktionsdefinitionerna.

source: PostgreSQL 9.1+ includes an "EXTENSION" feature that allows add-on packages like PostGIS to be installed as registered system components and therefore excluded from pg_dump_ output. PostGIS 2.0 and higher support installation using this extension system.
es: PostgreSQL 9.1+ incluye una característica "EXTENSION" que permite que paquetes adicionales como PostGIS se instalen como componentes de sistema registrados y por lo tanto sean excluidos de la salida de pg_dump_. PostGIS 2.0 y superiores soportan instalación usando este sistema de extensiones.
sv: PostgreSQL 9.1+ innehåller en "EXTENSION" -funktion som gör att tilläggspaket som PostGIS kan installeras som registrerade systemkomponenter och därför utesluts från pg_dump_-utdata. PostGIS 2.0 och högre stöder installation med hjälp av detta förlängningssystem.

source: We can see the same manifest from the command-line using pg_restore_ directly:
es: Podemos ver el mismo manifiesto desde la línea de comandos usando pg_restore_ directamente:
sv: Vi kan se samma manifest från kommandoraden med hjälp av pg_restore_ direkt:

source: The problem with a dump file full of PostGIS function signatures is that we really wanted a dump of our data, not our system functions.
es: El problema con un archivo de volcado lleno de firmas de funciones de PostGIS es que realmente queremos un volcado de nuestros datos, no de nuestras funciones de sistema.
sv: Problemet med en dumpfil full av PostGIS-funktionssignaturer är att vi egentligen ville ha en dump av våra data, inte av våra systemfunktioner.

source: Since every object is in the dump file, we can restore to a blank database and get full functionality. In doing so, we are expecting that system we are restoring to has exactly the same version of PostGIS as the one we dumped from (since the function signature definitions reference a particular version of the PostGIS shared library).
es: Dado que cada objeto está en el archivo de volcado, podemos restaurar en una base de datos vacía y obtener funcionalidad completa. Al hacerlo, esperamos que el sistema al que restauramos tenga exactamente la misma versión de PostGIS que la que usamos para el volcado (ya que las definiciones de firmas de funciones hacen referencia a una versión particular de la biblioteca compartida de PostGIS).
sv: Eftersom varje objekt finns i dumpfilen kan vi återställa till en tom databas och få full funktionalitet. När vi gör det förväntar vi oss att det system vi återställer till har exakt samma version av PostGIS som det vi dumpade från (eftersom funktionssignaturdefinitionerna hänvisar till en viss version av det delade biblioteket PostGIS).

source: From the command-line the restore looks like this:
es: Desde la línea de comandos, la restauración se ve así:
sv: Från kommandoraden ser återställningen ut så här:

source: Dumping just data, without function signatures, is where having data in schemas is handy, because there is a command-line flag to only dump a particular schema:
es: Volcar solo datos, sin firmas de funciones, es donde tener datos en esquemas resulta útil, porque hay una bandera en la línea de comandos para volcar solo un esquema en particular:
sv: Att bara dumpa data utan funktionssignaturer är praktiskt eftersom det finns en kommandoradsflagga som gör att man bara kan dumpa ett visst schema:

source: Now when we list the contents of the dump, we see just the data tables we wanted::
es: Ahora, cuando listamos el contenido del volcado, vemos solo las tablas de datos que queríamos::
sv: När vi nu listar innehållet i dumpningen ser vi precis de datatabeller vi ville ha::

source: Having just the data tables is handy, because it means we can store to a database with any version of PostGIS installed, as we talk about in :ref:`upgrades`.
es: Tener solo las tablas de datos es útil, porque significa que podemos restaurar a una base de datos con cualquier versión de PostGIS instalada, como hablamos en :ref:`upgrades`.
sv: Det är praktiskt att bara ha datatabellerna, eftersom det innebär att vi kan lagra i en databas med vilken version av PostGIS som helst installerad, som vi talar om i :ref:`upgrades`.

source: Backing Up Users
es: Respaldo de usuarios
sv: Säkerhetskopiera användare

source: The pg_dump_ utility operates a database at a time (or a schema or table at a time, if you restrict it). However, information about users is is stored across an entire cluster, it's not stored in any one database!
es: La utilidad pg_dump_ opera sobre una base de datos a la vez (o un esquema o tabla a la vez, si lo restringes). Sin embargo, la información de usuarios se almacena en todo un clúster, ¡no está en ninguna base de datos específica!
sv: Verktyget pg_dump_ hanterar en databas åt gången (eller ett schema eller en tabell åt gången, om du begränsar det). Information om användare lagras dock över ett helt kluster, den lagras inte i någon enskild databas!

source: To backup your user information, use the pg_dumpall_ utility, with the "--globals-only" flag.
es: Para respaldar tu información de usuarios, usa la utilidad pg_dumpall_ con la bandera "--globals-only".
sv: För att säkerhetskopiera din användarinformation använder du verktyget pg_dumpall_ med flaggan "--globals-only".

source: You can also use pg_dumpall_ in its default mode to backup an entire cluster, but be aware that, as with pg_dump_, you will end up backing up the PostGIS function signatures, so the dump will have to be restored against an identical software installation, it can't be used as part of an upgrade process.
es: También puedes usar pg_dumpall_ en su modo por defecto para respaldar un clúster completo, pero ten en cuenta que, al igual que con pg_dump_, terminarás respaldando las firmas de funciones de PostGIS, por lo que el volcado deberá restaurarse en una instalación de software idéntica, no puede usarse como parte de un proceso de actualización.
sv: Du kan också använda pg_dumpall_ i dess standardläge för att säkerhetskopiera ett helt kluster, men tänk på att du, precis som med pg_dump_, kommer att säkerhetskopiera PostGIS-funktionssignaturerna, så dumpen måste återställas mot en identisk programvaruinstallation, den kan inte användas som en del av en uppgraderingsprocess.

source: Online Backup and Restore
es: Respaldo y restauración en línea
sv: Online backup och återställning

source: Online backup and restore allows an administrator to keep an extremely up-to-date set of backup files without the overhead of repeatedly dumping the entire database. If the database is under frequent insert and update load, then online backup might be preferable to basic backup.
es: El respaldo y restauración en línea permite a un administrador mantener un conjunto extremadamente actualizado de archivos de respaldo sin la sobrecarga de volcar repetidamente toda la base de datos. Si la base de datos tiene una carga frecuente de inserciones y actualizaciones, entonces el respaldo en línea podría ser preferible al respaldo básico.
sv: Online backup och återställning gör det möjligt för en administratör att hålla en extremt uppdaterad uppsättning backupfiler utan att behöva dumpa hela databasen upprepade gånger. Om databasen ofta utsätts för inmatningar och uppdateringar kan onlinebackup vara att föredra framför grundläggande backup.

source: The best way to learn about online backup is to read the relevant sections of the PostgreSQL manual on `continuous archiving and point-in-time recovery <http://www.postgresql.org/docs/current/static/continuous-archiving.html>`_. This section of the PostGIS workshop will just provide a brief snapshot of online backup set-up.
es: La mejor forma de aprender sobre el respaldo en línea es leer las secciones relevantes del manual de PostgreSQL sobre `archivado continuo y recuperación a un punto en el tiempo <http://www.postgresql.org/docs/current/static/continuous-archiving.html>`_. Esta sección del taller de PostGIS solo proporcionará una breve visión del proceso de configuración del respaldo en línea.
sv: Det bästa sättet att lära sig om säkerhetskopiering online är att läsa relevanta avsnitt i PostgreSQL-manualen om `kontinuerlig arkivering och återställning av punkt i tid <http://www.postgresql.org/docs/current/static/continuous-archiving.html>`_. Det här avsnittet i PostGIS-workshopen kommer bara att ge en kort ögonblicksbild av online-säkerhetskopiering.

source: How it Works
es: Cómo funciona
sv: Hur det fungerar

source: Rather than continually write to the main data tables, PostgreSQL stores changes initially in "write-ahead logs" (WAL). Taken together, these logs are a complete record of all changes made to a database. Online backup consists of taking a copy of the database main data table, then taking a copy of each WAL that is generated from then on.
es: En lugar de escribir continuamente en las tablas principales de datos, PostgreSQL almacena los cambios inicialmente en "write-ahead logs" (WAL). Tomados en conjunto, estos registros son un registro completo de todos los cambios hechos a una base de datos. El respaldo en línea consiste en tomar una copia de la tabla principal de datos de la base de datos, luego tomar una copia de cada WAL que se genere a partir de entonces.
sv: I stället för att kontinuerligt skriva till huvuddatatabellerna lagrar PostgreSQL ändringar initialt i "write-ahead logs" (WAL). Sammantaget är dessa loggar en fullständig registrering av alla ändringar som gjorts i en databas. Onlinebackup består av att ta en kopia av databasens huvuddatatabell och sedan ta en kopia av varje WAL som genereras från och med då.

source: When it is time to recover to a new database, the system starts on the main data copy, then replays all the WAL files into the database. The end result is a restored database in the same state as the original at the time of the last WAL received.
es: Cuando llega el momento de recuperar en una nueva base de datos, el sistema comienza con la copia principal de datos, luego reproduce todos los archivos WAL en la base de datos. El resultado final es una base de datos restaurada en el mismo estado que la original en el momento del último WAL recibido.
sv: När det är dags att återställa till en ny databas startar systemet på huvuddatakopian och spelar sedan in alla WAL-filer i databasen. Slutresultatet är en återställd databas i samma skick som originalet vid tidpunkten för den senast mottagna WAL-filen.

source: Because WAL are being written anyways, and transferring copies to an archive server is computationally cheap, online backup is an effective means of keeping a very up-to-date backup of a system without resorting to intensive regular full dumps.
es: Como los WAL se escriben de todas formas y transferir copias a un servidor de archivo es computacionalmente barato, el respaldo en línea es un medio eficaz de mantener un respaldo muy actualizado de un sistema sin recurrir a volcados completos regulares intensivos.
sv: Eftersom WAL skrivs ändå och det är billigt att överföra kopior till en arkivserver är onlinebackup ett effektivt sätt att hålla en mycket aktuell backup av ett system utan att behöva använda intensiva regelbundna fulldumps.

source: Archiving the WAL Files
es: Archivado de archivos WAL
sv: Arkivering av WAL-filer

source: The first thing to do in setting up online backup is to create an archiving method. PostgreSQL archiving methods are the ultimate in flexibility: the PostgreSQL backend simply calls a script specified in the ``archive_command`` configuration parameter.
es: Lo primero que hay que hacer al configurar respaldo en línea es crear un método de archivado. Los métodos de archivado de PostgreSQL son lo último en flexibilidad: el backend de PostgreSQL simplemente llama a un script especificado en el parámetro de configuración ``archive_command``.
sv: Det första du ska göra för att ställa in säkerhetskopiering online är att skapa en arkiveringsmetod. PostgreSQL-arkiveringsmetoder är det ultimata i flexibilitet: PostgreSQL-backend anropar helt enkelt ett skript som anges i konfigurationsparametern ``archive_command``.

source: That means archiving can be as simple as copying the file to a network-mounted drive, and as complex as encrypting and emailing the files to the remote archive. Any process you can script you can use to archive the files.
es: Eso significa que el archivado puede ser tan simple como copiar el archivo a una unidad montada en red, o tan complejo como encriptar y enviar por correo electrónico los archivos al archivo remoto. Cualquier proceso que puedas escribir en un script puedes usarlo para archivar los archivos.
sv: Det innebär att arkivering kan vara så enkelt som att kopiera filen till en nätverksmonterad enhet, och så komplext som att kryptera och e-posta filerna till fjärrarkivet. Alla processer som du kan skripta kan du använda för att arkivera filerna.

source: To turn on archiving we will edit ``postgresql.conf``, first turning on WAL archiving:
es: Para activar el archivado editaremos ``postgresql.conf``, primero activando el archivado WAL:
sv: För att slå på arkivering ska vi redigera ``postgresql.conf`` och först slå på WAL-arkivering:

source: And then setting the ``archive_command`` to copy our archive files to a safe location (changing the destination paths as appropriate):
es: Y luego configurando el ``archive_command`` para copiar nuestros archivos de archivo a una ubicación segura (cambiando las rutas de destino según corresponda):
sv: Och sedan ställa in ``archive_command`` för att kopiera våra arkivfiler till en säker plats (ändra destinationssökvägarna efter behov):

source: It is important that the archive command not over-write existing files, so the unix command includes an initial test to ensure that the files aren't already there. It is also important that the command returns a non-zero status if the copy process fails.
es: Es importante que el comando de archivado no sobrescriba archivos existentes, por lo que el comando de unix incluye una prueba inicial para asegurarse de que los archivos no estén ya allí. También es importante que el comando devuelva un estado distinto de cero si el proceso de copia falla.
sv: Det är viktigt att arkivkommandot inte skriver över befintliga filer, så unix-kommandot innehåller ett första test för att säkerställa att filerna inte redan finns där. Det är också viktigt att kommandot returnerar en status som inte är noll om kopieringsprocessen misslyckas.

source: Once the changes are made you can re-start PostgreSQL to make them effective.
es: Una vez hechos los cambios, puedes reiniciar PostgreSQL para hacerlos efectivos.
sv: När ändringarna har gjorts kan du starta om PostgreSQL för att göra dem effektiva.

source: Taking the Base Backup
es: Tomando la copia base
sv: Ta backup av basen
