Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/backup.po
Languages: es, sv

source: Once the archiving process is in place, you need to take a base back-up.
es: Una vez que el proceso de archivado está en marcha, necesitas tomar una copia base.
sv: När arkiveringsprocessen är på plats måste du ta en grundläggande säkerhetskopia.

source: Put the database into backup mode (this doesn't do anything to alter operation of queries or data updates, it just forces a checkpoint and writes a label file indicating when the backup was taken).
es: Pon la base de datos en modo respaldo (esto no altera en nada la operación de consultas o actualizaciones de datos, solo fuerza un checkpoint y escribe un archivo de etiqueta indicando cuándo se tomó el respaldo).
sv: Sätt databasen i säkerhetskopieringsläge (detta gör ingenting för att ändra driften av frågor eller datauppdateringar, det tvingar bara fram en kontrollpunkt och skriver en etikettfil som anger när säkerhetskopian togs).

source: For the label, using the path to the backup file is a good practice, as it helps you track down where the backup was stored.
es: Para la etiqueta, usar la ruta del archivo de respaldo es una buena práctica, ya que te ayuda a rastrear dónde se almacenó el respaldo.
sv: För etiketten är det en bra metod att använda sökvägen till säkerhetskopian, eftersom det hjälper dig att spåra var säkerhetskopian lagrades.

source: Copy the database to an archival location:
es: Copia la base de datos a una ubicación de archivo:
sv: Kopiera databasen till en arkiveringsplats:

source: Then tell the database the backup process is complete.
es: Luego indica a la base de datos que el proceso de respaldo está completo.
sv: Meddela sedan databasen att säkerhetskopieringen är slutförd.

source: All these steps can of course be scripted for regular base backups.
es: Todos estos pasos, por supuesto, pueden ser automatizados con scripts para respaldos base regulares.
sv: Alla dessa steg kan naturligtvis skriptas för regelbundna säkerhetskopieringar.

source: Restoring from the Archive
es: Restauración desde el archivo
sv: Återställning från arkivet

source: These steps are taking from the PostgreSQL manual on `continuous archiving and point-in-time recovery <http://www.postgresql.org/docs/current/static/continuous-archiving.html>`_.
es: Estos pasos están tomados del manual de PostgreSQL sobre `archivado continuo y recuperación a un punto en el tiempo <http://www.postgresql.org/docs/current/static/continuous-archiving.html>`_.
sv: Dessa steg tas från PostgreSQL-manualen om `kontinuerlig arkivering och återställning av punkt i tid <http://www.postgresql.org/docs/current/static/continuous-archiving.html>`_.

source: Stop the server, if it's running.
es: Detén el servidor, si está en ejecución.
sv: Stoppa servern, om den är igång.

source: If you have the space to do so, copy the whole cluster data directory and any tablespaces to a temporary location in case you need them later. Note that this precaution will require that you have enough free space on your system to hold two copies of your existing database. If you do not have enough space, you should at least save the contents of the cluster's pg_xlog subdirectory, as it might contain logs which were not archived before the system went down.
es: Si tienes espacio suficiente, copia todo el directorio de datos del clúster y cualquier tablespace a una ubicación temporal en caso de que los necesites más adelante. Ten en cuenta que esta precaución requiere tener suficiente espacio libre en tu sistema para mantener dos copias de tu base de datos existente. Si no tienes espacio suficiente, al menos deberías guardar el contenido del subdirectorio pg_xlog del clúster, ya que podría contener registros que no fueron archivados antes de que el sistema se detuviera.
sv: Om du har utrymme för det kan du kopiera hela datakatalogen för klustret och alla tablespaces till en tillfällig plats om du behöver dem senare. Observera att denna försiktighetsåtgärd kräver att du har tillräckligt med ledigt utrymme på ditt system för att hålla två kopior av din befintliga databas. Om du inte har tillräckligt med utrymme bör du åtminstone spara innehållet i klustrets underkatalog pg_xlog, eftersom den kan innehålla loggar som inte arkiverades innan systemet gick ner.

source: Remove all existing files and subdirectories under the cluster data directory and under the root directories of any tablespaces you are using.
es: Elimina todos los archivos y subdirectorios existentes en el directorio de datos del clúster y en los directorios raíz de cualquier tablespace que estés utilizando.
sv: Ta bort alla befintliga filer och underkataloger under klusterdatakatalogen och under rotkatalogerna för alla tablespaces som du använder.

source: Restore the database files from your file system backup. Be sure that they are restored with the right ownership (the database system user, not root!) and with the right permissions. If you are using tablespaces, you should verify that the symbolic links in pg_tblspc/ were correctly restored.
es: Restaura los archivos de la base de datos desde tu respaldo del sistema de archivos. Asegúrate de que se restauren con la propiedad correcta (el usuario del sistema de base de datos, ¡no root!) y con los permisos adecuados. Si estás usando tablespaces, deberías verificar que los enlaces simbólicos en pg_tblspc/ se restauraron correctamente.
sv: Återställ databasfilerna från din säkerhetskopia av filsystemet. Se till att de återställs med rätt ägarskap (databassystemets användare, inte root!) och med rätt behörigheter. Om du använder tablespaces bör du kontrollera att de symboliska länkarna i pg_tblspc/ har återställts korrekt.

source: Remove any files present in pg_xlog/; these came from the file system backup and are therefore probably obsolete rather than current. If you didn't archive pg_xlog/ at all, then recreate it with proper permissions, being careful to ensure that you re-establish it as a symbolic link if you had it set up that way before.
es: Elimina cualquier archivo presente en pg_xlog/; estos provienen del respaldo del sistema de archivos y probablemente estén obsoletos en lugar de ser actuales. Si no archivaste pg_xlog/ en absoluto, entonces recréalo con los permisos adecuados, asegurándote de restablecerlo como un enlace simbólico si lo tenías configurado de esa manera antes.
sv: Ta bort alla filer som finns i pg_xlog/; dessa kom från säkerhetskopian av filsystemet och är därför förmodligen föråldrade snarare än aktuella. Om du inte arkiverade pg_xlog/ alls, återskapa den med korrekta behörigheter och var noga med att se till att du återskapar den som en symbolisk länk om du hade konfigurerat den på det sättet tidigare.

source: If you have unarchived WAL segment files that you saved in step 2, copy them into pg_xlog/. (It is best to copy them, not move them, so you still have the unmodified files if a problem occurs and you have to start over.)
es: Si tienes archivos de segmentos WAL no archivados que guardaste en el paso 2, cópialos en pg_xlog/. (Es mejor copiarlos, no moverlos, para que aún tengas los archivos sin modificar si ocurre un problema y debes empezar de nuevo.)
sv: Om du har oarkiverade WAL-segmentfiler som du sparade i steg 2, kopiera dem till pg_xlog/. (Det är bäst att kopiera dem, inte flytta dem, så att du fortfarande har de omodifierade filerna om ett problem uppstår och du måste börja om)

source: Create a recovery command file recovery.conf in the cluster data directory (see Chapter 26). You might also want to temporarily modify pg_hba.conf to prevent ordinary users from connecting until you are sure the recovery was successful.
es: Crea un archivo de comando de recuperación recovery.conf en el directorio de datos del clúster (ver el Capítulo 26). También puedes querer modificar temporalmente pg_hba.conf para evitar que usuarios ordinarios se conecten hasta que estés seguro de que la recuperación fue exitosa.
sv: Skapa en kommandofil för återställning, recovery.conf, i klustrets datakatalog (se kapitel 26). Du kanske också vill ändra pg_hba.conf tillfälligt för att hindra vanliga användare från att ansluta tills du är säker på att återställningen har lyckats.

source: Start the server. The server will go into recovery mode and proceed to read through the archived WAL files it needs. Should the recovery be terminated because of an external error, the server can simply be restarted and it will continue recovery. Upon completion of the recovery process, the server will rename recovery.conf to recovery.done (to prevent accidentally re-entering recovery mode later) and then commence normal database operations.
es: Inicia el servidor. El servidor entrará en modo de recuperación y procederá a leer los archivos WAL archivados que necesita. Si la recuperación se interrumpe por un error externo, el servidor puede simplemente reiniciarse y continuará con la recuperación. Al completarse el proceso de recuperación, el servidor renombrará recovery.conf a recovery.done (para evitar entrar accidentalmente en modo de recuperación más adelante) y luego comenzará las operaciones normales de base de datos.
sv: Starta servern. Servern går in i återställningsläge och fortsätter att läsa igenom de arkiverade WAL-filer som den behöver. Om återställningen skulle avbrytas på grund av ett externt fel kan servern helt enkelt startas om så fortsätter återställningen. När återställningsprocessen har slutförts byter servern namn på recovery.conf till recovery.done (för att förhindra att återställningsläget av misstag återinförs senare) och påbörjar sedan normal databasdrift.

source: Inspect the contents of the database to ensure you have recovered to the desired state. If not, return to step 1. If all is well, allow your users to connect by restoring pg_hba.conf to normal.
es: Inspecciona el contenido de la base de datos para asegurarte de que se haya recuperado al estado deseado. Si no es así, vuelve al paso 1. Si todo está correcto, permite que tus usuarios se conecten restaurando pg_hba.conf a su estado normal.
sv: Kontrollera innehållet i databasen för att säkerställa att du har återställt till önskat tillstånd. Om inte, återgå till steg 1. Om allt är bra kan du låta dina användare ansluta genom att återställa pg_hba.conf till det normala.

source: Links
es: Enlaces
sv: Länkar

source: `PostgreSQL High Availability <http://www.postgresql.org/docs/current/static/high-availability.html>`_
es: `Alta Disponibilidad en PostgreSQL <http://www.postgresql.org/docs/current/static/high-availability.html>`_

source: `PostgreSQL High Availability Continuous Archiving and PITR <http://www.postgresql.org/docs/current/static/continuous-archiving.html>`_
es: `Archivo continuo en alta disponibilidad y PITR en PostgreSQL <http://www.postgresql.org/docs/current/static/continuous-archiving.html>`_
