Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/clusterindex.po
Languages: es, sv, uk, zh_hans

source: Clustering on Indices
es: Clustering sobre índices
sv: Klustring på index
uk: Кластеризація індексів
zh_hans: 索引聚类

source: Databases can only retrieve information as fast as they can get it off of disk. Small databases will float up entirely into RAM cache, and get away from physical disk limitations, but for large databases, access to the physical disk will be a limiting stop in disk access speed.
es: La velocidad máxima a la que las bases de datos pueden recuperar información depende de la velocidad a la que puedan leerla del disco. Las bases de datos pequeñas pueden cargar toda su información en el cache RAM y evitar las limitaciones físicas de los discos, pero para bases de datos grandes el acceso al disco físico será un tope en cuanto a la velocidad de acceso a disco.
sv: Databaser kan bara hämta information så snabbt som de kan få ut den från disken. Små databaser flyter helt upp i RAM-cache och slipper fysiska diskbegränsningar, men för stora databaser kommer åtkomsten till den fysiska disken att vara ett begränsande stopp i diskåtkomsthastigheten.
uk: Бази даних можуть отримувати інформацію лише так швидко, як швидко вони можуть зчитувати її з диска. Невеликі бази даних повністю поміщаються в кеш оперативної пам’яті (RAM) і таким чином обходять обмеження фізичного диска, але для великих баз даних доступ до фізичного диска стає вузьким місцем у швидкості доступу до даних.
zh_hans: 数据库的查询速度受限于磁盘读取性能。小型数据库可完全载入内存缓存，从而规避物理磁盘的瓶颈；但对于大型数据库而言，物理磁盘的I/O速度将成为数据访问的关键制约因素。

source: Data is written to disk opportunistically, so there is not necessarily any correlation between the order data is stored on the disk and the way it will be accessed or organized by applications.
es: Los datos se escriben a disco de forma oportunista, de forma que no hay necesariamente ninguna correlación entre el orden en que se almacenan en disco y la forma en que las aplicaciones accederán a ellos o los organizarán.
sv: Data skrivs till disken på ett opportunistiskt sätt, så det finns inte nödvändigtvis någon korrelation mellan den ordning data lagras på disken och hur de kommer att användas eller organiseras av programmen.
uk: Дані записуються на диск за можливістю, тому немає обов’язкової кореляції між порядком зберігання даних на диску і тим, як вони будуть доступні або організовані в додатках.
zh_hans: 数据写入磁盘的顺序具有随机性，因此磁盘存储顺序与应用程序访问或组织方式之间不存在必然关联。

source: One way to speed up access to data is to ensure that records which is likely to be retrieved together in the same result set are located in similar physical locations on the hard disk platters. This is called "clustering".
es: Una forma de acelerar el acceso a los datos es asegurarse de que los registros que probablemente se recuperarán juntos se encuentran en ubicaciones físicas similares en los platos del disco duro. Esto se denomina «agrupación».
sv: Ett sätt att snabba upp åtkomsten till data är att se till att poster som sannolikt kommer att hämtas tillsammans i samma resultatmängd finns på liknande fysiska platser på hårddiskplattorna. Detta kallas "klustring".
uk: Один зі способів прискорити доступ до даних — гарантувати, що записи, які, ймовірно, будуть отримані разом у одному наборі результатів, розташовані у схожих фізичних місцях на пластинах жорсткого диска. Це називається «кластеризацією».
zh_hans: 提升数据访问速度的一种有效方法是通过"聚类"（Clustering）技术，确保可能被同时检索的记录在物理磁盘上相邻存储。

source: The right clustering scheme to use can be tricky, but a general rule applies: indexes define a natural ordering scheme for data which is similar to the access pattern that will be used in retrieving the data.
es: El esquema de agrupación adecuado puede ser complicado, pero se aplica una regla general: los índices definen un esquema de ordenación natural para los datos que es similar al patrón de acceso que se utilizará para recuperar los datos.
sv: Det kan vara svårt att välja rätt klustringsschema, men en allmän regel gäller: index definierar ett naturligt ordningsschema för data som liknar det åtkomstmönster som kommer att användas vid hämtning av data.
uk: Вибір правильної схеми кластеризації може бути складним, але існує загальне правило: індекси визначають природний порядок даних, який схожий на патерн доступу, що буде використовуватись для отримання даних.
zh_hans: 选择合适的聚类方案可能较为复杂，但有一条通用原则：索引定义了数据的自然排序方式，这种排序应与数据检索时的访问模式相匹配。

source: Because of this, ordering the data on the disk in the same order as the index can provide a speed advantage in some cases.
es: Por ello, ordenar los datos en el disco en el mismo orden que el índice puede proporcionar una ventaja de velocidad en algunos casos.
sv: Därför kan det i vissa fall ge en hastighetsfördel att ordna data på disken i samma ordning som indexet.
uk: Через це впорядкування даних на диску в тому ж порядку, що й індекс, може в деяких випадках забезпечити прискорення роботи.
zh_hans: 因此，将磁盘上的数据按照索引顺序存储，在某些情况下可获得查询加速效果。

source: Clustering on the R-Tree
es: Clustering sobre el R-Tree
sv: Klustring på R-trädet
uk: Кластеризація на основі R-Tree
zh_hans: 基于R-Tree的聚类

source: Spatial data tends to be accessed in spatially correlated windows: think of the map window in a web or desktop application. All the data in the windows has similar location value (or it wouldn't be in the window!)
es: Se suele acceder a los datos espaciales en ventanas correladas espacialmente: piensemos en la ventana de mapa de una aplicación web o de escritorio. Todos los datos en la ventana tienen un valor de localización similar (¡o no estarían dentro de la ventana!).
sv: Spatial data tenderar att nås i spatialt korrelerade fönster: tänk på kartfönstret i en webb- eller skrivbordsapplikation. Alla data i fönstren har liknande platsvärde (annars skulle de inte finnas i fönstret!)
uk: Просторові дані зазвичай отримують доступ у просторово корельованих вікнах: уявіть собі вікно карти у веб або настільному додатку. Всі дані у вікні мають схожі координати (інакше вони б не були у цьому вікні!)
zh_hans: 空间数据的访问往往具有空间相关性：例如网页或桌面应用中的地图窗口。窗口内的所有数据都具有相似的地理位置特征（否则就不会出现在该窗口中！）

source: So, clustering based on a spatial index makes sense for spatial data that is going to be accessed with spatial queries: similar things tend to have similar locations.
es: Así, el clustering basado en un índice espacial tiene sentido para datos espaciales a los que se va a acceder mediante queries espaciales: cosas similares tienden a tener localizaciones similares.
sv: Klustring baserad på ett spatialt index är därför meningsfullt för spatiala data som kommer att nås med spatiala frågor: liknande saker tenderar att ha liknande platser.
uk: Отже, кластеризація на основі просторового індексу має сенс для просторових даних, які будуть доступні через просторові запити: схожі об’єкти зазвичай розташовані близько один до одного.
zh_hans: 因此，基于空间索引的聚类操作特别适合将通过空间查询访问的数据——因为具有相似特征的对象往往位置也相近。

source: Let's cluster our ``nyc_census_blocks`` based on their spatial index:
es: Vamos a hacer un cluster con nuestro ``nyc_census_blocks`` basado en su índice espacial:
sv: Låt oss klustra våra ``nyc_census_block`` baserat på deras spatiala index:
uk: Давайте виконаємо кластеризацію таблиці ``nyc_census_blocks ``на основі їх просторового індексу:
zh_hans: 基于空间索引对``nyc_census_blocks``进行聚类操作：

source: The command re-writes the ``nyc_census_blocks`` in the order defined by the spatial index ``nyc_census_blocks_geom_gist``. Can you perceive a speed difference? Maybe not, because the original data may have already had some pre-existing spatial ordering (this is not uncommon in GIS data sets).
es: El comando re-escribe ``nyc_census_blocks`` en el orden definido por el índice espacial ``nyc_census_blocks_geom_gist``. ¿Se percibe una diferencia de velocidad? Quizás no, porque los datos originales puede que tenga ya algún orden espacial preexistente (esto no es raro en los juegos de datos de SIG).
sv: Kommandot skriver om ``nyc_census_blocks`` i den ordning som definieras av det spatiala indexet ``nyc_census_blocks_geom_gist``. Kan du se någon hastighetsskillnad? Kanske inte, eftersom originaldata redan kan ha haft en viss befintlig spatial ordning (detta är inte ovanligt i GIS-datauppsättningar).
uk: Ця команда переписує таблицю ``nyc_census_blocks`` у порядку, визначеному просторовим індексом ``nyc_census_blocks_geom_gist``. Чи відчуєте ви різницю у швидкості? Можливо, ні, бо початкові дані могли вже мати певне просторове впорядкування (це не рідкість у наборах даних GIS).
zh_hans: 该命令会按照空间索引``nyc_census_blocks_geom_gist``定义的顺序重写``nyc_census_blocks``表数据。您可能感知不到速度差异——因为原始数据可能已具备一定的空间预排序（这在GIS数据集中较为常见）。

source: Disk Versus Memory/SSD
es: Disco vs Memoria/SSD
sv: Disk jämfört med minne/SSD
uk: Диск проти ОЗП/SSD
zh_hans: 磁盘存储 vs 内存/固态存储

source: Most modern databases are run using SSD storage, which is much faster at random access than old spinning magnetic media. Also, most modern databases are running on top of data which is small enough to fit into the RAM of the database server, and ends up there as the operating system "virtual filesystem" caches it.
es: La mayoría de las bases de datos modernas funcionan sobre almacenamiento SSD, que es mucho más rápido para accesos aleatorios que los viejos medios discos magnéticos girantes. Además, la mayoría de las bases de datos modernas funcionan sobre datos que son los bastante pequeños para caber en la RAM del servidor de la base de datos, y terminan allí según el "sistema de archivos virtual" del sistema operativo los va cacheando.
sv: De flesta moderna databaser körs med SSD-lagring, som är mycket snabbare vid slumpmässig åtkomst än gamla roterande magnetiska medier. Dessutom körs de flesta moderna databaser på data som är tillräckligt små för att rymmas i databasserverns RAM-minne och som hamnar där när operativsystemets "virtuella filsystem" lagrar dem i cacheminnet.
uk: Більшість сучасних баз даних працюють на SSD-накопичувачах, які значно швидші при випадковому доступі, ніж старі магнітні диски з обертанням. Також більшість сучасних баз даних працюють із даними, які достатньо малі, щоб поміститися в оперативну пам’ять сервера бази даних, і в кінцевому результаті там опиняються завдяки кешуванню віртуальної файлової системи операційної системи.
zh_hans: 现代数据库普遍采用固态硬盘(SSD)存储，其随机访问速度远胜传统机械硬盘。此外，当代数据库处理的数据量通常足够小，可完全载入数据库服务器的内存空间，并最终通过操作系统"虚拟文件系统"进行缓存。

source: Is clustering still necessary?
es: ¿Es todavía necesario el clustering?
sv: Är klustring fortfarande nödvändigt?
uk: Чи кластеризація все ще потрібна?
zh_hans: 空间索引聚类是否仍有必要？

source: Surprisingly, yes. Keeping records that are "near each other" in space "near each other" in memory increases the odds that related records will move up the servers "memory cache heirarchy" together, and thus make memory accesses faster.
es: Sorprendentemente, sí. Mantener registros que están "cerca del otro" en espacios "cerca del otro" en la memoria aumenta las posibilidades de que registros relacionados se muevan en la "jerarquia de memoria caché" juntos haciendo el acceso a la memoria más rápido.
sv: Förvånansvärt nog, ja. Att hålla poster som är "nära varandra" i rymden "nära varandra" i minnet ökar oddsen för att relaterade poster kommer att flytta upp i servrarnas "minnescache-hirarki" tillsammans, och därmed göra minnesåtkomster snabbare.
uk: Дивно, але так. Зберігання записів, які "розташовані близько один до одного" у просторі, також "поряд" у пам’яті збільшує ймовірність того, що пов’язані записи одночасно потраплять до кешу пам’яті сервера, що прискорює доступ до пам’яті.
zh_hans: 令人惊讶的是，确实如此。将空间上「邻近」的记录在内存中也保持「邻近存储」，能显著提升相关记录共同进入服务器「内存缓存层级」的概率，从而加速内存访问效率。

source: System RAM is not the fastest memory on a modern computer. There are several levels of cache between system RAM and the actual CPU, and the underlying operating system and processor will move data up and down the cache heirarchy in blocks. If the block getting moved up happens to include the piece of data the system will need next... that's a big win. Correlating the memory structure with the spatial structure is a way in increase the odds of that win happening.
es: La RAM del sistema no es la memoria más rápida en un ordenador moderno. Hay muchos niveles de caché entre el sistema RAM y la CPU, y el sistema operativo y el procesador moverán datos arriba y abajo en esa jerarquia de caché en bloques. Si resulta que el bloque que se está moviendo incluye el trozo de datos que el sistema necesitará justo después,... es una gran victoria. Correlar la estructura de la memoria con la estructura espacial es un forma de aumentar las posibilidades de que esto suceda.
sv: System-RAM är inte det snabbaste minnet i en modern dator. Det finns flera nivåer av cache mellan systemets RAM-minne och den faktiska processorn, och det underliggande operativsystemet och processorn flyttar data upp och ner i cache-hierarkin i block. Om det block som flyttas upp råkar innehålla den del av data som systemet behöver härnäst är det en stor vinst. Att korrelera minnesstrukturen med den spatiala strukturen är ett sätt att öka oddsen för att den vinsten ska inträffa.
uk: Оперативна пам’ять системи — не найшвидша пам’ять у сучасному комп’ютері. Існує кілька рівнів кешу між системною пам’яттю і процесором, і операційна система разом із процесором переміщують дані по ієрархії кешу блоками. Якщо блок, що переміщується вгору, містить потрібний для системи наступний фрагмент даних — це велика перевага. Узгодження структури пам’яті зі просторовою структурою збільшує шанси на таку вигідну ситуацію.
zh_hans: 在现代计算机体系中，系统内存(RAM)并非最快存储层级。CPU与内存之间存在多级缓存，操作系统和处理器会以数据块为单位在缓存层级间上下迁移。若被预载入缓存的数据块恰好包含系统即将需要的数据——这将显著提升性能。通过使内存数据分布与空间结构相关联，可有效增加这种「缓存命中」的概率。

source: Does Index Structure Matter?
es: ¿Importa la Estructura del Índice?
sv: Har indexstrukturen någon betydelse?
uk: Чи має значення структура індексу?
zh_hans: 索引结构是否影响性能？

source: In theory, yes. In practice, no really. As long as the index is a "pretty good" spatial decomposition of the data, the main determinant of performance will be the order of the actual table tuples.
es: En teoría, sí. En la práctica, realmente no. Ya que el índice es una descomposición espacial de los datos "bastante buena", el principal factor que afectará al rendimiento será el orden de las tuplas de la tabla.
sv: I teorin, ja. I praktiken inte riktigt. Så länge indexet är en "ganska bra" spatial nedbrytning av data kommer den viktigaste faktorn för prestanda att vara ordningen på de faktiska tabelltuplerna.
uk: Теоретично — так. Насправді ж — не дуже. Поки індекс є «досить хорошим» просторовим поділом даних, основним чинником продуктивності буде порядок розташування рядків у таблиці.
zh_hans: 理论上可行，但实际效果有限。只要索引能对数据实现「基本合理」的空间分解，查询性能的主要决定因素仍是表数据的物理存储顺序。

source: The difference between "no index" and "index" is generally huge and highly measurable. The difference between "mediocre index" and "great index" usually takes quite careful measurement to discern, and can be very sensitive to the workload being tested.
es: La diferencia entre "sin indice" e "índice" normalmente es muy grande y muy medible. La diferencia entre "índice mediocre" y "gran índice" normalmente requiere una medida muy cuidadosa para diferenciar y puede ser muy sensible a la carga de trabajo que se esté testando.
sv: Skillnaden mellan "inget index" och "index" är i allmänhet enorm och mycket mätbar. Skillnaden mellan "mediokert index" och "bra index" kräver vanligtvis ganska noggranna mätningar för att urskiljas och kan vara mycket känslig för den arbetsbelastning som testas.
uk: Різниця між «відсутністю індексу» і «наявністю індексу» зазвичай величезна та легко вимірювана. Різниця між «посереднім індексом» і «відмінним індексом» зазвичай потребує дуже ретельного вимірювання і може сильно залежати від навантаження, яке тестується.
zh_hans: "无索引"与"有索引"的性能差异通常非常显著且易于量化，而"普通索引"与"优化索引"的差距往往需要精细测试才能辨别，且对具体工作负载高度敏感。

source: Function List
es: Lista de funciones
sv: Funktionslista
uk: Список функцій
zh_hans: 函数列表

source: `CLUSTER <https://www.postgresql.org/docs/current/sql-cluster.html>`_: Re-orders the data in a table to match the ordering in the index.
es: `CLUSTER <https://www.postgresql.org/docs/current/sql-cluster.html>`_: Reordena los datos en la tabla para que coincida con el orden del índice.
sv: `CLUSTER <https://www.postgresql.org/docs/current/sql-cluster.html>`_: Ordnar om data i en tabell så att de stämmer överens med ordningen i indexet.
uk: `CLUSTER <https://www.postgresql.org/docs/current/sql-cluster.html>`_ : Перепорядковує дані в таблиці відповідно до порядку, заданого індексом.
zh_hans: `CLUSTER <https://www.postgresql.org/docs/current/sql-cluster.html>`_：按照索引顺序重新排列表中的数据存储顺序。
