Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/creating_db.po
Languages: es, sv

source: Creating a Spatial Database
es: Creando una Base de Datos Espacial
sv: Skapa en spatial databas

source: PostgreSQL has a number of administrative front-ends. The primary one is `psql <http://www.postgresql.org/docs/current/static/app-psql.html>`_, a command-line tool for entering SQL queries. Another popular PostgreSQL front-end is the free and open source graphical tool `pgAdmin <http://www.pgadmin.org/>`_. All queries done in pgAdmin can also be done on the command line with ``psql``. pgAdmin also includes a geometry viewer you can use to spatial view PostGIS queries.
es: PostgreSQL dispone de varios clientes. El fundamental es `psql <http://www.postgresql.org/docs/current/static/app-psql.html>`_, una herramienta de línea de comandos para introducir consultas SQL. Otro popular cliente de PostgreSQL es la herramienta gráfica gratuita y de código abierto `pgAdmin <http://www.pgadmin.org/>`_. Todas las consultas realizadas en pgAdmin también se pueden hacer en la línea de comandos con ``psql``. pgAdmin también incluye un visor de geometría que se puede utilizar para ver espacialmente las consultas PostGIS.
sv: PostgreSQL har ett antal administrativa frontend. Den primära är `psql <http://www.postgresql.org/docs/current/static/app-psql.html>`_, ett kommandoradsverktyg för att ange SQL-frågor. En annan populär PostgreSQL-frontend är det gratis och öppna källkodsgrafiska verktyget `pgAdmin <http://www.pgadmin.org/>`_. Alla frågor som görs i pgAdmin kan också göras på kommandoraden med ``psql``. pgAdmin innehåller också en geometrivisare som du kan använda för att spatialt visa PostGIS-frågor.

source: Find pgAdmin and start it up.
es: Busque pgAdmin e inícielo.
sv: Leta upp pgAdmin och starta den.

source: If this is the first time you have run pgAdmin, you probably don't have any servers configured. Right click the ``Servers`` item in the Browser panel.
es: Si es la primera vez que ejecutas pgAdmin, probablemente no tengas ningún servidor configurado. Haz click derecho en el ítem ``Servidores`` en el panel del Navegador.
sv: Om det här är första gången du kör pgAdmin har du förmodligen inte konfigurerat några servrar. Högerklicka på objektet ``Servrar`` i panelen Browser.

source: We'll name our server **PostGIS**. In the Connection tab, enter the ``Host name/address``. If you're working with a local PostgreSQL install, you'll be able to use ``localhost``. If you're using a cloud service, you should be able to retrieve the host name from your account.
es: Llamaremos a nuestro servidor **PostGIS**. En la pestaña Conexión, introducimos el ``Nombre/dirección del host``. Si estás trabajando con una instalación local de PostgreSQL, podrás utilizar ``localhost``. Si está utilizando un servicio en la nube, usted debería ser capaz de recuperar el nombre de host de su cuenta.
sv: Vi namnger vår server **PostGIS**. På fliken Anslutning anger du `` Värdnamn/adress``. Om du arbetar med en lokal PostgreSQL-installation kan du använda ``localhost``. Om du använder en molntjänst bör du kunna hämta värdnamnet från ditt konto.

source: Leave **Port** set at ``5432``, and both **Maintenance database** and **Username** as ``postgres``. The **Password** should be what you specified with a local install or with your cloud service.
es: Deja **Port** en ``5432``, y tanto **Maintenance database** como **Username** como ``postgres``. La **Contraseña** debe ser la que especificó con una instalación local o con su servicio en la nube.
sv: Låt **Port** vara inställd på ``5432``, och både **Maintenance database** och **Username** vara ``postgres``. Lösenordet **Password** ska vara det som du angav vid en lokal installation eller med din molntjänst.

source: Creating a Database
es: Creando una Base de Datos
sv: Skapa en databas

source: Open the Databases tree item and have a look at the available databases. The ``postgres`` database is the user database for the default postgres user and is not too interesting to us.
es: Abre el item de bases de datos y echa un vistazo a las bases de datos disponibles. La base de datos ``postgres`` es la base de datos de usuario predeterminada para el usuario postgres y no es demasiado interesante para nosotros.
sv: Öppna trädobjektet Databaser och ta en titt på de tillgängliga databaserna. Databasen ``postgres`` är användardatabasen för standardanvändaren av postgres och är inte så intressant för oss.

source: Right-click on the ``Databases`` item and select ``New Database``.
es: Haga clic con el botón derecho del ratón en el elemento ``Bases de datos`` y seleccione ``Nueva base de datos``.
sv: Högerklicka på objektet ``Databaser`` och välj ``Ny databas``.

source: Fill in the ``Create Database`` form as shown below and click **OK**.
es: Rellene el formulario ``Crear base de datos`` como se muestra a continuación y haga clic en **OK**.
sv: Fyll i formuläret ``Create Database`` enligt nedan och klicka på **OK**.

source: **Name**
es: **Nombre**

source: **Owner**
es: **Propietario**

source: Select the new ``nyc`` database and open it up to display the tree of objects. You'll see the ``public`` schema.
es: Selecciona la nueva base de datos ``nyc`` y ábrela para visualizar el árbol de objetos. Verás el esquema ``public``.
sv: Välj den nya databasen ``nyc`` och öppna den för att visa trädet med objekt. Du kommer att se schemat ``public``.

source: Click on the SQL query button indicated below (or go to *Tools > Query Tool*).
es: Haga clic en el botón de consulta SQL indicado a continuación (o vaya a *Herramientas > Herramienta de consulta*).
sv: Klicka på SQL-frågeknappen som visas nedan (eller gå till *Tools > Query Tool*).

source: Enter the following query into the query text field to load the PostGIS spatial extension:
es: Introduzca la siguiente consulta en el campo de texto de consulta para cargar la extensión espacial PostGIS:
sv: Ange följande fråga i textfältet för fråga för att ladda det spatiala tillägget PostGIS:

source: Click the **Play** button in the toolbar (or press **F5**) to "Execute the query."
es: Haz clic en el botón **Play** de la barra de herramientas (o pulsa **F5**) para "Ejecutar la consulta."
sv: Klicka på knappen **Play** i verktygsfältet (eller tryck på **F5**) för att "Execute the query"

source: Now confirm that PostGIS is installed by running a PostGIS function:
es: Ahora confirme que PostGIS está instalado ejecutando una función PostGIS:
sv: Bekräfta nu att PostGIS är installerat genom att köra en PostGIS-funktion:

source: You have successfully created a PostGIS spatial database!!
es: ¡¡Has creado con éxito una base de datos espacial PostGIS!!
sv: Du har lyckats skapa en PostGIS spatial databas!

source: Function List
es: Lista de funciones
sv: Funktionslista

source: `PostGIS_Full_Version <http://postgis.net/docs/PostGIS_Full_Version.html>`_: Reports full PostGIS version and build configuration info.
es: `PostGIS_Full_Version <http://postgis.net/docs/PostGIS_Full_Version.html>`_: Informa de la versión completa de PostGIS y de la configuración de compilación.
sv: `PostGIS_Full_Version <http://postgis.net/docs/PostGIS_Full_Version.html>`_: Rapporterar fullständig information om PostGIS-version och byggkonfiguration.
