Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/de9im.po
Languages: es, sv

source: Dimensionally Extended 9-Intersection Model
es: Modelo de intersección 9 dimensionalmente extendido(DE-9IM)
sv: Dimensionsutvidgad 9-intersektionell modell

source: The "`Dimensionally Extended 9-Intersection Model <http://en.wikipedia.org/wiki/DE-9IM>`_" (DE9IM) is a framework for modelling how two spatial objects interact.
es: El "Dimensionally Extended 9-Intersection Model <http://en.wikipedia.org/wiki/DE-9IM>" (DE9IM) es un marco para modelar cómo interactúan dos objetos espaciales.
sv: "`Dimensionally Extended 9-Intersection Model <http://en.wikipedia.org/wiki/DE-9IM>`_" (DE9IM) är ett ramverk för modellering av hur två spatiala objekt interagerar.

source: First, every spatial object has:
es: Primero, cada objeto espacial tiene:
sv: För det första har varje spatialt objekt:

source: An interior
es: Un interior
sv: En interiör

source: A boundary
es: Un límite
sv: En gräns

source: An exterior
es: Un exterior
sv: En exteriör

source: For polygons, the interior, boundary and exterior are obvious:
es: Para polígonos, el interior, límite y exterior son obvios:
sv: För polygoner är insidan, gränsen och utsidan uppenbara:

source: The interior is the part bounded by the rings; the boundary is the rings themselves; the exterior is everything else in the plane.
es: El interior es la parte delimitada por los anillos; el límite son los anillos mismos; el exterior es todo lo demás en el plano.
sv: Insidan är den del som avgränsas av ringarna, gränsen är själva ringarna och utsidan är allt annat i planet.

source: For linear features, the interior, boundary and exterior are less well-known:
es: Para elementos lineales, el interior, límite y exterior son menos conocidos:
sv: För linjära objekt är interiör, gräns och exteriör mindre välkända:

source: The interior is the part of the line bounded by the ends; the boundary is the ends of the linear feature, and the exterior is everything else in the plane.
es: El interior es la parte de la línea delimitada por los extremos; el límite son los extremos de la línea, y el exterior es todo lo demás en el plano.
sv: Insidan är den del av linjen som avgränsas av ändarna, gränsen är ändarna på den linjära funktionen och utsidan är allt annat i planet.

source: For points, things are even stranger: the interior is the point; the boundary is the empty set and the exterior is everything else in the plane.
es: Para puntos, las cosas son aún más extrañas: el interior es el punto; el límite es el conjunto vacío y el exterior es todo lo demás en el plano.
sv: För punkter är det ännu konstigare: det inre är punkten, gränsen är den tomma mängden och det yttre är allt annat i planet.

source: Using these definitions of interior, exterior and boundary, the relationships between any pair of spatial features can be characterized using the dimensionality of the nine possible intersections between the interiors/boundaries/exteriors of a pair of objects.
es: Usando estas definiciones de interior, exterior y límite, las relaciones entre cualquier par de objetos espaciales pueden caracterizarse usando la dimensionalidad de las nueve posibles intersecciones entre los interiores/límites/exteriores de un par de objetos.
sv: Med hjälp av dessa definitioner av interiör, exteriör och gräns kan relationerna mellan varje par av spatiala egenskaper karakteriseras med hjälp av dimensionaliteten hos de nio möjliga korsningspunkterna mellan interiörerna/gränserna/exteriörerna hos ett par av objekt.

source: For the polygons in the example above, the intersection of the interiors is a 2-dimensional area, so that portion of the matrix is filled out with a "2". The boundaries only intersect at points, which are zero-dimensional, so that portion of the matrix is filled out with a 0.
es: Para los polígonos en el ejemplo anterior, la intersección de los interiores es un área bidimensional, por lo que esa parte de la matriz se completa con un "2". Los límites solo se intersectan en puntos, que son de dimensión cero, por lo que esa parte de la matriz se completa con un 0.
sv: För polygonerna i exemplet ovan är korsningspunkten mellan interiörerna ett 2-dimensionellt område, så den delen av matrisen fylls i med en "2". Gränserna skärs endast i punkter, som är nolldimensionella, så den delen av matrisen fylls i med en 0.

source: When there is no intersection between components, the square the matrix is filled out with an "F".
es: Cuando no hay intersección entre componentes, el cuadro de la matriz se completa con una "F".
sv: När det inte finns någon korsningspunkt mellan komponenterna fylls rutan i matrisen med ett "F".

source: Here's another example, of a linestring partially entering a polygon:
es: Aquí hay otro ejemplo, de una línea que entra parcialmente en un polígono:
sv: Här är ett annat exempel, där en linjestring delvis går in i en polygon:

source: The DE9IM matrix for the interaction is this:
es: La matriz DE9IM para la interacción es esta:
sv: DE9IM-matrisen för interaktionen är denna:

source: Note that the boundaries of the two objects don't actually intersect at all (the end point of the line interacts with the interior of the polygon, not the boundary, and vice versa), so the B/B cell is filled in with an "F".
es: Observa que los límites de los dos objetos en realidad no se intersectan en absoluto (el extremo de la línea interactúa con el interior del polígono, no con el límite, y viceversa), por lo que la celda B/B se completa con una "F".
sv: Observera att gränserna för de två objekten faktiskt inte korsar varandra alls (linjens slutpunkt interagerar med polygonens inre, inte med gränsen, och vice versa), så B/B-cellen fylls i med ett "F".

source: While it's fun to visually fill out DE9IM matrices, it would be nice if a computer could do it, and that's what the :command:`ST_Relate` function is for.
es: Aunque es divertido completar matrices DE9IM visualmente, sería mejor si una computadora pudiera hacerlo, y para eso sirve la función :command:`ST_Relate`.
sv: Även om det är roligt att visuellt fylla i DE9IM-matriser, skulle det vara trevligt om en dator kunde göra det, och det är vad :command:`ST_Relate`-funktionen är till för.

source: The previous example can be simplified using a simple box and line, with the same spatial relationship as our polygon and linestring:
es: El ejemplo anterior puede simplificarse usando una simple caja y línea, con la misma relación espacial que nuestro polígono y línea:
sv: Det föregående exemplet kan förenklas med en enkel ruta och linje, med samma spatiala förhållande som vår polygon och linjestring:

source: And we can generate the DE9IM information in SQL:
es: Y podemos generar la información DE9IM en SQL:
sv: Och vi kan generera DE9IM-informationen i SQL:

source: The answer (1010F0212) is the same as we calculated visually, but returned as a 9-character string, with the first row, second row and third row of the table appended together.
es: La respuesta (1010F0212) es la misma que calculamos visualmente, pero devuelta como una cadena de 9 caracteres, con la primera fila, segunda fila y tercera fila de la tabla concatenadas.
sv: Svaret (1010F0212) är detsamma som vi beräknade visuellt, men returneras som en sträng med 9 tecken, med första raden, andra raden och tredje raden i tabellen sammanfogade.

source: However, the power of DE9IM matrices is not in generating them, but in using them as a matching key to find geometries with very specific relationships to one another.
es: Sin embargo, el poder de las matrices DE9IM no está en generarlas, sino en usarlas como clave de coincidencia para encontrar geometrías con relaciones muy específicas entre sí.
sv: DE9IM-matrisernas styrka ligger dock inte i att generera dem, utan i att använda dem som en matchningsnyckel för att hitta geometrier med mycket specifika relationer till varandra.

source: Suppose we have a data model that includes **Lakes** and **Docks**, and suppose further that Docks must be inside lakes, and must touch the boundary of their containing lake at one end. Can we find all the docks in our database that obey that rule?
es: Supongamos que tenemos un modelo de datos que incluye **Lagos** y **Muelles**, y supongamos además que los muelles deben estar dentro de los lagos, y deben tocar el límite de su lago contenedor en un extremo. ¿Podemos encontrar todos los muelles en nuestra base de datos que obedezcan esa regla?
sv: Anta att vi har en datamodell som innehåller **Sjöar** och **Dockor**, och anta vidare att dockor måste vara inuti sjöar och måste röra gränsen för deras innehållande sjö i ena änden. Kan vi hitta alla bryggor i vår databas som följer denna regel?

source: Our legal docks have the following characteristics:
es: Nuestros muelles legales tienen las siguientes características:
sv: Våra legala bryggor har följande egenskaper:

source: Their interiors have a linear (1D) intersection with the lake interior
es: Sus interiores tienen una intersección lineal (1D) con el interior del lago
sv: Deras interiörer har en linjär (1D) korsningspunkt med sjöns interiör

source: Their boundaries have a point (0D) intersection with the lake interior
es: Sus límites tienen una intersección puntual (0D) con el interior del lago
sv: Deras gränser har en punkt (0D) korsningspunkt med sjöns inre

source: Their boundaries **also** have a point (0D) intersection with the lake boundary
es: Sus límites **también** tienen una intersección puntual (0D) con el límite del lago
sv: Deras gränser har **också** en punkt (0D) som skär sjöns gräns

source: Their interiors have no intersection (F) with the lake exterior
es: Sus interiores no tienen intersección (F) con el exterior del lago
sv: Deras interiörer har ingen korsningspunkt (F) med sjöns exteriör

source: So their DE9IM matrix looks like this:
es: Así que su matriz DE9IM se ve así:
sv: Så deras DE9IM-matris ser ut så här:

source: So to find all the legal docks, we would want to find all the docks that intersect lakes (a super-set of **potential** candidates we use for our join key), and then find all the docks in that set which have the legal relate pattern.
es: Entonces, para encontrar todos los muelles legales, queremos encontrar todos los muelles que intersecten lagos (un superconjunto de **candidatos potenciales** que usamos como clave de unión), y luego encontrar todos los muelles en ese conjunto que tengan el patrón legal de relación.
sv: Så för att hitta alla lagliga bryggor skulle vi vilja hitta alla bryggor som korsar sjöar (en superuppsättning av **potentiella** kandidater som vi använder för vår länknyckel) och sedan hitta alla bryggor i den uppsättningen som har det lagliga relateringsmönstret.

source: Note the use of the three-parameter version of :command:`ST_Relate`, which returns true if the pattern matches or false if it does not. For a fully-defined pattern like this one, the three-parameter version is not needed -- we could have just used a string equality operator.
es: Observa el uso de la versión de tres parámetros de :command:`ST_Relate`, que devuelve verdadero si el patrón coincide o falso si no lo hace. Para un patrón completamente definido como este, la versión de tres parámetros no es necesaria: podríamos haber usado simplemente un operador de igualdad de cadena.
sv: Observera användningen av treparameterversionen av :command:`ST_Relate`, som returnerar true om mönstret matchar eller false om det inte gör det. För ett helt definierat mönster som det här behövs inte versionen med tre parametrar - vi kunde bara ha använt en stränglikhetsoperator.

source: However, for looser pattern searches, the three-parameter allows substitution characters in the pattern string:
es: Sin embargo, para búsquedas de patrones más flexibles, la de tres parámetros permite caracteres de sustitución en la cadena de patrón:
sv: För lösare mönstersökningar tillåter dock de tre parametrarna ersättningstecken i mönstersträngen:

source: "*" means "any value in this cell is acceptable"
es: "*" significa "cualquier valor en esta celda es aceptable"
sv: "*" betyder "alla värden i den här cellen är acceptabla"

source: "T" means "any non-false value (0, 1 or 2) is acceptable"
es: "T" significa "cualquier valor no falso (0, 1 o 2) es aceptable"
sv: "T" betyder "alla icke-falska värden (0, 1 eller 2) är acceptabla"

source: So for example, one possible dock we did not include in our example graphic is a dock with a two-dimensional intersection with the lake boundary:
es: Así que, por ejemplo, un muelle posible que no incluimos en nuestro gráfico de ejemplo es un muelle con una intersección bidimensional con el límite del lago:
sv: En möjlig brygga som vi inte inkluderade i vårt grafiska exempel är en brygga med en tvådimensionell korsningspunkt med sjögränsen:

source: If we are to include this case in our set of "legal" docks, we need to change the relate pattern in our query. In particular, the intersection of the dock interior lake boundary can now be either 1 (our new case) or F (our original case). So we use the "*" catchall in the pattern.
es: Si vamos a incluir este caso en nuestro conjunto de muelles "legales", necesitamos cambiar el patrón de relación en nuestra consulta. En particular, la intersección del interior del muelle con el límite del lago ahora puede ser 1 (nuestro nuevo caso) o F (nuestro caso original). Así que usamos el comodín "*" en el patrón.
sv: Om vi ska inkludera detta fall i vår uppsättning av "lagliga" bryggor måste vi ändra relationsmönstret i vår fråga. I synnerhet kan korsningspunkten mellan bryggans inre sjögräns nu vara antingen 1 (vårt nya fall) eller F (vårt ursprungliga fall). Så vi använder "*" i mönstret.

source: And the SQL looks like this:
es: Y el SQL se ve así:
sv: Och SQL ser ut så här:

source: Confirm that the stricter SQL from the previous example does *not* return the new dock.
es: Confirma que el SQL más estricto del ejemplo anterior *no* devuelve el nuevo muelle.
sv: Bekräfta att den striktare SQL från föregående exempel *inte* returnerar den nya dockan.

source: Data Quality Testing
es: Pruebas de Calidad de Datos
sv: Testning av datakvalitet

source: The TIGER data is carefully quality controlled when it is prepared, so we expect our data to meet strict standards. For example: no census block should overlap any other census block. Can we test for that?
es: Los datos TIGER se controlan cuidadosamente en cuanto a calidad cuando se preparan, por lo que esperamos que nuestros datos cumplan normas estrictas. Por ejemplo: ningún bloque censal debería superponerse con otro bloque censal. ¿Podemos probar eso?
sv: TIGER-data kvalitetskontrolleras noggrant när de tas fram, så vi förväntar oss att våra data uppfyller strikta standarder. Till exempel: inget folkbokföringsblock får överlappa något annat folkbokföringsblock. Kan vi testa för det?

source: Sure!
es: ¡Claro!
sv: Säkert!

source: Similarly, we would expect that the roads data is all end-noded. That is, we expect that intersections only occur at the ends of lines, not at the mid-points.
es: De manera similar, esperaríamos que los datos de carreteras estén todos correctamente nodificados en los extremos. Es decir, esperamos que las intersecciones solo ocurran en los extremos de las líneas, no en los puntos medios.
sv: På samma sätt förväntar vi oss att all vägdata är ändkodad. Det vill säga att vi förväntar oss att korsningar endast sker i ändarna av linjerna, inte i mittpunkterna.

source: We can test for that by looking for streets that intersect (so we have a join) but where the intersection between the boundaries is not zero-dimensional (that is, the end points don't touch):
es: Podemos probar eso buscando calles que se intersecten (de modo que tengamos una unión) pero donde la intersección entre los límites no sea de dimensión cero (es decir, los extremos no se tocan):
sv: Vi kan testa det genom att leta efter gator som korsar varandra (så att vi har en skarv) men där skärningen mellan gränserna inte är nolldimensionell (det vill säga att ändpunkterna inte rör vid varandra):

source: Function List
es: Lista de funciones
sv: Funktionslista

source: `ST_Relate(geometry A, geometry B) <http://postgis.net/docs/ST_Relate.html>`_: Returns a text string representing the DE9IM relationship between the geometries.
es: ST_Relate(geometry A, geometry B) <http://postgis.net/docs/ST_Relate.html>: Devuelve una cadena de texto que representa la relación DE9IM entre las geometrías.
sv: `ST_Relate(geometri A, geometri B) <http://postgis.net/docs/ST_Relate.html>`_: Returnerar en textsträng som representerar DE9IM-relationen mellan geometrierna.
