Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/equality.po
Languages: es, sv, uk, zh_hans

source: Equality
es: Igualdad
sv: Jämlikhet
uk: Рівність
zh_hans: 等同性

source: Determining equality when dealing with geometries can be tricky. PostGIS supports three different functions that can be used to determine different levels of equality, though for clarity we will use the definitions below. To illustrate these functions, we will use the following polygons.
es: Determinar la igualdad cuando se trata de geometrías puede ser complicado. PostGIS soporta tres funciones diferentes que se pueden utilizar para determinar los diferentes niveles de igualdad, aunque para mayor claridad vamos a utilizar las definiciones a continuación. Para ilustrar estas funciones, utilizaremos los siguientes polígonos.
sv: Det kan vara knepigt att bestämma jämlikhet när man hanterar geometrier. PostGIS stöder tre olika funktioner som kan användas för att bestämma olika nivåer av jämlikhet, men för tydlighetens skull använder vi definitionerna nedan. För att illustrera dessa funktioner kommer vi att använda följande polygoner.
uk: Визначення рівності при роботі з геометрією може бути складним завданням. PostGIS підтримує три різні функції, які можна використовувати для визначення різних рівнів рівності, хоча для більшої зрозумілості ми будемо використовувати наведені нижче визначення. Для ілюстрації цих функцій ми будемо використовувати наступні полігони.
zh_hans: 在空间数据处理中，几何对象的等同性判断可能较为复杂。PostGIS 提供三种不同的函数来实现不同级别的等同性判断，为明确起见，我们采用以下定义。以下面这组多边形为例进行说明。

source: These polygons are loaded using the following commands.
es: Estos polígonos se cargan utilizando los siguientes comandos.
sv: Dessa polygoner laddas med hjälp av följande kommandon.
uk: Ці багатокутники завантажуються за допомогою наступних команд.
zh_hans: 以下命令用于加载这些多边形数据。

source: Exactly Equal
es: Exactamente igual
sv: Exakt lika
uk: Абсолютно однакові
zh_hans: 完全相等

source: Exact equality is determined by comparing two geometries, vertex by vertex, in order, to ensure they are identical in position. The following examples show how this method can be limited in its effectiveness.
es: La igualdad exacta se determina comparando dos geometrías, vértice por vértice, en orden, para asegurarse de que son idénticas en posición. Los siguientes ejemplos muestran cómo este método puede tener una eficacia limitada.
sv: Exakt likhet bestäms genom att jämföra två geometrier, toppunkt för toppunkt, i ordning för att säkerställa att de är identiska i position. Följande exempel visar hur denna metod kan vara begränsad i sin effektivitet.
uk: Абсолютна однаковість визначається шляхом порівняння двох геометрій, вершина за вершиною, послідовно, щоб переконатися, що вони ідентичні за положенням. Наступні приклади показують, як ефективність цього методу може бути обмеженою.
zh_hans: 精确相等性通过逐顶点顺序比对两个几何图形的位置是否完全一致来确定。以下示例展示了该方法的局限性。

source: In this example, the polygons are only equal to themselves, not to other seemingly equivalent polygons (as in the case of Polygons 1 through 3). In the case of Polygons 1, 2, and 3, the vertices are in identical positions but are defined in differing orders. Polygon 4 has colinear (and thus redundant) vertices on the hexagon edges causing inequality with Polygon 1.
es: En este ejemplo, los polígonos sólo son iguales a sí mismos, no a otros polígonos aparentemente equivalentes (como en el caso de los polígonos 1 a 3). En el caso de los polígonos 1, 2 y 3, los vértices se encuentran en posiciones idénticas, pero están definidos en órdenes diferentes. El polígono 4 tiene vértices colineales (y, por tanto, redundantes) en los bordes del hexágono, lo que provoca una desigualdad con el polígono 1.
sv: I det här exemplet är polygonerna bara lika med sig själva, inte med andra till synes likvärdiga polygoner (som i fallet med polygonerna 1 till 3). I fallet med polygonerna 1, 2 och 3 är hörnen identiskt placerade men definierade i olika ordning. Polygon 4 har kolinjära (och därmed överflödiga) hörn på hexagonkanterna, vilket orsakar ojämlikhet med polygon 1.
uk: У цьому прикладі багатокутники рівні тільки самі собі, а не іншим, на перший погляд, еквівалентним багатокутникам (як у випадку багатокутників 1–3). У випадку багатокутників 1, 2 і 3 вершини знаходяться в однакових положеннях, але визначені в різному порядку. Багатокутник 4 має колінеарні (а отже, надлишкові) вершини на ребрах шестикутника, що спричиняє нерівність з багатокутником 1.
zh_hans: 在示例中，这些多边形仅与自身相等，而不会与其他看似相同的多边形相等（例如多边形 1 到 3 的情况）。对于多边形 1、2 和 3，它们的顶点位置相同，但定义顺序不同。而多边形 4 在六边形的边上包含共线（因此是多余的）顶点，导致它与多边形 1 不相等。

source: Spatially Equal
es: Espacialmente igual
sv: Spatialt lika
uk: Просторово однакові
zh_hans: 空间相等

source: As we saw above, exact equality does not take into account the spatial nature of the geometries. There is an function, aptly named :command:`ST_Equals`, available to test the spatial equality or equivalence of geometries.
es: Como hemos visto anteriormente, la igualdad exacta no tiene en cuenta la naturaleza espacial de las geometrías. Existe una función, acertadamente denominada :command:`ST_Equals`, disponible para comprobar la igualdad o equivalencia espacial de las geometrías.
sv: Som vi såg ovan tar exakt likhet inte hänsyn till geometriernas spatiala karaktär. Det finns en funktion, med det passande namnet :command:`ST_Equals`, för att testa geometriers spatiala jämlikhet eller ekvivalens.
uk: Як ми бачили вище, абсолютна однаковість не враховує просторову природу геометрій. Існує функція, яка має відповідну назву :command:`ST_Equals`, яка дозволяє перевірити просторову однаковість або еквівалентність геометрій.
zh_hans: 如前述所示，精确相等性检测并未考虑几何图形的空间特性。为此，系统专门提供:command:`ST_Equals`函数，用于检测几何图形间的空间相等性或等价关系。

source: These results are more in line with our intuitive understanding of equality. Polygons 1 through 4 are considered equal, since they enclose the same area. Note that neither the direction of the polygon is drawn, the starting point for defining the polygon, nor the number of points used are important here. What is important is that the polygons contain the same space.
es: Estos resultados son más acordes con nuestra comprensión intuitiva de la igualdad. Los polígonos 1 a 4 se consideran iguales, ya que encierran la misma área. Observe que ni la dirección en la que se dibuja el polígono, ni el punto de partida para definir el polígono, ni el número de puntos utilizados son importantes aquí. Lo importante es que los polígonos contengan el mismo espacio.
sv: Dessa resultat är mer i linje med vår intuitiva förståelse av jämlikhet. Polygonerna 1 till 4 anses vara lika, eftersom de omsluter samma område. Observera att varken polygonens riktning, startpunkten för polygonens definition eller antalet punkter som används är viktiga här. Det viktiga är att polygonerna innehåller samma utrymme.
uk: Ці результати більше відповідають нашому інтуїтивному розумінню рівності. Полігони від 1 до 4 вважаються однаковими, оскільки вони охоплюють однакову площу. Зверніть увагу, що тут не має значення ні напрямок полігону, ні початкова точка для визначення полігону, ні кількість використаних точок. Важливо те, що полігони містять однаковий простір.
zh_hans: 这一结果更符合我们对"相等性"的直观理解——多边形1至4因其包围的区域完全相同而被判定为相等。需特别注意：多边形的绘制方向、定义起点或顶点数量均不影响判定，关键在于多边形是否占据相同的空间范围。

source: Equal Bounds
es: Límites iguales
sv: Jämna gränser
uk: Рівні межі
zh_hans: 边界相等

source: Exact equality requires, in the worst case, comparison of each and every vertex in the geometry to determine equality. This can be slow, and may not be appropriate for comparing huge numbers of geometries. To allow for speedier comparison, the equal bounds operator, :command:`~=`, is provided. This operates only on the bounding box (rectangle), ensuring that the geometries occupy the same two dimensional extent, but not necessarily the same space.
es: La igualdad exacta requiere, en el peor de los casos, la comparación de todos y cada uno de los vértices de la geometría para determinar la igualdad. Esto puede ser lento, y puede no ser apropiado para comparar un gran número de geometrías. Para permitir una comparación más rápida, se proporciona el operador de límites iguales, :comando:`~=`. Este operador sólo opera en el rectángulo, garantizando que las geometrías ocupan la misma extensión bidimensional, pero no necesariamente el mismo espacio.
sv: Exakt likhet kräver, i värsta fall, jämförelse av varje enskilt vertex i geometrin för att fastställa likhet. Detta kan ta lång tid och är kanske inte lämpligt för att jämföra ett stort antal geometrier. För att möjliggöra snabbare jämförelser finns operatorn equal bounds, :command:`~=`. Denna operator verkar endast på den avgränsande rutan (rektangeln) och säkerställer att geometrierna har samma tvådimensionella utsträckning, men inte nödvändigtvis samma utrymme.
uk: Абсолютна однаковість вимагає, в найгіршому випадку, порівняння кожної вершини в геометрії для визначення рівності. Це може бути повільним і може бути непридатним для порівняння великої кількості геометрій. Для більш швидкого порівняння передбачений оператор рівних меж :command:`~=`. Він працює тільки з обмежувальним прямокутником (прямокутником), гарантуючи, що геометрії займають однакову двовимірну площу, але не обов'язково однаковий простір.
zh_hans: 精确相等性检测在最坏情况下需要逐顶点比对几何图形的所有坐标点，这种计算可能较慢，尤其不适用于海量几何数据的比对。为提升比对效率，系统提供了边界相等运算符 :command:`~=`，该运算符仅对比几何图形的外包矩形（边界框），确保几何体占据相同的二维空间范围，但不保证实际空间位置完全一致。

source: As you can see, all of our spatially equal geometries also have equal bounds. Unfortunately, Polygon 5 is also returned as equal under this test, because it shares the same bounding box as the other geometries. Why is this useful, then? Although this will be covered in detail later, the short answer is that this enables the use of spatial indexing that can quickly reduce huge comparison sets into more manageable blocks when joining or filtering data.
es: Como puede ver, todas nuestras geometrías espacialmente iguales también tienen límites iguales. Desafortunadamente, el Polígono 5 también se devuelve como igual bajo esta prueba, porque comparte la misma caja delimitadora que las otras geometrías. ¿Por qué es útil? Aunque esto se tratará en detalle más adelante, la respuesta corta es que esto permite el uso de indexación espacial que puede reducir rápidamente enormes conjuntos de comparación en bloques más manejables al unir o filtrar datos.
sv: Som du kan se har alla våra spatialt lika geometrier också lika gränser. Tyvärr returneras Polygon 5 också som lika i det här testet, eftersom den delar samma bounding box som de andra geometrierna. Varför är då detta användbart? Även om detta kommer att behandlas i detalj senare är det korta svaret att detta möjliggör användning av spatial indexering som snabbt kan reducera enorma jämförelseuppsättningar till mer hanterbara block när data sammanfogas eller filtreras.
uk: Як бачите, всі наші просторово рівні геометрії також мають рівні межі. На жаль, багатокутник 5 також повертається як рівний за результатами цього тесту, оскільки він має ту саму обмежувальну коробку, що й інші геометрії. Чому це корисно? Хоча це буде детально розглянуто пізніше, коротка відповідь полягає в тому, що це дозволяє використовувати просторове індексування, яке може швидко зменшити величезні набори порівнянь до більш керованих блоків під час об'єднання або фільтрування даних.
zh_hans: 如图所示，所有空间相等的几何图形必然具有相等的边界框。但值得注意的是，多边形5在此测试中也会被判定为相等——因其边界框与其他图形重合。这种机制的实用价值在于：虽然后续将详细阐述，但简而言之，它能利用空间索引在数据连接或过滤时，将海量比对集快速缩减至更易处理的区块规模。
