Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/geography.po
Languages: es, sv

source: Geography
es: Geografía
sv: Geografi

source: It is very common to have data in which the coordinate are "geographics" or "latitude/longitude".
es: Es muy común tener datos en los que las coordenadas son “geográficas” o “latitud/longitud”.
sv: Det är mycket vanligt med data där koordinaterna är "geographics" eller "latitude/longitude".

source: Unlike coordinates in Mercator, UTM, or Stateplane, geographic coordinates are **not Cartesian coordinates**. Geographic coordinates do not represent a linear distance from an origin as plotted on a plane. Rather, these **spherical coordinates** describe angular coordinates on a globe. In spherical coordinates a point is specified by the angle of rotation from a reference meridian (longitude), and the angle from the equator (latitude).
es: A diferencia de las coordenadas en Mercator, UTM o Stateplane, las coordenadas geográficas no son coordenadas cartesianas. Las coordenadas geográficas no representan una distancia lineal desde un origen trazado en un plano. Más bien, estas coordenadas esféricas describen coordenadas angulares sobre un globo. En coordenadas esféricas un punto se especifica por el ángulo de rotación desde un meridiano de referencia (longitud), y el ángulo desde el ecuador (latitud).
sv: Till skillnad från koordinater i Mercator, UTM eller Stateplane är geografiska koordinater **inte kartesiska koordinater**. Geografiska koordinater representerar inte ett linjärt avstånd från ett ursprung som plottas på ett plan. Snarare beskriver dessa **sfäriska koordinater** vinkelkoordinater på en jordglob. I sfäriska koordinater specificeras en punkt av rotationsvinkeln från en referensmeridian (longitud) och vinkeln från ekvatorn (latitud).

source: You can treat geographic coordinates as approximate Cartesian coordinates and continue to do spatial calculations. However, measurements of distance, length and area will be **nonsensical**. Since spherical coordinates measure **angular** distance, the units are in "degrees." Further, the approximate results from indexes and true/false tests like intersects and contains can become terribly wrong. The distance between points get larger as problem areas like the poles or the international dateline are approached.
es: Puedes tratar las coordenadas geográficas como coordenadas cartesianas aproximadas y continuar realizando cálculos espaciales. Sin embargo, las mediciones de distancia, longitud y área serán sin sentido. Dado que las coordenadas esféricas miden distancia angular, las unidades están en “grados”. Además, los resultados aproximados de índices y pruebas verdadero/falso como intersects y contains pueden resultar completamente erróneos. La distancia entre puntos se vuelve más grande a medida que se aproximan a zonas problemáticas como los polos o la línea internacional de cambio de fecha.
sv: Du kan behandla geografiska koordinater som ungefärliga kartesiska koordinater och fortsätta att göra spatiala beräkningar. Mätningar av avstånd, längd och area kommer dock att vara **nonsensiska**. Eftersom sfäriska koordinater mäter **vinkel** avstånd, är enheterna i "grader" Dessutom kan de ungefärliga resultaten från index och sant/falskt-test som skär och innehåller bli väldigt fel. Avståndet mellan punkterna blir större när man närmar sig problemområden som polerna eller den internationella datalinjen.

source: For example, here are the coordinates of Los Angeles and Paris.
es: Por ejemplo, aquí están las coordenadas de Los Ángeles y París.
sv: Här är till exempel koordinaterna för Los Angeles och Paris.

source: Los Angeles: ``POINT(-118.4079 33.9434)``
es: Los Ángeles: POINT(-118.4079 33.9434)

source: Paris: ``POINT(2.3490 48.8533)``
es: París: POINT(2.3490 48.8533)

source: The following calculates the distance between Los Angeles and Paris using the standard PostGIS Cartesian :command:`ST_Distance(geometry, geometry)`. Note that the SRID of 4326 declares a geographic spatial reference system.
es: El siguiente cálculo mide la distancia entre Los Ángeles y París usando la función cartesiana estándar de PostGIS :command:`ST_Distance(geometry, geometry)`. Obsérvese que el SRID 4326 declara un sistema de referencia espacial geográfico.
sv: Följande beräknar avståndet mellan Los Angeles och Paris med hjälp av PostGIS kartesiska standardkommando: `ST_Distance(geometry, geometry)`. Observera att SRID:en 4326 deklarerar ett geografiskt spatialt referenssystem.

source: Aha! 122! But, what does that mean?
es: ¡Ajá! 122. Pero, ¿qué significa eso?
sv: Aha! 122! Men, vad betyder det?

source: The units for spatial reference 4326 are degrees. So our answer is 122 degrees. But (again), what does that mean?
es: Las unidades para el sistema de referencia espacial 4326 son grados. Así que nuestra respuesta es 122 grados. Pero (otra vez), ¿qué significa eso?
sv: Enheterna för spatial referens 4326 är grader. Så vårt svar är 122 grader. Men (återigen), vad betyder det?

source: On a sphere, the size of one "degree square" is quite variable, becoming smaller as you move away from the equator. Think of the meridians (vertical lines) on the globe getting closer to each other as you go towards the poles. So, a distance of 122 degrees doesn't *mean* anything. It is a nonsense number.
es: En una esfera, el tamaño de un “cuadrado de un grado” es muy variable, volviéndose más pequeño a medida que uno se aleja del ecuador. Piensa en los meridianos (líneas verticales) del globo acercándose entre sí al ir hacia los polos. Así que, una distancia de 122 grados no significa nada. Es un número sin sentido.
sv: På en sfär är storleken på en "gradkvadrat" ganska varierande och blir mindre ju längre bort från ekvatorn man kommer. Tänk på att meridianerna (de vertikala linjerna) på jordklotet kommer närmare varandra när du rör dig mot polerna. Så ett avstånd på 122 grader *betyder* ingenting. Det är ett nonsensnummer.

source: In order to calculate a meaningful distance, we must treat geographic coordinates not as approximate Cartesian coordinates but rather as true spherical coordinates. We must measure the distances between points as true paths over a sphere -- a portion of a great circle.
es: Para calcular una distancia significativa, debemos tratar las coordenadas geográficas no como coordenadas cartesianas aproximadas sino como verdaderas coordenadas esféricas. Debemos medir las distancias entre puntos como trayectorias reales sobre una esfera —una porción de un círculo máximo.
sv: För att kunna beräkna ett meningsfullt avstånd måste vi behandla geografiska koordinater inte som ungefärliga kartesiska koordinater utan snarare som verkliga sfäriska koordinater. Vi måste mäta avstånden mellan punkterna som verkliga banor över en sfär - en del av en storcirkel.

source: PostGIS provides this functionality through the ``geography`` type.
es: PostGIS proporciona esta funcionalidad a través del tipo geography.
sv: PostGIS tillhandahåller denna funktionalitet genom typen ``geografi``.

source: Different spatial databases have different approaches for "handling geographics"
es: Diferentes bases de datos espaciales tienen distintos enfoques para “manejar coordenadas geográficas”
sv: Olika spatiala databaser har olika metoder för att "hantera geografi"

source: Oracle attempts to paper over the differences by transparently doing geographic calculations when the SRID is geographic.
es: Oracle intenta disimular las diferencias haciendo cálculos geográficos de manera transparente cuando el SRID es geográfico.
sv: Oracle försöker dölja skillnaderna genom att på ett transparent sätt göra geografiska beräkningar när SRID:en är geografisk.

source: SQL Server uses two spatial types, "STGeometry" for Cartesian data and "STGeography" for geographics.
es: SQL Server usa dos tipos espaciales: “STGeometry” para datos cartesianos y “STGeography” para geográficos.
sv: SQL Server använder två spatiala typer, "STGeometry" för kartesiska data och "STGeography" för geografiska data.

source: Informix Spatial is a pure Cartesian extension to Informix, while Informix Geodetic is a pure geographic extension.
es: Informix Spatial es una extensión puramente cartesiana de Informix, mientras que Informix Geodetic es una extensión puramente geográfica.
sv: Informix Spatial är ett rent kartesiskt tillägg till Informix, medan Informix Geodetic är ett rent geografiskt tillägg.

source: Similar to SQL Server, PostGIS uses two types, "geometry" and "geography".
es: De forma similar a SQL Server, PostGIS usa dos tipos: “geometry” y “geography”.
sv: I likhet med SQL Server använder PostGIS två typer, "geometry" och "geography".

source: Using the ``geography`` instead of ``geometry`` type, let's try again to measure the distance between Los Angeles and Paris.
es: Usando el tipo geography en lugar de geometry, probemos de nuevo medir la distancia entre Los Ángeles y París.
sv: Med hjälp av typen ``geografi`` istället för ``geometri``, låt oss försöka igen att mäta avståndet mellan Los Angeles och Paris.

source: A big number! All return values from ``geography`` calculations are in **meters**, so our answer is 9125km.
es: ¡Un número grande! Todos los valores devueltos por cálculos con geography están en metros, así que nuestra respuesta es 9125 km.
sv: Ett stort tal! Alla returvärden från ``geografi``-beräkningar är i **meter**, så vårt svar är 9125km.

source: Older versions of PostGIS supported very basic calculations over the sphere using the :command:`ST_Distance_Spheroid(point, point, measurement)` function. However, :command:`ST_Distance_Spheroid` is substantially limited. The function only works on points and provides no support for indexing across the poles or international dateline.
es: Las versiones antiguas de PostGIS soportaban cálculos muy básicos sobre la esfera mediante la función :command:`ST_Distance_Spheroid(point, point, measurement)`. Sin embargo, :command:`ST_Distance_Spheroid` es bastante limitada. La función solo funciona con puntos y no proporciona soporte para indexación a través de los polos o la línea internacional de cambio de fecha.
sv: Äldre versioner av PostGIS stödde mycket grundläggande beräkningar över sfären med hjälp av funktionen :command:`ST_Distance_Spheroid(point, point, measurement)`. Men :command:`ST_Distance_Spheroid` är väsentligt begränsad. Funktionen fungerar bara på punkter och ger inget stöd för indexering över polerna eller den internationella datalinjen.

source: The need to support non-point geometries becomes very clear when posing a question like "How close will a flight from Los Angeles to Paris come to Iceland?"
es: La necesidad de soportar geometrías que no son puntos se hace muy clara al plantear una pregunta como: “¿Qué tan cerca pasará un vuelo de Los Ángeles a París de Islandia?”
sv: Behovet av att stödja icke-punktgeometrier blir mycket tydligt när man ställer en fråga som "Hur nära kommer ett flyg från Los Angeles till Paris att komma Island?"

source: Working with geographic coordinates on a Cartesian plane (the purple line) yields a *very* wrong answer indeed! Using great circle routes (the red lines) gives the right answer. If we convert our LAX-CDG flight into a line string and calculate the distance to a point in Iceland using ``geography`` we'll get the right answer (recall) in meters.
es: Trabajar con coordenadas geográficas en un plano cartesiano (la línea púrpura) da una respuesta muy errónea. Usar rutas de círculo máximo (las líneas rojas) da la respuesta correcta. Si convertimos nuestro vuelo LAX-CDG en una line string y calculamos la distancia a un punto en Islandia usando geography, obtendremos la respuesta correcta (en metros).
sv: Att arbeta med geografiska koordinater på ett kartesiskt plan (den lila linjen) ger ett *mycket* felaktigt svar! Att använda storcirkelrutter (de röda linjerna) ger rätt svar. Om vi konverterar vår flygning LAX-CDG till en linjestring och beräknar avståndet till en punkt på Island med hjälp av ``geografi`` får vi rätt svar (recall) i meter.

source: So the closest approach to Iceland (as measured from its international airport) on the LAX-CDG route is a relatively small 502km.
es: Así, la aproximación más cercana a Islandia (medida desde su aeropuerto internacional) en la ruta LAX-CDG es relativamente pequeña: 502 km.
sv: Så den närmaste inflygningen till Island (mätt från dess internationella flygplats) på LAX-CDG-rutten är relativt små 502 km.

source: The Cartesian approach to handling geographic coordinates breaks down entirely for features that cross the international dateline. The shortest great-circle route from Los Angeles to Tokyo crosses the Pacific Ocean. The shortest Cartesian route crosses the Atlantic and Indian Oceans.
es: El enfoque cartesiano para manejar coordenadas geográficas se rompe completamente en el caso de entidades que cruzan la línea internacional de cambio de fecha. La ruta de círculo máximo más corta de Los Ángeles a Tokio cruza el Océano Pacífico. La ruta cartesiana más corta cruza el Atlántico y el Índico.
sv: Den kartesiska metoden för att hantera geografiska koordinater bryts ned helt för objekt som korsar den internationella datalinjen. Den kortaste storcirkelrutten från Los Angeles till Tokyo korsar Stilla havet. Den kortaste kartesiska rutten korsar Atlanten och Indiska oceanen.

source: Using Geography
es: Usando Geography
sv: Använda geografi

source: In order to load geometry data into a geography table, the geometry first needs to be projected into EPSG:4326 (longitude/latitude), then it needs to be changed into geography. The :command:`ST_Transform(geometry,srid)` function converts coordinates to geographics and the :command:`Geography(geometry)` function or the ``::geography`` suffix "casts" to geography.
es: Para cargar datos de geometría en una tabla de tipo geography, primero la geometría debe proyectarse a EPSG:4326 (longitud/latitud), y luego debe convertirse a geography. La función :command:ST_Transform(geometry,srid) convierte coordenadas a geográficas y la función :command:Geography(geometry) o el sufijo ::geography realiza el casting a geography.
sv: För att läsa in geometridata i en geograftabell måste geometrin först projiceras till EPSG:4326 (longitud/latitud), sedan måste den ändras till geografi. Funktionen :command:`ST_Transform(geometry,srid)` konverterar koordinater till geografi och funktionen :command:`Geography(geometry)` eller suffixet ``::geography`` "casts" till geografi.

source: Building a spatial index on a geography table is exactly the same as for geometry:
es: Construir un índice espacial en una tabla geography es exactamente igual que en una tabla geometry:
sv: Att bygga ett spatialt index på en geograftabell är exakt samma sak som för geometri:

source: The difference is under the covers: the geography index will correctly handle queries that cover the poles or the international date-line, while the geometry one will not.
es: La diferencia está en el funcionamiento interno: el índice geography manejará correctamente consultas que crucen los polos o la línea internacional de cambio de fecha, mientras que el de geometry no lo hará.
sv: Skillnaden finns under täckmanteln: geografiindexet kommer att hantera frågor som täcker polerna eller den internationella datumlinjen korrekt, medan geometriindexet inte gör det.

source: Here's a query to find all the subway stations within 500 meters of the Empire State Building.
es: Aquí hay una consulta para encontrar todas las estaciones de metro dentro de 500 metros del Empire State Building.
sv: Här är en fråga för att hitta alla tunnelbanestationer inom 500 meter från Empire State Building.

source: There are only a small number of native functions for the geography type:
es: Existen solo unas pocas funciones nativas para el tipo geography:
sv: Det finns bara ett litet antal inbyggda funktioner för geografin:

source: :command:`ST_AsText(geography)` returns ``text``
es: :command:`ST_AsText(geography)` devuelve ``text``
sv: :command:`ST_AsText(geografi)` returnerar ``text``

source: :command:`ST_GeographyFromText(text)` returns ``geography``
es: :command:`ST_GeographyFromText(text)` devuelve ``geography``
sv: :command:`ST_GeographyFromText(text)` returnerar ``geografi``

source: :command:`ST_AsBinary(geography)` returns ``bytea``
es: :command:`ST_AsBinary(geography)` devuelve ``bytea``
sv: :command:`ST_AsBinary(geography)` returnerar ``bytea``

source: :command:`ST_GeogFromWKB(bytea)` returns ``geography``
es: :command:`ST_GeogFromWKB(bytea)` devuelve ``geography``
sv: :command:`ST_GeogFromWKB(bytea)` returnerar ``geografi``

source: :command:`ST_AsSVG(geography)` returns ``text``
es: :command:`ST_AsSVG(geography)` devuelve ``text``
sv: :command:`ST_AsSVG(geografi)` returnerar ``text``

source: :command:`ST_AsGML(geography)` returns ``text``
es: :command:`ST_AsGML(geography)` devuelve ``text``
sv: :command:`ST_AsGML(geography)` returnerar ``text``

source: :command:`ST_AsKML(geography)` returns ``text``
es: :command:`ST_AsKML(geography)` devuelve ``text``
sv: :command:`ST_AsKML(geography)` returnerar ``text``

source: :command:`ST_AsGeoJson(geography)` returns ``text``
es: :command:`ST_AsGeoJson(geography)` devuelve ``text``
sv: :command:`ST_AsGeoJson(geography)` returnerar ``text``

source: :command:`ST_Distance(geography, geography)` returns ``double``
es: :command:`ST_Distance(geography, geography)` devuelve ``double``
sv: :command:`ST_Distance(geography, geography)` returnerar ``double``

source: :command:`ST_DWithin(geography, geography, float8)` returns ``boolean``
es: :command:`ST_DWithin(geography, geography, float8)` devuelve ``boolean``
sv: :command:`ST_DWithin(geography, geography, float8)` returnerar ``boolean``

source: :command:`ST_Area(geography)` returns ``double``
es: :command:`ST_Area(geography)` devuelve ``double``
sv: :command:`ST_Area(geography)` returnerar ``double``

source: :command:`ST_Length(geography)` returns ``double``
es: :command:`ST_Length(geography)` devuelve ``double``
sv: :command:`ST_Length(geography)` returnerar ``double``

source: :command:`ST_Covers(geography, geography)` returns ``boolean``
es: :command:`ST_Covers(geography, geography)` devuelve ``boolean``
sv: :command:`ST_Covers(geography, geography)` returnerar ``boolean``

source: :command:`ST_CoveredBy(geography, geography)` returns ``boolean``
es: :command:`ST_CoveredBy(geography, geography)` devuelve ``boolean``
sv: :command:`ST_CoveredBy(geography, geography)` returnerar ``boolean``

source: :command:`ST_Intersects(geography, geography)` returns ``boolean``
es: :command:`ST_Intersects(geography, geography)` devuelve ``boolean``
sv: :command:`ST_Intersects(geography, geography)` returnerar ``boolean``

source: :command:`ST_Buffer(geography, float8)` returns ``geography`` [#Casting_note]_
es: :command:`ST_Buffer(geography, float8)` devuelve ``geography`` [#Casting_note]_
sv: :command:`ST_Buffer(geography, float8)` returnerar ``geography`` [#Casting_note]_

source: :command:`ST_Intersection(geography, geography)` returns ``geography`` [#Casting_note]_
es: :command:`ST_Intersection(geography, geography)` devuelve ``geography`` [#Casting_note]_
sv: :command:`ST_Intersection(geography, geography)` returnerar ``geography`` [#Casting_note]_

source: Creating a Geography Table
es: Crear una tabla Geography
sv: Skapa en geografitabell

source: The SQL for creating a new table with a geography column is much like that for creating a geometry table. However, geography includes the ability to specify the object type directly at the time of table creation. For example:
es: El SQL para crear una nueva tabla con una columna geography es muy similar al de geometry. Sin embargo, geography permite especificar el tipo de objeto directamente en la creación de la tabla. Por ejemplo:
sv: SQL för att skapa en ny tabell med en geografikolumn är ungefär som för att skapa en geometritabell. Geografi inkluderar dock möjligheten att ange objekttypen direkt vid skapandet av tabellen. Till exempel

source: In the table definition, the ``GEOGRAPHY(Point)`` specifies our airport data type as points. The new geography fields don't get registered in the ``geometry_columns`` view. Instead, they are registered in a view called ``geography_columns``.
es: En la definición de la tabla, GEOGRAPHY(Point) especifica nuestro tipo de datos de aeropuertos como puntos. Los nuevos campos geography no se registran en la vista geometry_columns, sino en la vista geography_columns.
sv: I tabelldefinitionen specificerar ``GEOGRAPHY(Point)`` vår flygplatsdatatyp som punkter. De nya geografiska fälten registreras inte i vyn ``geometry_columns``. Istället registreras de i en vy som heter ``geography_columns``.

source: Some columns were omitted from the above output.
es: Algunas columnas fueron omitidas en la salida de arriba.
sv: Vissa kolumner har utelämnats från ovanstående utdata.

source: Casting to Geometry
es: Convertir a tipo Geometry
sv: Casting till geometri

source: While the basic functions for geography types can handle many use cases, there are times when you might need access to other functions only supported by the geometry type. Fortunately, you can convert objects back and forth from geography to geometry.
es: Aunque las funciones básicas para geography cubren muchos casos de uso, en ocasiones se necesitan funciones que solo soporta geometry. Afortunadamente, se pueden convertir objetos de geography a geometry y viceversa.
sv: Även om de grundläggande funktionerna för geograftyper kan hantera många användningsfall, finns det tillfällen då du kan behöva tillgång till andra funktioner som endast stöds av geometritypen. Lyckligtvis kan du konvertera objekt fram och tillbaka från geografi till geometri.

source: The PostgreSQL syntax convention for casting is to append ``::typename`` to the end of the value you wish to cast. So, ``2::text`` will convert a numeric two to a text string '2'. And ``'POINT(0 0)'::geometry`` will convert the text representation of point into a geometry point.
es: La convención de PostgreSQL para casting es añadir ``::typename`` al final del valor. Por ejemplo: `2::text` convierte el número dos en una cadena de texto '2'. Y ``'POINT(0 0)'::geometry`` convierte la representación en texto de un punto a una geometría de tipo punto.
sv: PostgreSQL-syntaxkonventionen för casting är att lägga till ``::typename`` i slutet av det värde du vill casta. Så, ``2::text`` kommer att konvertera en numerisk två till en textsträng '2'. Och ``'POINT(0 0)'::geometry`` kommer att konvertera textrepresentationen av point till en geometripunkt.

source: The :command:`ST_X(point)` function only supports the geometry type. How can we read the X coordinate from our geographies?
es: La función :command:ST_X(point) solo admite el tipo geometry. ¿Cómo leer la coordenada X de nuestras geographies?
sv: Funktionen :command:`ST_X(point)` stöder endast geometritypen. Hur kan vi läsa X-koordinaten från våra geografier?

source: By appending ``::geometry`` to our geography value, we convert the object to a geometry with an SRID of 4326. From there we can use as many geometry functions as strike our fancy. But, remember -- now that our object is a geometry, the coordinates will be interpreted as Cartesian coordinates, not spherical ones.
es: Adjuntando ::geometry a nuestro valor geography lo convertimos a geometry con SRID 4326. Desde ahí podemos usar todas las funciones de geometry que queramos. Pero hay que recordar que, una vez convertido a geometry, las coordenadas se interpretan como cartesianas, no esféricas.

source: Why (Not) Use Geography
es: Por qué (no) usar Geography
sv: Varför (inte) använda geografi
