Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/geography.po
Languages: es, sv

source: Geographics are universally accepted coordinates -- everyone understands what latitude/longitude mean, but very few people understand what UTM coordinates mean. Why not use geography all the time?
es: Las coordenadas geográficas son universalmente aceptadas: todos entienden qué significan latitud y longitud, pero muy pocos entienden lo que significan coordenadas UTM. ¿Por qué no usar siempre geography?
sv: Geografiska koordinater är allmänt accepterade koordinater - alla förstår vad latitud/longitud betyder, men väldigt få förstår vad UTM-koordinater betyder. Varför inte använda geografi hela tiden?

source: First, as noted earlier, there are far fewer functions available (right now) that directly support the geography type. You may spend a lot of time working around geography type limitations.
es: Primero, como se señaló antes, hay muchas menos funciones disponibles directamente para geography. Podrías pasar mucho tiempo buscando soluciones a sus limitaciones.
sv: För det första finns det, som tidigare nämnts, mycket färre funktioner tillgängliga (just nu) som direkt stöder geograftypen. Du kan få ägna mycket tid åt att arbeta runt begränsningar för geograftyper.

source: Second, the calculations on a sphere are computationally far more expensive than Cartesian calculations. For example, the Cartesian formula for distance (Pythagoras) involves one call to sqrt(). The spherical formula for distance (Haversine) involves two sqrt() calls, an arctan() call, four sin() calls and two cos() calls. Trigonometric functions are very costly, and spherical calculations involve a lot of them.
es: Segundo, los cálculos en una esfera son mucho más costosos computacionalmente que los cálculos cartesianos. La fórmula cartesiana de distancia (Pitágoras) requiere una llamada a sqrt(). La fórmula esférica (Haversine) requiere dos sqrt(), una arctan(), cuatro sin() y dos cos(). Las funciones trigonométricas son costosas, y los cálculos esféricos involucran muchas de ellas.
sv: För det andra är beräkningarna på en sfär beräkningsmässigt mycket dyrare än kartesiska beräkningar. Till exempel innebär den kartesiska formeln för avstånd (Pythagoras) ett anrop till sqrt(). Den sfäriska formeln för avstånd (Haversine) innebär två sqrt()-anrop, ett arctan()-anrop, fyra sin()-anrop och två cos()-anrop. Trigonometriska funktioner är mycket kostsamma och sfäriska beräkningar innehåller många sådana.

source: The conclusion?
es: ¿Conclusión?
sv: Slutsatsen?

source: **If your data is geographically compact** (contained within a state, county or city), **use the geometry type with a Cartesian projection** that makes sense with your data. See the http://epsg.io site and type in the name of your region for a selection of possible reference systems.
es: **Si tus datos son geográficamente compactos** (dentro de un estado, condado o ciudad), usa el tipo geometry con una proyección cartesiana adecuada. Para elegir una, visita http://epsg.io e introduce el nombre de tu región para obtener una selección de posibles sistemas de referencia.
sv: **Om dina data är geografiskt kompakta** (inom en stat, ett län eller en stad), **använd geometritypen med en kartesisk projektion** som är logisk för dina data. Se webbplatsen http://epsg.io och skriv in namnet på din region för att få ett urval av möjliga referenssystem.

source: **If you need to measure distance with a dataset that is geographically dispersed** (covering much of the world), **use the geography type.** The application complexity you save by working in ``geography`` will offset any performance issues. And casting to ``geometry`` can offset most functionality limitations.
es: **Si necesitas medir distancias en un conjunto de datos geográficamente disperso** (cubriendo gran parte del mundo), usa el tipo geography. La complejidad que te ahorras compensará los problemas de rendimiento. Además, convertir a geometry puede suplir la mayoría de limitaciones funcionales.
sv: **Om du behöver mäta avstånd med en dataset som är geografiskt spridd** (täcker stora delar av världen), **använd typen geography.** Den applikationskomplexitet du sparar genom att arbeta i ``geography`` kommer att kompensera för eventuella prestandaproblem. Och casting till ``geometry`` kan kompensera för de flesta funktionsbegränsningar.

source: Function List
es: Lista de funciones
sv: Funktionslista

source: `ST_Distance(geometry, geometry) <http://postgis.net/docs/ST_Distance.html>`_: For geometry type Returns the 2-dimensional Cartesian minimum distance (based on spatial ref) between two geometries in projected units. For geography type defaults to return spheroidal minimum distance between two geographies in meters.
es: `ST_Distance(geometry, geometry)<http://postgis.net/docs/ST_Distance.html>`_: Para geometry devuelve la distancia cartesiana mínima bidimensional (basada en el sistema de referencia espacial) entre dos geometrías en unidades proyectadas. Para geography devuelve la distancia mínima esferoidal entre dos geographies en metros.
sv: `ST_Distance(geometri, geometri) <http://postgis.net/docs/ST_Distance.html>`_: För geometrityp Returnerar det 2-dimensionella kartesiska minimiavståndet (baserat på spatial ref) mellan två geometrier i projicerade enheter. För geograftyp returneras som standard det sfäroida minsta avståndet mellan två geografier i meter.

source: `ST_GeographyFromText(text) <http://postgis.net/docs/ST_GeographyFromText.html>`_: Returns a specified geography value from Well-Known Text representation or extended (WKT).
es: `ST_GeographyFromText(text) <http://postgis.net/docs/ST_GeographyFromText.html>`_: Devuelve un valor geography a partir de la representación en WKT o extendida.
sv: `ST_GeographyFromText(text) <http://postgis.net/docs/ST_GeographyFromText.html>`_: Returnerar ett specificerat geografivärde från Well-Known Text representation eller utökad (WKT).

source: `ST_Transform(geometry, srid) <http://postgis.net/docs/ST_Transform.html>`_: Returns a new geometry with its coordinates transformed to the SRID referenced by the integer parameter.
es: `ST_Transform(geometry, srid) <http://postgis.net/docs/ST_Transform.html>`_: Devuelve una nueva geometría con sus coordenadas transformadas al SRID indicado.
sv: `ST_Transform(geometry, srid) <http://postgis.net/docs/ST_Transform.html>`_: Returnerar en ny geometri med dess koordinater transformerade till den SRID som refereras till av heltalsparametern.

source: `ST_X(point) <http://postgis.net/docs/ST_X.html>`_: Returns the X coordinate of the point, or NULL if not available. Input must be a point.
es: `ST_X(point) <http://postgis.net/docs/ST_X.html>`_: Devuelve la coordenada X del punto, o NULL si no está disponible. La entrada debe ser un punto.
sv: `ST_X(point) <http://postgis.net/docs/ST_X.html>`_: Returnerar punktens X-koordinat, eller NULL om den inte är tillgänglig. Indata måste vara en punkt.

source: `ST_Azimuth(geography_A, geography_B) <http://postgis.net/docs/ST_Azimuth.html>`_: Returns the direction from A to B in radians.
es: `ST_Azimuth(geography_A, geography_B) <http://postgis.net/docs/ST_Azimuth.html>`_: Devuelve la dirección de A a B en radianes.
sv: `ST_Azimuth(geografi_A, geografi_B) <http://postgis.net/docs/ST_Azimuth.html>`_: Returnerar riktningen från A till B i radianer.

source: `ST_DWithin(geography_A, geography_B, R) <http://postgis.net/docs/ST_DWithin.html>`_: Returns true if A is within R meters of B.
es: `ST_DWithin(geography_A, geography_B, R) <http://postgis.net/docs/ST_DWithin.html>`_: Devuelve verdadero si A está dentro de R metros de B.
sv: `ST_DWithin(geografi_A, geografi_B, R) <http://postgis.net/docs/ST_DWithin.html>`_: Returnerar sant om A ligger inom R meter från B.

source: Footnotes
es: Nota al pie
sv: Fotnoter

source: The buffer and intersection functions are actually wrappers on top of a cast to geometry, and are not carried out natively in spherical coordinates. As a result, they may fail to return correct results for objects with very large extents that cannot be cleanly converted to a planar representation.
es: Las funciones de buffer e intersection en realidad son envoltorios sobre un casting a geometry, y no se ejecutan de forma nativa en coordenadas esféricas. Como resultado, pueden fallar al devolver resultados correctos para objetos con extensiones muy grandes que no pueden convertirse limpiamente a una representación planar.
sv: Buffert- och intersektionsfunktionerna är faktiskt omslag ovanpå en geometriomvandling och utförs inte naturligt i sfäriska koordinater. Därför kan de misslyckas med att returnera korrekta resultat för objekt med mycket stor utbredning som inte kan konverteras till en plan representation.

source: For example, the :command:`ST_Buffer(geography,distance)` function transforms the geography object into a "best" projection, buffers it, and then transforms it back to geographics. If there is no "best" projection (the object is too large), the operation can fail or return a malformed buffer.
es: Por ejemplo, la función :command:ST_Buffer(geography,distance) transforma el objeto geography a una proyección “óptima”, aplica el buffer y luego lo transforma de nuevo a geográficas. Si no existe una proyección “óptima” (el objeto es demasiado grande), la operación puede fallar o devolver un buffer malformado.
sv: Funktionen :command:`ST_Buffer(geography,distance)` transformerar t.ex. geografiobjektet till en "bästa" projektion, buffrar den och transformerar sedan tillbaka den till geografin. Om det inte finns någon "bästa" projektion (objektet är för stort) kan operationen misslyckas eller returnera en felformad buffert.

source: By appending ``::geometry`` to our geography value, we convert the object to a geometry with an SRID of 4326. From there we can use as many geometry functions as strike our fancy. But, remember -- now that our object is a geometry, the coordinates will be interpretted as Cartesian coordinates, not spherical ones.
sv: Genom att lägga till ``::geometry`` till vårt geografivärde konverterar vi objektet till en geometri med en SRID på 4326. Därifrån kan vi använda så många geometrifunktioner som vi vill. Men kom ihåg - nu när vårt objekt är en geometri kommer koordinaterna att tolkas som kartesiska koordinater, inte sfäriska.
