Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/geography_exercises.po
Languages: es, sv, uk

source: Geography Exercises
es: Ejercicios de Datos Tipo Geography
sv: Övningar i geografi
uk: Вправи з географії

source: Here's a reminder of all the functions we have seen so far. They should be useful for the exercises!
es: Aquí tiene un recordatorio de todas las funciones que hemos visto hasta ahora. Le serán útiles para los ejercicios!.
sv: Här är en påminnelse om alla de funktioner vi har sett hittills. De bör vara användbara för övningarna!
uk: Ось нагадування про всі функції, які ми бачили до цього часу. Вони мають бути корисними для виконання вправ!

source: :command:`Sum(number)` adds up all the numbers in the result set
es: :command:`Sum(number)` suma todos los números del conjunto de resultados
sv: :command:`Sum(number)` adderar alla siffror i resultatuppsättningen
uk: :command:`Sum(number)` додає всі числа в наборі результатів

source: :command:`ST_GeogFromText(text)` returns a geography
es: :command:`ST_GeogFromText(text)` retorna un objeto tipo geography
sv: :command:`ST_GeogFromText(text)` returnerar en geografisk
uk: :command:`ST_GeogFromText(text)` повертає geography

source: :command:`ST_Distance(geography, geography)` returns the distance between geographies
es: :command:`ST_Distance(geography, geography)` retorna la distancia entre dos objetos tipo geography
sv: :command:`ST_Distance(geography, geography)` returnerar avståndet mellan olika geografiska områden
uk: :command:`ST_Distance(geography, geography)` повертає відстань між geography

source: :command:`ST_Transform(geometry, srid)` returns geometry, in the new projection
es: :command:`ST_Transform(geometry, srid)` retorna el objeto tipo geometría en la nueva proyección
sv: :command:`ST_Transform(geometry, srid)` returnerar geometrin i den nya projektionen
uk: :command:`ST_Transform(geometry, srid)` повертає геометрію в новій проекції

source: :command:`ST_Length(geography)` returns the length of the line
es: :command:`ST_Length(geography)` retorna la longitud de la línea
sv: :command:`ST_Length(geography)` returnerar längden på raden
uk: :command:`ST_Length(geography)` повертає довжину лінії

source: :command:`ST_Intersects(geometry, geometry)` returns true if the objects are not disjoint in planar space
es: :command:`ST_Intersects(geometry, geometry)` retorna true si los objetos no son disyuntos en un espacio plano
sv: :command:`ST_Intersects(geometry, geometry)` returnerar true om objekten inte är åtskilda i planar space
uk: :command:`ST_Intersects(geometry, geometry)` повертає true, якщо об’єкти не є роз’єднаними в планарному просторі

source: :command:`ST_Intersects(geography, geography)` returns true if the objects are not disjoint in spheroidal space
es: :command:`ST_Intersects(geography, geography)` devuelve true si los objetos no son disjuntos en el espacio esferoidal
sv: :command:`ST_Intersects(geography, geography)` returnerar true om objekten inte är åtskilda i sfäroidal rymd
uk: :command:`ST_Intersects(geography, geography)`повертає true, якщо об’єкти не є роз’єднаними у сфероїдальному просторі

source: Also remember the tables we have available:
es: También recuerde las tablas que tenemos disponibles:
sv: Tänk också på de bord vi har tillgängliga:
uk: Також пам’ятайте про таблиці, які у нас є:

source: Exercises
es: Ejercicios
sv: Övningar
uk: Вправи

source: **How far is New York from Seattle? What are the units of the answer?**
es: **¿A qué distancia está Nueva York de Seattle? ¿Cuáles son las unidades de la respuesta?**
sv: **Hur långt är det mellan New York och Seattle? Vilka är enheterna i svaret?**
uk: **Як далеко Нью-Йорк від Сіетла? Якими одиницями виразити відповідь?**

source: New York = ``POINT(-74.0064 40.7142)`` and Seattle = ``POINT(-122.3331 47.6097)``
es: New York = ``POINT(-74.0064 40.7142)`` y Seattle = ``POINT(-122.3331 47.6097)``
sv: New York = ``POINT(-74.0064 40.7142)`` och Seattle = ``POINT(-122.3331 47.6097)``
uk: New York = ``POINT(-74.0064 40.7142)`` та Seattle = ``POINT(-122.3331 47.6097)``

source: **What is the total length of all streets in New York, calculated on the spheroid?**
es: **¿Cuál es la longitud total de todas las calles de Nueva York, calculada sobre el esferoide?
sv: **Vad är den totala längden på alla gator i New York, beräknat på sfäroiden?**
uk: **Яка загальна довжина всіх вулиць Нью-Йорка, розрахована на сфероїді?**

source: The length calculated in the planar "UTM Zone 18" projection is 10418904.717, 0.02% different. UTM is good at preserving area and distance, within the zone boundaries.
es: La longitud calculada en la proyección plana «UTM Zone 18» es 10418904,717, un 0,02% de diferencia. UTM es bueno para preservar el área y la distancia, dentro de los límites de la zona.
sv: Den längd som beräknas i den plana projektionen "UTM Zone 18" är 10418904.717, 0.02% different. UTM är bra på att bevara yta och avstånd inom zongränserna.
uk: Довжина, розрахована в плоскій проекції «UTM Zone 18», становить 10418904,717, що відрізняється на 0,02%. UTM добре зберігає площу та відстань у межах зони.

source: **Does ‘POINT(1 2.0001)’ intersect with ‘POLYGON((0 0, 0 2, 2 2, 2 0, 0 0))’ in geography? In geometry? Why the difference?**
es: **¿Se cruza 'POINT(1 2,0001)' con 'POLYGON((0 0, 0 2, 2 2, 2 0, 0 0))' en geografía? ¿En geometría? ¿Por qué la diferencia?
sv: ** Skär "POINT(1 2,0001)" "POLYGON((0 0, 0 2, 2 2, 2 0, 0 0))" i geografi? I geometri? Varför är det skillnad?**
uk: **Чи перетинається «POINT(1 2.0001)» з «POLYGON((0 0, 0 2, 2 2, 2 0, 0 0))» в географії? А в геометрії? Чому є різниця?**

source: The upper edge of the square is a straight line in geometry, and passes **below** the point, so the square does not contain the point. The upper edge of the square is a great circle in geography, and passes **above** the point, so the square does contain the point.
es: La arista superior del cuadrado es una línea recta en geometría, y pasa **por debajo** del punto, por lo que el cuadrado no contiene el punto. La arista superior del cuadrado es un gran círculo en geografía, y pasa **por encima** del punto, por lo que el cuadrado sí contiene el punto.
sv: Kvadratens övre kant är en rät linje i geometri och passerar **under** punkten, så kvadraten innehåller inte punkten. Kvadratens övre kant är en storcirkel i geografi, och passerar **över** punkten, så kvadraten innehåller punkten.
uk: Верхній край квадрата у геометрії — це пряма лінія, яка проходить нижче від точки, тож квадрат не містить цю точку. Верхній край квадрата у географії — це великий круг, який проходить вище від точки, тому квадрат містить цю точку.
