Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/geometry_returning.po
Languages: es, sv

source: Geometry Constructing Functions
es: Funciones de Construcción de Geometrías
sv: Funktioner för geometrikonstruktion

source: All the functions we have seen so far work with geometries "as they are" and returns
es: Todas las funciones que hemos visto hasta ahora trabajan con geometrías «tal cual» y devuelven
sv: Alla funktioner som vi har sett hittills arbetar med geometrier "som de är" och returnerar

source: analyses of the objects (:command:`ST_Length(geometry)`, :command:`ST_Area(geometry)`),
es: análisis de los objetos (:command:ST_Length(geometry), :command:ST_Area(geometry)),
sv: analyser av objekten (:command:`ST_Length(geometry)`, :command:`ST_Area(geometry)`),

source: serializations of the objects (:command:`ST_AsText(geometry)`, :command:`ST_AsGML(geometry)`),
es: serializaciones de los objetos (:command:ST_AsText(geometry), :command:ST_AsGML(geometry)),
sv: serialiseringar av objekten (:command:`ST_AsText(geometry)`, :command:`ST_AsGML(geometry)`),

source: parts of the object (:command:`ST_RingN(geometry,n)`) or
es: partes del objeto (:command:ST_RingN(geometry,n)) o
sv: delar av objektet (:command:`ST_RingN(geometry,n)`) eller

source: true/false tests (:command:`ST_Contains(geometry,geometry)`, :command:`ST_Intersects(geometry,geometry)`).
es: pruebas verdadero/falso (:command:ST_Contains(geometry,geometry), :command:ST_Intersects(geometry,geometry)).
sv: sant/falskt-test (:command:`ST_Contains(geometry,geometry)`, :command:`ST_Intersects(geometry,geometry)`).

source: "Geometry constructing functions" take geometries as inputs and output new shapes.
es: Las "funciones de construcción de geometrías" toman geometrías como entrada y generan nuevas formas.
sv: "Geometry constructing functions" tar geometrier som indata och matar ut nya former.

source: A common need when composing a spatial query is to replace a polygon feature with a point representation of the feature. This is useful for spatial joins (as discussed in :ref:`polypolyjoins`) because using :command:`ST_Intersects(geometry,geometry)` on two polygon layers often results in double-counting: a polygon on a boundary will intersect an object on both sides; replacing it with a point forces it to be on one side or the other, not both.
es: Una necesidad común al componer una consulta espacial es reemplazar un polígono con una representación puntual de la entidad. Esto es útil para las uniones espaciales (como se discute en :ref:polypolyjoins) porque usar :command:ST_Intersects(geometry,geometry) sobre dos capas de polígonos a menudo resulta en doble conteo: un polígono en un límite intersectará un objeto a ambos lados; reemplazarlo con un punto obliga a que esté en un lado u otro, no en ambos.
sv: Ett vanligt behov när man skapar en spatial fråga är att ersätta en polygonfunktion med en punktrepresentation av funktionen. Detta är användbart för spatiala sammanfogningar (som diskuteras i :ref:`polypolyjoins`) eftersom användning av :command:`ST_Intersects(geometry,geometry)` på två polygonlager ofta resulterar i dubbelräkning: en polygon på en gräns kommer att korsa ett objekt på båda sidor; om den ersätts med en punkt måste den vara på den ena eller andra sidan, inte båda.

source: :command:`ST_Centroid(geometry)` returns a point that is approximately on the center of mass of the input argument. This simple calculation is very fast, but sometimes not desirable, because the returned point is not necessarily in the feature itself. If the input feature has a convexity (imagine the letter 'C') the returned centroid might not be in the interior of the feature.
es: :command:ST_Centroid(geometry) devuelve un punto que está aproximadamente en el centro de masa del argumento de entrada. Este cálculo simple es muy rápido, pero a veces no es deseable, porque el punto devuelto no necesariamente se encuentra dentro de la propia geometría. Si la entidad de entrada tiene una concavidad (imagine la letra 'C'), el centroide devuelto podría no estar en el interior de la entidad.
sv: :command:`ST_Centroid(geometry)` returnerar en punkt som ligger ungefär på inmatningsargumentets masscentrum. Denna enkla beräkning är mycket snabb, men ibland inte önskvärd, eftersom den returnerade punkten inte nödvändigtvis ligger i själva objektet. Om inmatningsobjektet har en konvexitet (föreställ dig bokstaven "C") är det inte säkert att den returnerade centroiden ligger i objektets inre.

source: :command:`ST_PointOnSurface(geometry)` returns a point that is guaranteed to be inside the input argument. This makes it more useful for computing "proxy points" for spatial joins.
es: :command:ST_PointOnSurface(geometry) devuelve un punto que está garantizado dentro del argumento de entrada. Esto lo hace más útil para calcular "puntos representativos" en junturas (joins) espaciales.
sv: :command:`ST_PointOnSurface(geometry)` returnerar en punkt som garanterat befinner sig inuti inmatningsargumentet. Detta gör den mer användbar för att beräkna "proxypunkter" för spatiala sammanfogningar.

source: The buffering operation is common in GIS workflows, and is also available in PostGIS. :command:`ST_Buffer(geometry,distance)` takes in a buffer distance and geometry type and outputs a polygon with a boundary the buffer distance away from the input geometry.
es: La operación de buffer es común en los flujos de trabajo SIG, y también está disponible en PostGIS. :command:ST_Buffer(geometry,distance) recibe una distancia de buffer y una geometría, y devuelve un polígono con un límite a la distancia especificada de la geometría de entrada.
sv: Buffringsoperationen är vanlig i GIS-arbetsflöden och finns även tillgänglig i PostGIS. :command:`ST_Buffer(geometry,distance)` tar in ett buffertavstånd och en geometrityp och matar ut en polygon med en gräns som ligger buffertavståndet bort från indatageometrin.

source: For example, if the US Park Service wanted to enforce a marine traffic zone around Liberty Island, they might build a 500 meter buffer polygon around the island. Liberty Island is a single census block in our ``nyc_census_blocks`` table, so we can easily extract and buffer it.
es: Por ejemplo, si el Servicio de Parques de EE. UU. quisiera establecer una zona de tráfico marítimo alrededor de Liberty Island, podría construir un polígono de buffer de 500 metros alrededor de la isla. Liberty Island es un solo bloque censal en nuestra tabla nyc_census_blocks, por lo que podemos extraerlo y generar el buffer fácilmente.
sv: Om US Park Service till exempel ville införa en marin trafikzon runt Liberty Island skulle de kunna bygga en 500 meter buffertpolygon runt ön. Liberty Island är ett enda folkräkningsblock i vår tabell ``nyc_census_blocks``, så vi kan enkelt extrahera och buffra det.

source: The :command:`ST_Buffer` function also accepts negative distances and builds inscribed polygons within polygonal inputs. For lines and points you will just get an empty return.
es: La función :command:ST_Buffer también acepta distancias negativas y construye polígonos inscritos dentro de las geometrías poligonales de entrada. Para líneas y puntos simplemente devolverá un resultado vacío.
sv: Funktionen :command:`ST_Buffer` accepterar även negativa avstånd och bygger inskrivna polygoner inom polygonala ingångar. För linjer och punkter får du bara en tom retur.

source: Another classic GIS operation -- the "overlay" -- creates a new coverage by calculating the intersection of two superimposed polygons. The resultant has the property that any polygon in either of the parents can be built by merging polygons in the resultant.
es: Otra operación clásica de SIG —el "overlay" o superposición— crea una nueva cobertura al calcular la intersección de dos polígonos superpuestos. El resultado tiene la propiedad de que cualquier polígono de los padres puede construirse a partir de la unión de polígonos en el resultado.
sv: En annan klassisk GIS-operation - "overlay" - skapar en ny täckning genom att beräkna korsningspunkten mellan två överlagrade polygoner. Den resulterande polygonen har egenskapen att alla polygoner i någon av föräldrarna kan byggas genom att slå samman polygoner i den resulterande polygonen.

source: The :command:`ST_Intersection(geometry A, geometry B)` function returns the spatial area (or line, or point) that both arguments have in common. If the arguments are disjoint, the function returns an empty geometry.
es: La función :command:ST_Intersection(geometry A, geometry B) devuelve el área espacial (o línea, o punto) que ambos argumentos tienen en común. Si los argumentos no se intersectan, la función devuelve una geometría vacía.
sv: Funktionen :command:`ST_Intersection(geometry A, geometry B)` returnerar det spatiala område (eller den linje eller punkt) som de båda argumenten har gemensamt. Om argumenten är disjunkta returnerar funktionen en tom geometri.

source: In the previous example we intersected geometries, creating a new geometry that had lines from both the inputs. The :command:`ST_Union` function does the reverse; it takes inputs and removes common lines. There are two forms of the :command:`ST_Union` function:
es: En el ejemplo anterior intersectamos geometrías, creando una nueva geometría que tenía líneas de ambas entradas. La función :command:ST_Union hace lo contrario: toma las entradas y elimina las líneas comunes. Existen dos formas de la función :command:ST_Union:
sv: I det föregående exemplet korsade vi geometrier och skapade en ny geometri som hade linjer från båda ingångarna. Funktionen :command:`ST_Union` gör det omvända; den tar ingångar och tar bort gemensamma linjer. Det finns två former av funktionen :command:`ST_Union`:

source: :command:`ST_Union(geometry, geometry)`: A two-argument version that takes in two geometries and returns the merged union. For example, our two-circle example from the previous section looks like this when you replace the intersection with a union.
es: :command:ST_Union(geometry, geometry): Una versión de dos argumentos que recibe dos geometrías y devuelve la unión combinada. Por ejemplo, nuestro ejemplo de dos círculos de la sección anterior se ve así cuando reemplazas la intersección por una unión.
sv: :command:`ST_Union(geometry, geometry)`: En version med två argument som tar in två geometrier och returnerar den sammanslagna unionen. Till exempel ser vårt exempel med två cirklar från föregående avsnitt ut så här när du ersätter intersektionen med en union.

source: :command:`ST_Union([geometry])`: An aggregate version that takes in a set of geometries and returns the merged geometry for the entire group. The aggregate ST_Union can be used with the ``GROUP BY`` SQL statement to create carefully merged subsets of basic geometries. It is very powerful.
es: :command:ST_Union([geometry]): Una versión agregada que recibe un conjunto de geometrías y devuelve la geometría fusionada de todo el grupo. La versión agregada de ST_Union puede usarse con la sentencia SQL GROUP BY para crear subconjuntos cuidadosamente fusionados de geometrías básicas. Es muy potente.
sv: :command:`ST_Union([geometry])`: En aggregerad version som tar in en uppsättning geometrier och returnerar den sammanslagna geometrin för hela gruppen. Aggregatet ST_Union kan användas med SQL-satsen ``GROUP BY`` för att skapa noggrant sammanslagna delmängder av grundläggande geometrier. Det är ett mycket kraftfullt verktyg.

source: As an example of :command:`ST_Union` aggregation, consider our ``nyc_census_blocks`` table. Census geography is carefully constructed so that larger geographies can be built up from smaller ones. So, we can create a census tracts map by merging the blocks that form each tract (as we do later in :ref:`creatingtractstable`). Or, we can create a county map by merging blocks that fall within each county.
es: Como ejemplo de agregación con :command:ST_Union, consideremos nuestra tabla nyc_census_blocks. La geografía censal está cuidadosamente construida de modo que las geografías más grandes puedan generarse a partir de las más pequeñas. Así, podemos crear un mapa de tramos censales uniendo los bloques que forman cada tramo. O podemos crear un mapa de condados uniendo los bloques que caen dentro de cada condado.
sv: Som ett exempel på :command:`ST_Union`-aggregering kan vi ta vår tabell ``nyc_census_blocks``. Censusgeografin är noggrant konstruerad så att större geografier kan byggas upp från mindre. Så vi kan skapa en karta över folkräkningstrakter genom att slå samman de kvarter som bildar varje trakt (vilket vi gör senare i :ref:`creatingtractstable`). Eller så kan vi skapa en länskarta genom att slå samman block som faller inom varje län.

source: To carry out the merge, note that the unique key ``blkid`` actually embeds information about the higher level geographies. Here are the parts of the key for Liberty Island we used earlier:
es: Para llevar a cabo la unión, obsérvese que la clave única blkid en realidad incorpora información sobre las geografías de nivel superior. Aquí están las partes de la clave para Liberty Island que usamos anteriormente:
sv: För att utföra sammanslagningen, notera att den unika nyckeln ``blkid`` faktiskt innehåller information om geografierna på högre nivå. Här är de delar av nyckeln för Liberty Island som vi använde tidigare:

source: So, we can create a county map by merging all geometries that share the same first 5 digits of their ``blkid``. Be patient; this is computationally expensive and can take a minute or two.
es: Así, podemos crear un mapa de condados uniendo todas las geometrías que comparten los mismos primeros 5 dígitos de su blkid. Sea paciente; esto es computacionalmente costoso y puede tardar uno o dos minutos.
sv: Så vi kan skapa en länskarta genom att slå samman alla geometrier som delar samma första 5 siffror i deras ``blkid``. Ha tålamod; detta är beräkningsmässigt dyrt och kan ta en minut eller två.

source: An area test can confirm that our union operation did not lose any geometry. First, we calculate the area of each individual census block, and sum those areas grouping by census county id.
es: Una prueba de área puede confirmar que nuestra operación de unión no perdió ninguna geometría. Primero, calculamos el área de cada bloque censal individual y sumamos esas áreas agrupando por id de condado censal.
sv: Ett områdestest kan bekräfta att vår union-operation inte har förlorat någon geometri. Först beräknar vi ytan för varje enskilt folkbokföringsblock och summerar dessa ytor grupperade efter folkbokföringslänets id.

source: Then we calculate the area of each of our new county polygons from the county table:
es: Luego calculamos el área de cada uno de nuestros nuevos polígonos de condado a partir de la tabla de condados:
sv: Sedan beräknar vi arean för var och en av våra nya länspolygoner från länstabellen:

source: The same answer! We have successfully built an NYC county table from our census blocks data.
es: ¡La misma respuesta! Hemos construido exitosamente una tabla de condados de NYC a partir de nuestros datos de bloques censales.
sv: Samma svar! Vi har framgångsrikt byggt en NYC county-tabell från våra data om folkbokföringsblock.

source: Function List
es: Lista de funciones
sv: Funktionslista

source: `ST_Centroid(geometry) <http://postgis.net/docs/ST_Centroid.html>`_: Returns a point geometry that represents the center of mass of the input geometry.
es: ST_Centroid(geometry) <http://postgis.net/docs/ST_Centroid.html>_: Devuelve una geometría de punto que representa el centro de masa de la geometría de entrada.
sv: `ST_Centroid(geometri) <http://postgis.net/docs/ST_Centroid.html>`_: Returnerar en punktgeometri som representerar masscentrum för indatageometrin.

source: `ST_PointOnSurface(geometry) <http://postgis.net/docs/ST_PointOnSurface.html>`_: Returns a point geometry that is guaranteed to be in the interior of the input geometry.
es: ST_PointOnSurface(geometry) <http://postgis.net/docs/ST_PointOnSurface.html>_: Devuelve una geometría de punto que está garantizada en el interior de la geometría de entrada.
sv: `ST_PointOnSurface(geometry) <http://postgis.net/docs/ST_PointOnSurface.html>`_: Returnerar en punktgeometri som garanterat befinner sig i det inre av indatageometrin.

source: `ST_Buffer(geometry, distance) <http://postgis.net/docs/ST_Buffer.html>`_: For geometry: Returns a geometry that represents all points whose distance from this Geometry is less than or equal to distance. Calculations are in the Spatial Reference System of this Geometry. For geography: Uses a planar transform wrapper.
es: ST_Buffer(geometry, distance) <http://postgis.net/docs/ST_Buffer.html>_: Para geometría: devuelve una geometría que representa todos los puntos cuya distancia desde esta geometría es menor o igual a la distancia. Los cálculos se realizan en el sistema de referencia espacial de esta geometría. Para geografía: usa un envoltorio de transformación planar.
sv: `ST_Buffer(geometri, distance) <http://postgis.net/docs/ST_Buffer.html>`_: För geometri: Returnerar en geometri som representerar alla punkter vars avstånd från denna geometri är mindre än eller lika med distance. Beräkningar görs i det spatiala referenssystemet för denna geometri. För geografi: Använder ett omslag för planar transformation.

source: `ST_Intersection(geometry A, geometry B) <http://postgis.net/docs/ST_Intersection.html>`_: Returns a geometry that represents the shared portion of geomA and geomB. The geography implementation does a transform to geometry to do the intersection and then transform back to WGS84.
es: ST_Intersection(geometry A, geometry B) <http://postgis.net/docs/ST_Intersection.html>_: Devuelve una geometría que representa la porción compartida de geomA y geomB. La implementación en geografía realiza una transformación a geometría para efectuar la intersección y luego transforma de nuevo a WGS84.
sv: `ST_Intersection(geometri A, geometri B) <http://postgis.net/docs/ST_Intersection.html>`_: Returnerar en geometri som representerar den delade delen av geomA och geomB. Geografi-implementeringen gör en transform till geometri för att göra korsningen och sedan transformera tillbaka till WGS84.

source: `ST_Union() <http://postgis.net/docs/ST_Union.html>`_: Returns a geometry that represents the point set union of the Geometries.
es: ST_Union() <http://postgis.net/docs/ST_Union.html>_: Devuelve una geometría que representa la unión de conjuntos de puntos de las geometrías.
sv: `ST_Union() <http://postgis.net/docs/ST_Union.html>`_: Returnerar en geometri som representerar punktuppsättningens union av geometrierna.

source: `ST_AsText(text) <http://postgis.net/docs/ST_AsText.html>`_: Returns the Well-Known Text (WKT) representation of the geometry/geography without SRID metadata.
es: ST_AsText(text) <http://postgis.net/docs/ST_AsText.html>_: Devuelve la representación Well-Known Text (WKT) de la geometría/geografía sin metadatos de SRID.
sv: `ST_AsText(text) <http://postgis.net/docs/ST_AsText.html>`_: Returnerar WKT-representationen (Well-Known Text) av geometrin/geografin utan SRID-metadata.

source: `substring(string [from int] [for int]) <http://www.postgresql.org/docs/current/static/functions-string.html>`_: PostgreSQL string function to extract substring matching SQL regular expression.
es: substring(string [from int] [for int]) <http://www.postgresql.org/docs/current/static/functions-string.html>_: Función de PostgreSQL para extraer una subcadena que coincide con una expresión regular SQL.
sv: `substring(sträng [från int] [för int]) <http://www.postgresql.org/docs/current/static/functions-string.html>`_: PostgreSQL-strängfunktion för att extrahera delsträng som matchar SQL reguljärt uttryck.

source: `sum(expression) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL aggregate function that returns the sum of records in a set of records.
es: `sum(expresión) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: Función de PostgreSQL que devuelve la suma de los valores de un conjunto de registros.
sv: `sum(uttryck) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL-aggregeringsfunktion som returnerar summan av poster i en uppsättning poster.
