Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/geometries_exercises.po
Languages: es, sv, uk

source: Geometry Exercises
es: Ejercicios de Geometría
sv: Övningar i geometri
uk: Вправи з геометрією

source: Here's a reminder of all the functions we have seen so far. They should be useful for the exercises!
es: Aquí tiene un recordatorio de todas las funciones que hemos visto hasta ahora. Le serán útiles para los ejercicios!
sv: Här är en påminnelse om alla de funktioner vi har sett hittills. De bör vara användbara för övningarna!
uk: Ось нагадування про всі функції, які ми бачили до цього часу. Вони мають бути корисними для виконання вправ!

source: :command:`sum(expression)` aggregate to return a sum for a set of records
es: :command:`sum(expresión)` función de agregación para devolver una suma de un conjunto de registros
sv: :command:`sum(uttryck)` aggregat för att returnera en summa för en uppsättning poster
uk: :command:`sum(expression)`агрегатна функція, що повертає суму для набору записів

source: :command:`count(expression)` aggregate to return the size of a set of records
es: :command:`count(expression)`: devolver la cantidad de filas (registros) que retorna una consulta
sv: :command:`count(uttryck)` aggregat för att returnera storleken på en uppsättning poster
uk: :command:`count(expression)`агрегатна функція, що повертає кількість записів у наборі

source: :command:`ST_GeometryType(geometry)` returns the type of the geometry
es: :command:`ST_GeometryType(geometry)` devuelve el tipo de geometría
sv: :command:`ST_GeometryType(geometry)` returnerar typen av geometri
uk: :command:`ST_GeometryType(geometry)` повертає тип геометрії

source: :command:`ST_NDims(geometry)` returns the number of dimensions of the geometry
es: :command:`ST_NDims(geometry)` devuelve el número de dimensiones de la geometría
sv: :command:`ST_NDims(geometry)` returnerar antalet dimensioner för geometrin
uk: :command:`ST_NDims(geometry)` повертає кількість вимірів геометрії

source: :command:`ST_SRID(geometry)` returns the spatial reference identifier number of the geometry
es: :command:`ST_SRID(geometry)` devuelve el número identificador de referencia espacial de la geometría
sv: :command:`ST_SRID(geometry)` returnerar geometrins identifieringsnummer för spatial referens
uk: :command:`ST_SRID(geometry)`повертає номер ідентифікатора просторової прив’язки (SRID) геометрії

source: :command:`ST_X(point)` returns the X ordinate
es: :command:`ST_X(point)` retorna la coordenada X
sv: :command:`ST_X(point)` returnerar X-ordinaten
uk: :command:`ST_X(point)` повертає координату X

source: :command:`ST_Y(point)` returns the Y ordinate
es: :command:`ST_Y(point)` retorna la coordenada Y
sv: :command:`ST_Y(point)` returnerar Y-ordinaten
uk: :command:`ST_Y(point)` повертає координату Y

source: :command:`ST_Length(linestring)` returns the length of the linestring
es: :command:`ST_Length(linestring)` retorna la longitud de la línea
sv: :command:`ST_Length(linestring)` returnerar längden på linestring
uk: :command:`ST_Length(linestring)` повертає довжину лінії (linestring)

source: :command:`ST_StartPoint(geometry)` returns the first coordinate as a point
es: :command:`ST_StartPoint(geometry)` devuelve la primera coordenada como un punto
sv: :command:`ST_StartPoint(geometry)` returnerar den första koordinaten som en punkt
uk: :command:`ST_StartPoint(geometry)`повертає першу координату у вигляді точки

source: :command:`ST_EndPoint(geometry)` returns the last coordinate as a point
es: :command:`ST_EndPoint(geometry)` devuelve la última coordenada como un punto
sv: :command:`ST_EndPoint(geometry)` returnerar den sista koordinaten som en punkt
uk: :command:`ST_EndPoint(geometry)` повертає останню координату у вигляді точки

source: :command:`ST_NPoints(geometry)` returns the number of coordinates in the linestring
es: :command:`ST_NPoints(geometry)` devuelve el número de coordenadas en la linestring
sv: :command:`ST_NPoints(geometry)` returnerar antalet koordinater i linjesträngen
uk: :command:`ST_NPoints(geometry)` повертає кількість координат у лінії (linestring)

source: :command:`ST_Area(geometry)` returns the area of the polygons
es: :comando:`ST_Area(geometría)` devuelve el área de las geometrías
sv: :command:`ST_Area(geometry)` returnerar polygonernas area
uk: :command:`ST_Area(geometry)` повертає площу полігону

source: :command:`ST_NRings(geometry)` returns the number of rings (usually 1, more if there are holes)
es: :command:`ST_NRings(geometry)` devuelve el número de anillos, usualmente 1 (o más si hay agujeros)
sv: :command:`ST_NRings(geometry)` returnerar antalet ringar (vanligtvis 1, fler om det finns hål)
uk: :command:`ST_NRings(geometry)` повертає кількість кілець (зазвичай 1, більше — якщо є дірки)

source: :command:`ST_ExteriorRing(polygon)` returns the outer ring as a linestring
es: :command:`ST_ExteriorRing(polygon)` retorna el anillo exterior como una línea
sv: :command:`ST_ExteriorRing(polygon)` returnerar den yttre ringen som en linjestring
uk: :command:`ST_ExteriorRing(polygon)` повертає зовнішнє кільце у вигляді лінії (linestring)

source: :command:`ST_InteriorRingN(polygon, integer)` returns a specified interior ring as a linestring
es: :command:`ST_InteriorRingN(polygon, integer)` retorna el anillo interior especificado como una linea
sv: :command:`ST_InteriorRingN(polygon, integer)` returnerar en angiven inre ring som en linjestring
uk: :command:`ST_InteriorRingN(polygon, integer)` повертає вказане внутрішнє кільце у вигляді лінії(linestring)

source: :command:`ST_Perimeter(geometry)` returns the length of all the rings
es: :command:`ST_Perimeter(geometry)` devuelve la longitud de todos los anillos
sv: :command:`ST_Perimeter(geometry)` returnerar längden på alla ringar
uk: :command:`ST_Perimeter(geometry)` повертає сумарну довжину всіх кілець

source: :command:`ST_NumGeometries(multi/geomcollection)` returns the number of parts in the collection
es: :command:`ST_NumGeometries(multi/geomcollection)` retorna el número de partes de una colección
sv: :command:`ST_NumGeometries(multi/geomcollection)` returnerar antalet delar i samlingen
uk: :command:`ST_NumGeometries(multi/geomcollection)` повертає кількість частин у колекції

source: :command:`ST_GeometryN(geometry, integer)` returns the specified part of the collection
es: :command:`ST_GeometryN(geometry, integer)` retorna la parte especificada de una colección
sv: :command:`ST_GeometryN(geometry, integer)` returnerar den angivna delen av samlingen
uk: :command:`ST_GeometryN(geometry, integer)` повертає вказану частину колекції

source: :command:`ST_GeomFromText(text)` returns ``geometry``
es: :command:`ST_GeomFromText(text)` retorna un objeto ``geometry`` desde una definición WKT
sv: :command:`ST_GeomFromText(text)` returnerar ``geometry``
uk: :command:`ST_GeomFromText(text)` повертає ``geometry``

source: :command:`ST_AsText(geometry)` returns WKT ``text``
es: :command:`ST_AsText(geometry)`convierte formato binario en WKT
sv: :command:`ST_AsText(geometry)` returnerar WKT ``text``
uk: :command:`ST_AsText(geometry)` повертає WKT ``text``

source: :command:`ST_AsEWKT(geometry)` returns EWKT ``text``
es: :command:`ST_AsEWKT(geometry)` retorna un texto EWKT
sv: :command:`ST_AsEWKT(geometry)` returnerar EWKT ``text``
uk: :command:`ST_AsEWKT(geometry)` повертає EWKT ``text``

source: :command:`ST_GeomFromWKB(bytea)` returns ``geometry``
es: :command:`ST_GeomFromWKB(bytea)` devuelve ``geometry``
sv: :command:`ST_GeomFromWKB(bytea)` returnerar ``geometry``
uk: :command:`ST_GeomFromWKB(bytea)` повертає ``geometry``

source: :command:`ST_AsBinary(geometry)` returns WKB ``bytea``
es: :command:`ST_AsBinary(geometry)` retorna un WKB de tipo ``bytea``
sv: :command:`ST_AsBinary(geometry)` returnerar WKB ``bytea``
uk: :command:`ST_AsBinary(geometry)` повертає WKB ``bytea``

source: :command:`ST_AsEWKB(geometry)` returns EWKB ``bytea``
es: :command:`ST_AsEWKB(geometry)` retorna un EWKB de tipo ``bytea``
sv: :command:`ST_AsEWKB(geometry)` returnerar EWKB ``bytea``
uk: :command:`ST_AsEWKB(geometry)` повертає EWKB ``bytea``

source: :command:`ST_GeomFromGML(text)` returns ``geometry``
es: :command:`ST_GeomFromGML(text)` devuelve ``geometry``
sv: :command:`ST_GeomFromGML(text)` returnerar ``geometry``
uk: :command:`ST_GeomFromGML(text)` повертає ``geometry``

source: :command:`ST_AsGML(geometry)` returns GML ``text``
es: :command:`ST_AsGML(geometry)` retorna la geometría expresada como un texto GML
sv: :command:`ST_AsGML(geometry)` returnerar GML ``text``
uk: :command:`ST_AsGML(geometry)` повертає GML ``text``

source: :command:`ST_GeomFromKML(text)` returns ``geometry``
es: :command:`ST_GeomFromKML(text)` devuelve ``geometry``
sv: :command:`ST_GeomFromKML(text)` returnerar ``geometry``
uk: :command:`ST_GeomFromKML(text)` повертає ``geometry``

source: :command:`ST_AsKML(geometry)` returns KML ``text``
es: :command:`ST_AsKML(geometry)` retorna un texto KML
sv: :command:`ST_AsKML(geometry)` returnerar KML ``text``
uk: :command:`ST_AsKML(geometry)` повертає KML ``text``

source: :command:`ST_AsGeoJSON(geometry)` returns JSON ``text``
es: :command:`ST_AsGeoJSON(geometry)` retorna un texto en formato JSON
sv: :command:`ST_AsGeoJSON(geometry)` returnerar JSON ``text``
uk: :command:`ST_AsGeoJSON(geometry)` повретає JSON ``text``

source: :command:`ST_AsSVG(geometry)` returns SVG ``text``
es: :command:`ST_AsSVG(geometry)` retorna un texto en formato SVG
sv: :command:`ST_AsSVG(geometry)` returnerar SVG ``text``
uk: :command:`ST_AsSVG(geometry)` повертає SVG ``text``

source: Also remember the tables we have available:
es: También recuerde las tablas que tenemos disponibles:
sv: Tänk också på de tabeller vi har tillgängliga:
uk: Також пам’ятайте про таблиці, які у нас є:

source: Exercises
es: Ejercicios
sv: Övningar
uk: Вправи

source: **What is the area of the 'West Village' neighborhood?**
es: **¿Cuál es el área del barrio 'West Village'?**
sv: **Vad är området för stadsdelen "West Village"?**
uk: **Яка площа району «West Village»?**

source: The area is given in square meters. To get an area in hectares, divide by 10000. To get an area in acres, divide by 4047.
es: El área se da en metros cuadrados. Para obtener un área en hectáreas, divide entre 10000. Para obtener un área en acres, divide entre 4047.
sv: Arean anges i kvadratmeter. För att få en yta i hektar, dividera med 10000. För att få en yta i hektar, dividera med 4047.
uk: Площа наведена у квадратних метрах. Щоб отримати площу у гектарах, поділіть на 10 000. Щоб отримати площу в акрах, поділіть на 4047.

source: **What is the geometry type of ‘Pelham St’? The length?**
es: **¿Cuál es el tipo de geometría de ‘Pelham St’? ¿La longitud?**
sv: **Vilken geometri har "Pelham St"? Längden?**
uk: **Який тип геометрії у ‘Pelham St’? Яка її довжина?**

source: **What is the GeoJSON representation of the 'Broad St' subway station?**
es: **¿Cuál es la representación GeoJSON de la estación de metro 'Broad St'?**
sv: **Vad är GeoJSON-representationen av tunnelbanestationen "Broad St"?**
uk: **Яке GeoJSON-подання станції метро 'Broad St'?**

source: **What is the total length of streets (in kilometers) in New York City?** (Hint: The units of measurement of the spatial data are meters, there are 1000 meters in a kilometer.)
es: **¿Cuál es la longitud total de las calles (en kilómetros) en la ciudad de Nueva York?** (Pista: las unidades de medida de los datos espaciales son metros, hay 1000 metros en un kilómetro.)
sv: **Vad är den totala längden på gatorna (i kilometer) i New York City?** (Tips: Måttenheterna för de spatiala uppgifterna är meter, det går 1000 meter på en kilometer)
uk: **Яка загальна довжина вулиць (у кілометрах) у Нью-Йорку?** (Підказка: одиниці вимірювання просторових даних — метри, у кілометрі 1000 метрів.)

source: **What is the area of Manhattan in acres?** (Hint: both ``nyc_census_blocks`` and ``nyc_neighborhoods`` have a ``boroname`` in them.)
es: **¿Cuál es el área de Manhattan en acres?** (Pista: tanto ``nyc_census_blocks`` como ``nyc_neighborhoods`` tienen un ``boroname`` en ellos.)
sv: **Vad är Manhattans yta i hektar?** (Tips: både ``nyc_census_blocks`` och ``nyc_neighborhoods`` har ett ``boroname`` i sig)
uk: **Яка площа Манхеттена в акрах? **(Підказка: і ``nyc_census_blocks ``, і ``nyc_neighborhoods `` містять поле ``boroname ``.)

source: or...
es: o...
sv: eller...
uk: або...

source: **What is the most westerly subway station?**
es: **¿Cuál es la estación de metro más al occidente?**
sv: **Vilken är den västligaste tunnelbanestationen?**
uk: **Яка станція метро знаходиться найзахідніше?**

source: **How long is 'Columbus Cir' (aka Columbus Circle)?**
es: **¿Cuál es la longitud de 'Columbus Cir' (también conocido como Columbus Circle)?**
sv: **Hur lång är Columbus Cir (även kallad Columbus Circle)?**
uk: **Яка довжина вулиці 'Columbus Cir' (також відома як Columbus Circle)?**

source: **What is the length of streets in New York City, summarized by type?**
es: **¿Cuál es la longitud de las calles en la ciudad de Nueva York, resumida por tipo?**
sv: **Vad är längden på gatorna i New York City, sammanfattat per typ?**
uk: **Яка довжина вулиць у Нью-Йорку за типами (підсумовано)?**

source: The ``ORDER BY length DESC`` clause sorts the result by length in descending order. The result is that most prevalent types are first in the list.
es: La cláusula ``ORDER BY length DESC`` ordena el resultado por longitud en orden descendente. El resultado es que los tipos más frecuentes aparecen primero en la lista.
sv: Klausulen ``ORDER BY length DESC`` sorterar resultatet efter längd i fallande ordning. Resultatet blir att de mest förekommande typerna står först i listan.
uk: ``ORDER BY length DESC`` сортує результати за довжиною у спадному порядку. В результаті найбільш поширені типи опиняються першими у списку.
