Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/geometries.po
Languages: es, sv

source: **GeometryCollection**, a heterogeneous collection of any geometry (including other collections)
es: **GeometryCollection**, una colección heterogénea de cualquier geometría (incluyendo otras colecciones)
sv: **GeometryCollection**, en heterogen samling av valfri geometri (inklusive andra samlingar)

source: Collections are another concept that shows up in GIS software more than in generic graphics software. They are useful for directly modeling real world objects as spatial objects. For example, how to model a lot that is split by a right-of-way? As a **MultiPolygon**, with a part on either side of the right-of-way.
es: Las colecciones son otro concepto que aparece en el software SIG más que en el software gráfico genérico. Son útiles para modelar directamente objetos del mundo real como objetos espaciales. Por ejemplo, ¿cómo modelar un lote dividido por un derecho de vía? Como un **MultiPolygon**, con una parte a cada lado del derecho de vía.
sv: Samlingar är ett annat koncept som förekommer mer i GIS-program än i generiska grafikprogram. De är användbara för att direkt modellera verkliga objekt som spatiala objekt. Hur kan man till exempel modellera en tomt som delas av en väg? Som en **MultiPolygon**, med en del på vardera sidan om körbanan.

source: Our example collection contains a polygon and a point:
es: Nuestro ejemplo de colección contiene un polígono y un punto:
sv: Vår exempelsamling innehåller en polygon och en punkt:

source: Some of the specific spatial functions for working with collections are:
es: Algunas funciones espaciales específicas para trabajar con colecciones son:
sv: Några av de specifika spatiala funktionerna för att arbeta med samlingar är:

source: :command:`ST_NumGeometries(geometry)` returns the number of parts in the collection
es: :command:`ST_NumGeometries(geometry)` devuelve el número de partes en la colección
sv: :command:`ST_NumGeometries(geometry)` returnerar antalet delar i samlingen

source: :command:`ST_GeometryN(geometry,n)` returns the specified part
es: :command:`ST_GeometryN(geometry,n)` devuelve la parte especificada
sv: :command:`ST_GeometryN(geometry,n)` returnerar den angivna delen

source: :command:`ST_Area(geometry)` returns the total area of all polygonal parts
es: :command:`ST_Area(geometry)` devuelve el área total de todas las partes poligonales
sv: :command:`ST_Area(geometry)` returnerar den totala ytan för alla polygonala delar

source: :command:`ST_Length(geometry)` returns the total length of all linear parts
es: :command:`ST_Length(geometry)` devuelve la longitud total de todas las partes lineales
sv: :command:`ST_Length(geometry)` returnerar den totala längden för alla linjära delar

source: Geometry Input and Output
es: Entrada y salida de geometrías
sv: Inmatning och utmatning av geometri

source: Within the database, geometries are stored on disk in a format only used by the PostGIS program. In order for external programs to insert and retrieve useful geometries, they need to be converted into a format that other applications can understand. Fortunately, PostGIS supports emitting and consuming geometries in a large number of formats:
es: Dentro de la base de datos, las geometrías se almacenan en disco en un formato usado solo por el programa PostGIS. Para que programas externos puedan insertar y recuperar geometrías útiles, deben convertirse a un formato que otras aplicaciones puedan entender. Afortunadamente, PostGIS admite la emisión y consumo de geometrías en muchos formatos:
sv: I databasen lagras geometrierna på disk i ett format som endast används av PostGIS-programmet. För att externa program ska kunna infoga och hämta användbara geometrier måste de konverteras till ett format som andra program kan förstå. Lyckligtvis stöder PostGIS utmatning och konsumtion av geometrier i ett stort antal format:

source: Well-known text (:term:`WKT`)
sv: Välkänd text (:term:`WKT`)

source: :command:`ST_GeomFromText(text, srid)` returns ``geometry``
es: :command:`ST_GeomFromText(text, srid)` devuelve ``geometry``
sv: :command:`ST_GeomFromText(text, srid)` returnerar ``geometry``

source: :command:`ST_AsText(geometry)` returns ``text``
es: :command:`ST_AsText(geometry)` devuelve ``text``
sv: :command:`ST_AsText(geometry)` returnerar ``text``

source: :command:`ST_AsEWKT(geometry)` returns ``text``
es: :command:`ST_AsEWKT(geometry)` devuelve``text``
sv: :command:`ST_AsEWKT(geometry)` returnerar ``text``

source: Well-known binary (:term:`WKB`)
sv: Välkänd binär (:term:`WKB`)

source: :command:`ST_GeomFromWKB(bytea)` returns ``geometry``
es: :command:`ST_GeomFromWKB(bytea)` devuelve ``geometry``
sv: :command:`ST_GeomFromWKB(bytea)` returnerar ``geometry``

source: :command:`ST_AsBinary(geometry)` returns ``bytea``
es: :command:`ST_AsBinary(geometry)` devuelve ``bytea``
sv: :command:`ST_AsBinary(geometry)` returnerar ``bytea``

source: :command:`ST_AsEWKB(geometry)` returns ``bytea``
es: :command:`ST_AsEWKB(geometry)` devuelve ``bytea``
sv: :command:`ST_AsEWKB(geometry)` returnerar ``bytea``

source: :command:`ST_GeomFromGML(text)` returns ``geometry``
es: :command:`ST_GeomFromGML(text)` devuelve ``geometry``
sv: :command:`ST_GeomFromGML(text)` returnerar ``geometry``

source: :command:`ST_AsGML(geometry)` returns ``text``
es: :command:`ST_AsGML(geometry)` devuelve ``text``
sv: :command:`ST_AsGML(geometry)` returnerar ``text``

source: :command:`ST_GeomFromKML(text)` returns ``geometry``
es: :command:`ST_GeomFromKML(text)` devuelve ``geometry``
sv: :command:`ST_GeomFromKML(text)` returnerar ``geometry``

source: :command:`ST_AsKML(geometry)` returns ``text``
es: :command:`ST_AsKML(geometry)` devuelve ``text``
sv: :command:`ST_AsKML(geometry)` returnerar ``text``

source: :command:`ST_AsGeoJSON(geometry)` returns ``text``
es: :command:`ST_AsGeoJSON(geometry)` devuelve ``text``
sv: :command:`ST_AsGeoJSON(geometry)` returnerar ``text``

source: Scalable Vector Graphics (:term:`SVG`)
sv: Skalbar vektorgrafik (:term:`SVG`)

source: :command:`ST_AsSVG(geometry)` returns ``text``
es: :command:`ST_AsSVG(geometry)` devuelve ``text``
sv: :command:`ST_AsSVG(geometry)` returnerar ``text``

source: The most common use of a constructor is to turn a text representation of a geometry into an internal representation:
es: El uso más común de un constructor es convertir una representación en texto de una geometría en una representación interna:
sv: Den vanligaste användningen av en konstruktor är att omvandla en textrepresentation av en geometri till en intern representation:

source: Note that in addition to a text parameter with a geometry representation, we also have a numeric parameter providing the :term:`SRID` of the geometry.
es: Además del parámetro de texto con la representación de la geometría, también hay un parámetro numérico que provee el :term:`SRID` de la geometría.
sv: Observera att vi förutom en textparameter med en geometrisk representation också har en numerisk parameter som anger geometrins :term:`SRID`.

source: The following SQL query shows an example of :term:`WKB` representation (the call to :command:`encode()` is required to convert the binary output into an ASCII form for printing):
es: La siguiente consulta SQL muestra un ejemplo de representación en WKB (la llamada a encode() es necesaria para convertir la salida binaria en una forma ASCII para impresión):
sv: Följande SQL-fråga visar ett exempel på :term:`WKB`-representation (anropet till :command:`encode()` krävs för att konvertera den binära utdata till en ASCII-form för utskrift):

source: For the purposes of this workshop we will continue to use WKT to ensure you can read and understand the geometries we're viewing. However, most actual processes, such as viewing data in a GIS application, transferring data to a web service, or processing data remotely, WKB is the format of choice.
es: Para efectos de este taller continuaremos usando WKT para asegurar que se puedan leer y entender las geometrías que estamos viendo. Sin embargo, en la mayoría de procesos reales, como ver datos en una aplicación SIG, transferir datos a un servicio web o procesar datos remotamente, WKB es el formato preferido.
sv: I den här workshopen kommer vi att fortsätta använda WKT för att säkerställa att du kan läsa och förstå de geometrier vi tittar på. Men för de flesta faktiska processer, t.ex. visning av data i en GIS-applikation, överföring av data till en webbtjänst eller bearbetning av data på distans, är WKB det format som ska väljas.

source: Since WKT and WKB were defined in the :term:`SFSQL` specification, they do not handle 3- or 4-dimensional geometries. For these cases PostGIS has defined the Extended Well Known Text (EWKT) and Extended Well Known Binary (EWKB) formats. These provide the same formatting capabilities of WKT and WKB with the added dimensionality.
es: Dado que WKT y WKB fueron definidos en la especificación SFSQL, no manejan geometrías en 3 o 4 dimensiones. Para estos casos, PostGIS ha definido los formatos Extended Well Known Text (EWKT) y Extended Well Known Binary (EWKB). Estos proveen las mismas capacidades de formato de WKT y WKB con la dimensionalidad añadida.
sv: Eftersom WKT och WKB definierades i :term:`SFSQL`-specifikationen hanterar de inte 3- eller 4-dimensionella geometrier. För dessa fall har PostGIS definierat formaten Extended Well Known Text (EWKT) och Extended Well Known Binary (EWKB). Dessa ger samma formateringsmöjligheter som WKT och WKB med den extra dimensionaliteten.

source: Here is an example of a 3D linestring in WKT:
es: Aquí un ejemplo de una linestring 3D en WKT:
sv: Här är ett exempel på en 3D-linjestring i WKT:

source: Note that the text representation changes! This is because the text input routine for PostGIS is liberal in what it consumes. It will consume
es: Observa que la representación en texto cambia. Esto se debe a que la rutina de entrada de texto de PostGIS es flexible en lo que consume. Él consumirá
sv: Observera att textrepresentationen ändras! Detta beror på att textinmatningsrutinen för PostGIS är liberal i vad den konsumerar. Den kommer att konsumera

source: hex-encoded EWKB,
es: EWKB en hexadecimal
sv: hex-kodad EWKB,

source: extended well-known text, and
es: extended well-known text, y
sv: utökad välkänd text, och

source: ISO standard well-known text.
es: well-known text según el estándar ISO.
sv: ISO-standard välkänd text.

source: On the output side, the :command:`ST_AsText` function is conservative, and only emits ISO standard well-known text.
es: En la salida, la función ST_AsText es conservadora y solo genera texto estándar well-known ISO.
sv: På utdatasidan är funktionen :command:`ST_AsText` konservativ och ger bara ut välkänd text enligt ISO-standard.

source: In addition to the :command:`ST_GeometryFromText` function, there are many other ways to create geometries from well-known text or similar formatted inputs:
es: Además de la función ST_GeometryFromText, existen muchas otras formas de crear geometrías a partir de texto well-known o entradas con formatos similares:
sv: Förutom funktionen :command:`ST_GeometryFromText` finns det många andra sätt att skapa geometrier från välkänd text eller liknande formaterade indata:

source: In addition to emitters for the various forms (WKT, WKB, GML, KML, JSON, SVG), PostGIS also has consumers for four (WKT, WKB, GML, KML). Most applications use the WKT or WKB geometry creation functions, but the others work too. Here's an example that consumes GML and output JSON:
es: Además de los emisores para los distintos formatos (WKT, WKB, GML, KML, JSON, SVG), PostGIS también tiene consumidores para cuatro de ellos (WKT, WKB, GML, KML). La mayoría de aplicaciones usan las funciones de creación de geometrías WKT o WKB, pero las otras también funcionan. Aquí un ejemplo que consume GML y produce JSON:
sv: Förutom emitters för de olika formerna (WKT, WKB, GML, KML, JSON, SVG) har PostGIS också consumers för fyra (WKT, WKB, GML, KML). De flesta applikationer använder WKT- eller WKB-funktionerna för geometrisk skapande, men de andra fungerar också. Här är ett exempel som konsumerar GML och matar ut JSON:

source: Casting from Text
es: Conversión desde texto
sv: Casting från text

source: The :term:`WKT` strings we've see so far have been of type 'text' and we have been converting them to type 'geometry' using PostGIS functions like :command:`ST_GeomFromText()`.
es: Las cadenas :term:`WKT` que hemos visto hasta ahora han sido de tipo 'text' y las hemos convertido al tipo 'geometry' usando funciones de PostGIS como :command:`ST_GeomFromText()`.
sv: De :term:`WKT`-strängar vi har sett hittills har varit av typen 'text' och vi har konverterat dem till typen 'geometri' med hjälp av PostGIS-funktioner som :command:`ST_GeomFromText()`.

source: PostgreSQL includes a short form syntax that allows data to be converted from one type to another, the casting syntax, `oldata::newtype`. So for example, this SQL converts a double into a text string.
es: PostgreSQL incluye una sintaxis abreviada que permite convertir datos de un tipo a otro, la sintaxis de casting, `oldata::newtype`. Por ejemplo, este SQL convierte un doble en una cadena de texto.
sv: PostgreSQL innehåller en kortformssyntax som gör att data kan konverteras från en typ till en annan, casting-syntaxen, `oldata:: newtype`. Så till exempel konverterar denna SQL en dubbel till en textsträng.

source: Less trivially, this SQL converts a :term:`WKT` string into a geometry:
es: Menos trivial, este SQL convierte una cadena :term:`WKT` en una geometría:
sv: Mindre trivialt konverterar denna SQL en :term:`WKT`-sträng till en geometri:

source: One thing to note about using casting to create geometries: unless you specify the SRID, you will get a geometry with an unknown SRID. You can specify the SRID using the "extended" well-known text form, which includes an SRID block at the front:
es: Una cosa a tener en cuenta al usar casting para crear geometrías: a menos que especifiques el SRID, obtendrás una geometría con un SRID desconocido. Puedes especificar el SRID usando la forma "extendida" de well-known text, que incluye un bloque SRID al inicio:
sv: En sak att notera om att använda casting för att skapa geometrier: om du inte anger SRID får du en geometri med okänd SRID. Du kan ange SRID med hjälp av det "utökade" välkända textformuläret, som innehåller ett SRID-block längst fram:

source: It's very common to use the casting notation when working with :term:`WKT`, as well as `geometry` and `geography` columns (see :ref:`geography`).
es: Es muy común usar la notación de casting cuando se trabaja con :term:`WKT`, así como con columnas `geometry` y `geography` (ver :ref:`geography`).
sv: Det är mycket vanligt att använda casting-notationen när man arbetar med :term:`WKT`, samt kolumnerna `geometry` och `geography` (se :ref:`geography`).

source: Function List
es: Lista de funciones
sv: Funktionslista

source: `ST_Area <http://postgis.net/docs/ST_Area.html>`_: Returns the area of the surface if it is a polygon or multi-polygon. For "geometry" type area is in SRID units. For "geography" area is in square meters.
es: `ST_Area <http://postgis.net/docs/ST_Area.html>`_: Devuelve el área de la superficie si es un polígono o multipolígono. Para el tipo "geometry" el área está en unidades del SRID. Para "geography" el área está en metros cuadrados.
sv: `ST_Area <http://postgis.net/docs/ST_Area.html>`_: Returnerar ytans area om det är en polygon eller multipolygon. För typen "geometry" är arean i SRID-enheter. För "geography" är arean i kvadratmeter.

source: `ST_AsText <http://postgis.net/docs/ST_AsText.html>`_: Returns the Well-Known Text (WKT) representation of the geometry/geography without SRID metadata.
es: `ST_AsText <http://postgis.net/docs/ST_AsText.html>`_: Devuelve la representación Well-Known Text (WKT) de la geometría/geografía sin metadatos SRID.
sv: `ST_AsText <http://postgis.net/docs/ST_AsText.html>`_: Returnerar WKT-representationen (Well-Known Text) av geometrin/geografin utan SRID-metadata.

source: `ST_AsBinary <http://postgis.net/docs/ST_AsBinary.html>`_: Returns the Well-Known Binary (WKB) representation of the geometry/geography without SRID meta data.
es: `ST_AsBinary <http://postgis.net/docs/ST_AsBinary.html>`_: Devuelve la representación Well-Known Binary (WKB) de la geometría/geografía sin metadatos SRID.
sv: `ST_AsBinary <http://postgis.net/docs/ST_AsBinary.html>`_: Returnerar WKB-representationen (Well-Known Binary) av geometrin/geografin utan SRID-metadata.

source: `ST_EndPoint <http://postgis.net/docs/ST_EndPoint.html>`_: Returns the last point of a LINESTRING geometry as a POINT.
es: `ST_EndPoint <http://postgis.net/docs/ST_EndPoint.html>`_: Devuelve el último punto de una geometría LINESTRING como un POINT.
sv: `ST_EndPoint <http://postgis.net/docs/ST_EndPoint.html>`_: Returnerar den sista punkten i en LINESTRING-geometri som en POINT.

source: `ST_AsEWKB <http://postgis.net/docs/ST_AsEWKB.html>`_: Returns the Well-Known Binary (WKB) representation of the geometry with SRID meta data.
es: `ST_AsEWKB <http://postgis.net/docs/ST_AsEWKB.html>`_: Devuelve la representación Well-Known Binary (WKB) de la geometría con metadatos SRID.
sv: `ST_AsEWKB <http://postgis.net/docs/ST_AsEWKB.html>`_: Returnerar WKB-representationen (Well-Known Binary) av geometrin med SRID-metadata.

source: `ST_AsEWKT <http://postgis.net/docs/ST_AsEWKT.html>`_: Returns the Well-Known Text (WKT) representation of the geometry with SRID meta data.
es: `ST_AsEWKT <http://postgis.net/docs/ST_AsEWKT.html>`_: Devuelve la representación Well-Known Text (WKT) de la geometría con metadatos SRID.
sv: `ST_AsEWKT <http://postgis.net/docs/ST_AsEWKT.html>`_: Returnerar WKT-representationen (Well-Known Text) av geometrin med SRID-metadata.

source: `ST_AsGeoJSON <http://postgis.net/docs/ST_AsGeoJSON.html>`_: Returns the geometry as a GeoJSON element.
es: `ST_AsGeoJSON <http://postgis.net/docs/ST_AsGeoJSON.html>`_: Devuelve la geometría como un elemento GeoJSON.
sv: `ST_AsGeoJSON <http://postgis.net/docs/ST_AsGeoJSON.html>`_: Returnerar geometrin som ett GeoJSON-element.

source: `ST_AsGML <http://postgis.net/docs/ST_AsGML.html>`_: Returns the geometry as a GML version 2 or 3 element.
es: `ST_AsGML <http://postgis.net/docs/ST_AsGML.html>`_: Devuelve la geometría como un elemento GML versión 2 o 3.
sv: `ST_AsGML <http://postgis.net/docs/ST_AsGML.html>`_: Returnerar geometrin som ett GML version 2 eller 3 element.

source: `ST_AsKML <http://postgis.net/docs/ST_AsKML.html>`_: Returns the geometry as a KML element. Several variants. Default version=2, default precision=15.
es: `ST_AsKML <http://postgis.net/docs/ST_AsKML.html>`_: Devuelve la geometría como un elemento KML. Varias variantes. Versión predeterminada=2, precisión predeterminada=15.
sv: `ST_AsKML <http://postgis.net/docs/ST_AsKML.html>`_: Returnerar geometrin som ett KML-element. Flera varianter. Standardversion=2, standardprecision=15.

source: `ST_AsSVG <http://postgis.net/docs/ST_AsSVG.html>`_: Returns a Geometry in SVG path data given a geometry or geography object.
es: `ST_AsSVG <http://postgis.net/docs/ST_AsSVG.html>`_: Devuelve una geometría en datos de ruta SVG dada una geometría u objeto geográfico.
sv: `ST_AsSVG <http://postgis.net/docs/ST_AsSVG.html>`_: Returnerar en geometri i SVG-sökvägsdata givet ett geometri- eller geografiobjekt.

source: `ST_ExteriorRing <http://postgis.net/docs/ST_ExteriorRing.html>`_: Returns a line string representing the exterior ring of the POLYGON geometry. Return NULL if the geometry is not a polygon. Will not work with MULTIPOLYGON
es: `ST_ExteriorRing <http://postgis.net/docs/ST_ExteriorRing.html>`_: Devuelve una línea que representa el anillo exterior de la geometría POLYGON. Devuelve NULL si la geometría no es un polígono. No funciona con MULTIPOLYGON
sv: `ST_ExteriorRing <http://postgis.net/docs/ST_ExteriorRing.html>`_: Returnerar en radsträng som representerar den yttre ringen i POLYGON-geometrin. Returnerar NULL om geometrin inte är en polygon. Fungerar inte med MULTIPOLYGON

source: `ST_GeometryN <http://postgis.net/docs/ST_GeometryN.html>`_: Returns the 1-based Nth geometry if the geometry is a GEOMETRYCOLLECTION, MULTIPOINT, MULTILINESTRING, MULTICURVE or MULTIPOLYGON. Otherwise, return NULL.
es: `ST_GeometryN <http://postgis.net/docs/ST_GeometryN.html>`_: Devuelve la geometría N-ésima (1-based) si la geometría es GEOMETRYCOLLECTION, MULTIPOINT, MULTILINESTRING, MULTICURVE o MULTIPOLYGON. De lo contrario, devuelve NULL.
sv: `ST_GeometryN <http://postgis.net/docs/ST_GeometryN.html>`_: Returnerar den 1-baserade N:te geometrin om geometrin är en GEOMETRYCOLLECTION, MULTIPOINT, MULTILINESTRING, MULTICURVE eller MULTIPOLYGON. I annat fall returneras NULL.

source: `ST_GeomFromGML <http://postgis.net/docs/ST_GeomFromGML.html>`_: Takes as input GML representation of geometry and outputs a PostGIS geometry object.
es: `ST_GeomFromGML <http://postgis.net/docs/ST_GeomFromGML.html>`_: Toma como entrada una representación GML de geometría y produce un objeto de geometría PostGIS.
sv: `ST_GeomFromGML <http://postgis.net/docs/ST_GeomFromGML.html>`_: Tar som indata GML-representation av geometri och matar ut ett PostGIS-geometriobjekt.

source: `ST_GeomFromKML <http://postgis.net/docs/ST_GeomFromKML.html>`_: Takes as input KML representation of geometry and outputs a PostGIS geometry object
es: `ST_GeomFromKML <http://postgis.net/docs/ST_GeomFromKML.html>`_: Toma como entrada una representación KML de geometría y produce un objeto de geometría PostGIS
sv: `ST_GeomFromKML <http://postgis.net/docs/ST_GeomFromKML.html>`_: Tar som indata KML-representation av geometri och matar ut ett PostGIS-geometriobjekt

source: `ST_GeomFromText <http://postgis.net/docs/ST_GeomFromText.html>`_: Returns a specified ST_Geometry value from Well-Known Text representation (WKT).
es: `ST_GeomFromText <http://postgis.net/docs/ST_GeomFromText.html>`_: Devuelve un valor ST_Geometry especificado a partir de una representación Well-Known Text (WKT).
sv: `ST_GeomFromText <http://postgis.net/docs/ST_GeomFromText.html>`_: Returnerar ett specificerat ST_Geometry-värde från Well-Known Text representation (WKT).

source: `ST_GeomFromWKB <http://postgis.net/docs/ST_GeomFromWKB.html>`_: Creates a geometry instance from a Well-Known Binary geometry representation (WKB) and optional SRID.
es: `ST_GeomFromWKB <http://postgis.net/docs/ST_GeomFromWKB.html>`_: Crea una instancia de geometría a partir de una representación Well-Known Binary (WKB) y un SRID opcional.
sv: `ST_GeomFromWKB <http://postgis.net/docs/ST_GeomFromWKB.html>`_: Skapar en geometriinstans från en Well-Known Binary geometrirepresentation (WKB) och valfri SRID.

source: `ST_GeometryType <http://postgis.net/docs/ST_GeometryType.html>`_: Returns the geometry type of the ST_Geometry value.
es: `ST_GeometryType <http://postgis.net/docs/ST_GeometryType.html>`_: Devuelve el tipo de geometría del valor ST_Geometry.
sv: `ST_GeometryType <http://postgis.net/docs/ST_GeometryType.html>`_: Returnerar geometritypen för ST_Geometry-värdet.

source: `ST_InteriorRingN <http://postgis.net/docs/ST_InteriorRingN.html>`_: Returns the Nth interior linestring ring of the polygon geometry. Return NULL if the geometry is not a polygon or the given N is out of range.
es: `ST_InteriorRingN <http://postgis.net/docs/ST_InteriorRingN.html>`_: Devuelve el N-ésimo anillo interior (linestring) de la geometría poligonal. Devuelve NULL si la geometría no es un polígono o si N está fuera de rango.
sv: `ST_InteriorRingN <http://postgis.net/docs/ST_InteriorRingN.html>`_: Returnerar den N:te inre linjära ringen i polygongeometrin. Returnerar NULL om geometrin inte är en polygon eller om det angivna N ligger utanför intervallet.
