Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/geometries.po
Languages: es, sv

source: `ST_Length <http://postgis.net/docs/ST_Length.html>`_: Returns the 2d length of the geometry if it is a linestring or multilinestring. geometry are in units of spatial reference and geography are in meters (default spheroid)
es: `ST_Length <http://postgis.net/docs/ST_Length.html>`_: Devuelve la longitud 2D de la geometría si es una línea o multilínea. Para geometry está en unidades de la referencia espacial y para geography está en metros (esferoide predeterminado)
sv: `ST_Length <http://postgis.net/docs/ST_Length.html>`_: Returnerar geometrins 2d-längd om den är en linjesträng eller multilinjesträng. geometri är i enheter för spatial referens och geografi är i meter (standard sfäroid)

source: `ST_NDims <http://postgis.net/docs/ST_NDims.html>`_: Returns coordinate dimension of the geometry as a small int. Values are: 2,3 or 4.
es: `ST_NDims <http://postgis.net/docs/ST_NDims.html>`_: Devuelve la dimensión de coordenadas de la geometría como un entero pequeño. Los valores son: 2, 3 o 4.
sv: `ST_NDims <http://postgis.net/docs/ST_NDims.html>`_: Returnerar geometrins koordinatdimension som ett litet int. Värdena är: 2,3 eller 4.

source: `ST_NPoints <http://postgis.net/docs/ST_NPoints.html>`_: Returns the number of points (vertexes) in a geometry.
es: `ST_NPoints <http://postgis.net/docs/ST_NPoints.html>`_: Devuelve el número de puntos (vértices) en una geometría.
sv: `ST_NPoints <http://postgis.net/docs/ST_NPoints.html>`_: Returnerar antalet punkter (vertexer) i en geometri.

source: `ST_NRings <http://postgis.net/docs/ST_NRings.html>`_: If the geometry is a polygon or multi-polygon returns the number of rings.
es: `ST_NRings <http://postgis.net/docs/ST_NRings.html>`_: Si la geometría es un polígono o multipolígono devuelve el número de anillos.
sv: `ST_NRings <http://postgis.net/docs/ST_NRings.html>`_: Om geometrin är en polygon eller multipolygon returneras antalet ringar.

source: `ST_NumGeometries <http://postgis.net/docs/ST_NumGeometries.html>`_: If geometry is a GEOMETRYCOLLECTION (or MULTI*) returns the number of geometries, otherwise return NULL.
es: `ST_NumGeometries <http://postgis.net/docs/ST_NumGeometries.html>`_: Si la geometría es una GEOMETRYCOLLECTION (o MULTI*) devuelve el número de geometrías, de lo contrario devuelve NULL.
sv: `ST_NumGeometries <http://postgis.net/docs/ST_NumGeometries.html>`_: Om geometrin är en GEOMETRYCOLLECTION (eller MULTI*) returneras antalet geometrier, annars returneras NULL.

source: `ST_Perimeter <http://postgis.net/docs/ST_Perimeter.html>`_: Returns the length measurement of the boundary of an ST_Surface or ST_MultiSurface value. (Polygon, Multipolygon)
es: `ST_Perimeter <http://postgis.net/docs/ST_Perimeter.html>`_: Devuelve la medida de longitud del límite de un valor ST_Surface o ST_MultiSurface (Polygon, Multipolygon)
sv: `ST_Perimeter <http://postgis.net/docs/ST_Perimeter.html>`_: Returnerar längdmätningen av gränsen för ett ST_Surface- eller ST_MultiSurface-värde. (Polygon, Multipolygon)

source: `ST_SRID <http://postgis.net/docs/ST_SRID.html>`_: Returns the spatial reference identifier for the ST_Geometry as defined in spatial_ref_sys table.
es: `ST_SRID <http://postgis.net/docs/ST_SRID.html>`_: Devuelve el identificador de referencia espacial para la ST_Geometry como se define en la tabla spatial_ref_sys.
sv: `ST_SRID <http://postgis.net/docs/ST_SRID.html>`_: Returnerar den spatiala referensidentifieraren för ST_Geometry enligt definitionen i tabellen spatial_ref_sys.

source: `ST_StartPoint <http://postgis.net/docs/ST_StartPoint.html>`_: Returns the first point of a LINESTRING geometry as a POINT.
es: `ST_StartPoint <http://postgis.net/docs/ST_StartPoint.html>`_: Devuelve el primer punto de una geometría LINESTRING como un POINT.
sv: `ST_StartPoint <http://postgis.net/docs/ST_StartPoint.html>`_: Returnerar den första punkten i en LINESTRING-geometri som en POINT.

source: `ST_X <http://postgis.net/docs/ST_X.html>`_: Returns the X coordinate of the point, or NULL if not available. Input must be a point.
es: `ST_X <http://postgis.net/docs/ST_X.html>`_: Devuelve la coordenada X del punto, o NULL si no está disponible. La entrada debe ser un punto.
sv: `ST_X <http://postgis.net/docs/ST_X.html>`_: Returnerar X-koordinaten för punkten, eller NULL om den inte är tillgänglig. Indata måste vara en punkt.

source: `ST_Y <http://postgis.net/docs/ST_Y.html>`_: Returns the Y coordinate of the point, or NULL if not available. Input must be a point.
es: `ST_Y <http://postgis.net/docs/ST_Y.html>`_: Devuelve la coordenada Y del punto, o NULL si no está disponible. La entrada debe ser un punto.
sv: `ST_Y <http://postgis.net/docs/ST_Y.html>`_: Returnerar punktens Y-koordinat, eller NULL om den inte är tillgänglig. Indata måste vara en punkt.
