Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/geometry_returning_exercises.po
Languages: es, sv

source: Geometry Constructing Exercises
es: Ejercicios de Construcción de Geometrías
sv: Övningar för geometrikonstruktion

source: Here's a reminder of some of the functions we have seen. Hint: they should be useful for the exercises!
es: Aquí tienes un recordatorio de algunas de las funciones que hemos visto. Pista: ¡serán útiles para los ejercicios!
sv: Här är en påminnelse om några av de funktioner vi har sett. Tips: de bör vara användbara för övningarna!

source: :command:`sum(expression)` aggregate to return a sum for a set of records
es: :command:`sum(expresión)` función de agregación para devolver una suma de un conjunto de registros
sv: :command:`sum(expression)` aggregat för att returnera en summa för en uppsättning poster

source: :command:`ST_Area(geometry)` returns the area of the geometry
es: :command:`ST_Area(geometry)` devuelve el área de la geometría
sv: :command:`ST_Area(geometry)` returnerar geometrins area

source: :command:`ST_Centroid(geometry)` returns the ``geometry`` centroid
es: :command:`ST_Centroid(geometry)` devuelve el centroide de la ``geometry``
sv: :command:`ST_Centroid(geometry)` returnerar ``geometrins`` centroid

source: :command:`ST_Transform(geometry, srid)` converts ``geometries`` into different spatial reference systems
es: :comando:`ST_Transform(geometría, srid)` convierte ``geometrías`` en diferentes sistemas de referencia espacial.
sv: :command:`ST_Transform(geometry, srid)` konverterar ``geometrier`` till olika spatiala referenssystem

source: :command:`ST_Buffer(geometry, radius)` returns an expanded ``geometry`` shape
es: :command:`ST_Buffer(geometry, radius)` devuelve una forma de ``geometry`` expandida
sv: :command:`ST_Buffer(geometry, radius)` returnerar en utökad ``geometri``-form

source: :command:`ST_Contains(geometry1, geometry2)` returns truw if geometry1 contains geometry2
es: :command:`ST_Contains(geometry1, geometry2)` devuelve verdadero si geometry1 contiene a geometry2
sv: :command:`ST_Contains(geometry1, geometry2)` returnerar truw om geometry1 innehåller geometry2

source: :command:`ST_Union(geometry[])` returns the aggregate union of all geometries in the group
es: :command:`ST_Union(geometry[])` devuelve la unión agregada de todas las geometrías en el grupo
sv: :command:`ST_Union(geometry[])` returnerar den aggregerade unionen av alla geometrier i gruppen

source: :command:`ST_GeometryType(geometry)` returns the type of the geometry
es: :command:`ST_GeometryType(geometry)` devuelve el tipo de geometría
sv: :command:`ST_GeometryType(geometry)` returnerar typen av geometri

source: :command:`ST_NumGeometries(geometry)` returns the number of geometries in a collection or 1 for simple geometries
es: :command:`ST_NumGeometries(geometry)` devuelve el número de geometrías en una colección o 1 para geometrías simples
sv: :command:`ST_NumGeometries(geometry)` returnerar antalet geometrier i en samling eller 1 för enkla geometrier

source: :command:`ST_Intersection(geometry, geometry)` returns the area that the two input geometries share in common
es: :command:`ST_Intersection(geometry, geometry)` devuelve el área que las dos geometrías de entrada comparten en común
sv: :command:`ST_Intersection(geometry, geometry)` returnerar den yta som de två inmatade geometrierna har gemensamt

source: Remember the tables we have available:
es: Recuerda las tablas que tenemos disponibles:
sv: Kom ihåg de tabeller vi har tillgängliga:

source: Exercises
es: Ejercicios
sv: Övningar

source: **How many census blocks don’t contain their own centroid?**
es: **¿Cuántos bloques censales no contienen su propio centroide?**
sv: **Hur många folkbokföringsblock innehåller inte sin egen centroid?**

source: **Union all the census blocks into a single output. What kind of geometry is it? How many parts does it have?**
es: **Une todos los bloques censales en una sola salida. ¿Qué tipo de geometría es? ¿Cuántas partes tiene?**
sv: **Sammanfoga alla folkbokföringsblock till en enda utgång. Vilken typ av geometri är det? Hur många delar har den?**

source: **What is the area of a one unit buffer around the origin? How different is it from what you would expect? Why?**
es: **¿Cuál es el área de un buffer de una unidad alrededor del origen? ¿Qué tan diferente es de lo que esperarías? ¿Por qué?**
sv: **Vad är arean av en buffert på en enhet runt origo? Hur mycket skiljer den sig från vad du skulle förvänta dig? Varför?**

source: A unit circle (circle with radius of one) should have an area of pi, 3.1415926... The difference is due to the linear stroking of the edges of the buffer. The buffer has a finite number of edges. Increasing the number of edges in the buffer will get the value closer to pi, but it will always be smaller due to the linearization.
es: Un círculo unitario (círculo con radio de uno) debería tener un área de pi, 3.1415926... La diferencia se debe al trazado lineal de los bordes del buffer. El buffer tiene un número finito de bordes. Aumentar el número de bordes en el buffer hará que el valor se acerque a pi, pero siempre será menor debido a la linearización.
sv: En enhetscirkel (cirkel med radien ett) bör ha en area av pi, 3,1415926... Skillnaden beror på den linjära strykningen av buffertens kanter. Bufferten har ett ändligt antal kanter. Om man ökar antalet kanter i bufferten kommer värdet att närma sig pi, men det kommer alltid att vara mindre på grund av linjäriseringen.

source: **The Brooklyn neighborhoods of ‘Park Slope’ and ‘Carroll Gardens’ are going to war! Construct a polygon delineating a 100 meter wide DMZ on the border between the neighborhoods. What is the area of the DMZ?**
es: **¡Los vecindarios de Brooklyn ‘Park Slope’ y ‘Carroll Gardens’ van a la guerra! Construye un polígono que delimite una DMZ de 100 metros de ancho en la frontera entre los vecindarios. ¿Cuál es el área de la DMZ?**
sv: **Brooklynstadsdelarna "Park Slope" och "Carroll Gardens" går ut i krig! Konstruera en polygon som avgränsar en 100 meter bred DMZ på gränsen mellan stadsdelarna. Vad är DMZ:s area?**

source: It is easy to buffer both the neighborhoods of interest, but to get the intersection requires a self-join of the table, creating one relation (``ps``) with just the "Park Slope" record and another (``cg``) with just the "Carroll Gardens" record. Note that the area of the intersection is in square meters because we are still working in UTM 18 (EPSG:26918).
es: Es fácil crear un buffer de ambos vecindarios de interés, pero para obtener la intersección se requiere un self-join de la tabla, creando una relación (``ps``) con solo el registro de "Park Slope" y otra (``cg``) con solo el registro de "Carroll Gardens". Observa que el área de la intersección está en metros cuadrados porque todavía estamos trabajando en UTM 18 (EPSG:26918).
sv: Det är lätt att buffra båda de intressanta stadsdelarna, men för att få fram skärningspunkten krävs en self-join av tabellen, vilket skapar en relation (``ps``) med bara "Park Slope"-posten och en annan (``cg``) med bara "Carroll Gardens"-posten. Observera att skärningspunktens yta är i kvadratmeter eftersom vi fortfarande arbetar i UTM 18 (EPSG:26918).
