Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/geometries.po
Languages: es, sv

source: Geometries
es: Geometrías
sv: Geometrier

source: Introduction
es: Introducción
sv: Introduktion

source: In the previous :ref:`section <loading_data>`, we loaded a variety of data. Before we start playing with our data lets have a look at some simpler examples. In pgAdmin, once again select the **nyc** database and open the SQL query tool. Paste this example SQL code into the pgAdmin SQL Editor window (removing any text that may be there by default) and then execute.
es: En la sección anterior, cargamos una variedad de datos. Antes de comenzar a trabajar con ellos, veamos algunos ejemplos más simples. En pgAdmin, selecciona nuevamente la base de datos nyc y abre la herramienta de consultas SQL. Pega este código de ejemplo en el editor SQL de pgAdmin (eliminando cualquier texto que haya allí) y ejecútalo.
sv: I föregående :ref:`avsnitt <loading_data>` laddade vi en mängd olika data. Innan vi börjar leka med våra data kan vi ta en titt på några enklare exempel. I pgAdmin väljer du återigen databasen **nyc** och öppnar SQL-frågeverktyget. Klistra in detta exempel på SQL-kod i pgAdmins SQL Editor-fönster (ta bort all text som kan finnas där som standard) och kör sedan.

source: The above example CREATEs a table (**geometries**) then INSERTs five geometries: a point, a line, a polygon, a polygon with a hole, and a collection. Finally, the inserted rows are SELECTed and displayed in the Output pane.
es: El ejemplo anterior crea una tabla (geometries) y luego inserta cinco geometrías: un punto, una línea, un polígono, un polígono con un agujero y una colección. Finalmente, las filas insertadas se seleccionan y se muestran en el panel de salida.
sv: Exemplet ovan CREATE:ar en tabell (**geometries**) och INSERT:ar sedan fem geometrier: en punkt, en linje, en polygon, en polygon med ett hål och en samling. Slutligen SELECTAS de infogade raderna och visas i fönstret Output.

source: Metadata Tables
es: Tablas de metadatos
sv: Metadatatabeller

source: In conformance with the Simple Features for SQL (:term:`SFSQL`) specification, PostGIS provides two tables to track and report on the geometry types available in a given database.
es: De acuerdo con la especificación Simple Features for SQL (SFSQL), PostGIS proporciona dos tablas para rastrear e informar sobre los tipos de geometría disponibles en una base de datos determinada.
sv: I enlighet med specifikationen Simple Features for SQL (:term:`SFSQL`) tillhandahåller PostGIS två tabeller för att spåra och rapportera om de geometrityper som finns tillgängliga i en viss databas.

source: The first table, ``spatial_ref_sys``, defines all the spatial reference systems known to the database and will be described in greater detail later.
es: La primera tabla, spatial_ref_sys, define todos los sistemas de referencia espacial conocidos por la base de datos (se explicará con más detalle más adelante).
sv: Den första tabellen, ``spatial_ref_sys``, definierar alla spatiala referenssystem som är kända för databasen och kommer att beskrivas mer i detalj senare.

source: The second table (actually, a view), ``geometry_columns``, provides a listing of all "features" (defined as an object with geometric attributes), and the basic details of those features.
es: La segunda tabla (en realidad, una vista), geometry_columns, proporciona una lista de todas las "features" (objetos con atributos geométricos) y los detalles básicos de esas entidades.
sv: Den andra tabellen (egentligen en vy), ``geometry_columns``, innehåller en lista över alla "features" (definierade som ett objekt med geometriska attribut) och de grundläggande detaljerna för dessa features.

source: Let's have a look at the ``geometry_columns`` table in our database. Paste this command in the Query Tool as before:
es: Veamos la tabla geometry_columns en nuestra base de datos. Pega este comando en la herramienta de consultas como antes:
sv: Låt oss ta en titt på tabellen ``geometry_columns`` i vår databas. Klistra in det här kommandot i Query Tool som tidigare:

source: ``f_table_catalog``, ``f_table_schema``, and ``f_table_name`` provide the fully qualified name of the feature table containing a given geometry. Because PostgreSQL doesn't make use of catalogs, ``f_table_catalog`` will tend to be empty.
es: f_table_catalog, f_table_schema y f_table_name proveen el nombre completo de la tabla de entidades que contiene una geometría. Dado que PostgreSQL no usa catálogos, f_table_catalog suele estar vacío.
sv: ``f_table_catalog``, ``f_table_schema`` och ``f_table_name`` ger det fullständigt kvalificerade namnet på funktionstabellen som innehåller en given geometri. Eftersom PostgreSQL inte använder kataloger tenderar ``f_table_catalog`` att vara tom.

source: ``f_geometry_column`` is the name of the column that geometry containing column -- for feature tables with multiple geometry columns, there will be one record for each.
es: f_geometry_column es el nombre de la columna que contiene la geometría. En tablas con múltiples columnas geométricas, habrá un registro por cada una.
sv: ``f_geometry_column`` är namnet på den kolumn som innehåller geometri - för funktionstabeller med flera geometrikolumner kommer det att finnas en post för varje.

source: ``coord_dimension`` and ``srid`` define the the dimension of the geometry (2-, 3- or 4-dimensional) and the Spatial Reference system identifier that refers to the ``spatial_ref_sys`` table respectively.
es: coord_dimension y srid definen, respectivamente, la dimensión de la geometría (2, 3 o 4 dimensiones) y el identificador del sistema de referencia espacial que remite a la tabla spatial_ref_sys.
sv: ``coord_dimension`` och ``srid`` definierar geometrins dimension (2-, 3- eller 4-dimensionell) respektive identifieraren för det spatiala referenssystemet som hänvisar till tabellen ``spatial_ref_sys``.

source: The ``type`` column defines the type of geometry as described below; we've seen Point and Linestring types so far.
es: La columna type define el tipo de geometría. Hemos visto hasta ahora Point y Linestring.
sv: Kolumnen ``type`` definierar typen av geometri enligt beskrivningen nedan; hittills har vi sett typerna Point och Linestring.

source: By querying this table, GIS clients and libraries can determine what to expect when retrieving data and can perform any necessary projection, processing or rendering without needing to inspect each geometry.
es: Consultando esta tabla, los clientes SIG y bibliotecas pueden determinar qué esperar al recuperar datos y pueden realizar cualquier proyección, procesamiento o representación necesarios sin tener que inspeccionar cada geometría.
sv: Genom att fråga i denna tabell kan GIS-klienter och bibliotek avgöra vad de kan förvänta sig när de hämtar data och kan utföra all nödvändig projicering, bearbetning eller rendering utan att behöva inspektera varje geometri.

source: Do some or all of your ``nyc`` tables not have an ``srid`` of 26918? It's easy to fix by updating the table.
es: ¿Algunas de tus tablas nyc no tienen un srid de 26918? Es fácil corregirlo actualizando la tabla.
sv: Har några eller alla dina "NYC"-tabeller inte en "srid" på 26918? Det är lätt att åtgärda genom att uppdatera tabellen.

source: Representing Real World Objects
es: Representación de objetos del mundo real
sv: Representera objekt i den verkliga världen

source: The Simple Features for SQL (:term:`SFSQL`) specification, the original guiding standard for PostGIS development, defines how a real world object is represented. By taking a continuous shape and digitizing it at a fixed resolution we achieve a passable representation of the object. SFSQL only handled 2-dimensional representations. PostGIS has extended that to include 3- and 4-dimensional representations; more recently the SQL-Multimedia Part 3 (:term:`SQL/MM`) specification has officially defined their own representation.
es: La especificación Simple Features for SQL (SFSQL), estándar guía original para el desarrollo de PostGIS, define cómo se representa un objeto del mundo real. Al tomar una forma continua y digitalizarla a una resolución fija se logra una representación aceptable del objeto. SFSQL solo manejaba representaciones bidimensionales. PostGIS ha extendido esto para incluir representaciones en 3 y 4 dimensiones; más recientemente la especificación SQL-Multimedia Parte 3 (SQL/MM) ha definido oficialmente su propia representación.
sv: Simple Features for SQL (:term:`SFSQL`) specifikationen, den ursprungliga vägledande standarden för PostGIS-utveckling, definierar hur ett verkligt objekt representeras. Genom att ta en kontinuerlig form och digitalisera den med en fast upplösning uppnår vi en acceptabel representation av objektet. SFSQL hanterade endast 2-dimensionella representationer. PostGIS har utvidgat det till att omfatta 3- och 4-dimensionella representationer; nyligen har SQL-Multimedia Part 3 (:term:`SQL/MM`) -specifikationen officiellt definierat sin egen representation.

source: Our example table contains a mixture of different geometry types. We can collect general information about each object using functions that read the geometry metadata.
es: Nuestra tabla de ejemplo contiene una mezcla de diferentes tipos de geometrías. Podemos recopilar información general sobre cada objeto usando funciones que leen los metadatos de la geometría.
sv: Vår exempeltabell innehåller en blandning av olika geometrityper. Vi kan samla in allmän information om varje objekt med hjälp av funktioner som läser geometrimetadata.

source: :command:`ST_GeometryType(geometry)` returns the type of the geometry
es: :command:`ST_GeometryType(geometry)` devuelve el tipo de geometría
sv: :command:`ST_GeometryType(geometry)` returnerar typen av geometri

source: :command:`ST_NDims(geometry)` returns the number of dimensions of the geometry
es: :command:`ST_NDims(geometry)` devuelve el número de dimensiones de la geometría
sv: :command:`ST_NDims(geometry)` returnerar antalet dimensioner för geometrin

source: :command:`ST_SRID(geometry)` returns the spatial reference identifier number of the geometry
es: :command:`ST_SRID(geometry)` devuelve el número identificador de referencia espacial de la geometría
sv: :command:`ST_SRID(geometry)` returnerar geometrins identifieringsnummer för spatial referens

source: Points
es: Puntos
sv: Punkter

source: A spatial **point** represents a single location on the Earth. This point is represented by a single coordinate (including either 2-, 3- or 4-dimensions). Points are used to represent objects when the exact details, such as shape and size, are not important at the target scale. For example, cities on a map of the world can be described as points, while a map of a single state might represent cities as polygons.
es: Un punto espacial representa una única ubicación en la Tierra. Este punto se representa por una sola coordenada (que puede incluir 2, 3 o 4 dimensiones). Los puntos se usan para representar objetos cuando los detalles exactos, como forma y tamaño, no son importantes en la escala objetivo. Por ejemplo, las ciudades en un mapa del mundo pueden describirse como puntos, mientras que un mapa de un estado individual podría representarlas como polígonos.
sv: En spatial **punkt** representerar en enda plats på jorden. Denna punkt representeras av en enda koordinat (antingen 2-, 3- eller 4-dimensionell). Punkter används för att representera objekt när de exakta detaljerna, t.ex. form och storlek, inte är viktiga i målskalan. Till exempel kan städer på en världskarta beskrivas som punkter, medan en karta över en enskild stat kan representera städer som polygoner.

source: Some of the specific spatial functions for working with points are:
es: Algunas funciones espaciales específicas para trabajar con puntos son:
sv: Några av de specifika spatiala funktionerna för att arbeta med punkter är:

source: :command:`ST_X(geometry)` returns the X ordinate
es: :command:`ST_X(geometry)` devuelve la coordenada X
sv: :command:`ST_X(geometry)` returnerar X-ordinaten

source: :command:`ST_Y(geometry)` returns the Y ordinate
es: :command:`ST_Y(geometry)` devuelve la coordenada Y
sv: :command:`ST_Y(geometry)` returnerar Y-ordinaten

source: So, we can read the ordinates from a point like this:
es: Por tanto, podemos leer las coordenadas de un punto como:
sv: Så vi kan läsa föreskrifterna från en punkt som denna:

source: The New York City subway stations (``nyc_subway_stations``) table is a data set represented as points. The following SQL query will return the geometry associated with one point (in the :command:`ST_AsText` column).
es: Las estaciones de metro de Nueva York (nyc_subway_stations) son un conjunto de datos representado como puntos. La siguiente consulta SQL devuelve la geometría asociada con un punto (en la columna ST_AsText).
sv: Tabellen New York City subway stations (``nyc_subway_stations``) är en datamängd som representeras av punkter. Följande SQL-fråga returnerar den geometri som är associerad med en punkt (i kolumnen :command:`ST_AsText`).

source: Linestrings
sv: Linjesträngar

source: A **linestring** is a path between locations. It takes the form of an ordered series of two or more points. Roads and rivers are typically represented as linestrings. A linestring is said to be **closed** if it starts and ends on the same point. It is said to be **simple** if it does not cross or touch itself (except at its endpoints if it is closed). A linestring can be both **closed** and **simple**.
es: Una linestring es un camino entre ubicaciones. Toma la forma de una serie ordenada de dos o más puntos. Las carreteras y ríos se representan típicamente como linestrings. Una linestring se dice que está cerrada si comienza y termina en el mismo punto. Se dice que es simple si no se cruza ni se toca a sí misma (excepto en sus extremos si está cerrada). Una linestring puede ser tanto cerrada como simple.
sv: En **linjestring** är en väg mellan platser. Den har formen av en ordnad serie av två eller flera punkter. Vägar och floder representeras vanligtvis som linjestringar. En linjestring sägs vara **sluten** om den börjar och slutar på samma punkt. Den sägs vara **enkel** om den inte korsar eller rör vid sig själv (utom vid sina ändpunkter om den är sluten). En linjestring kan vara både **sluten** och **enkel**.

source: The street network for New York (``nyc_streets``) was loaded earlier in the workshop. This dataset contains details such as name, and type. A single real world street may consist of many linestrings, each representing a segment of road with different attributes.
es: La red de calles de Nueva York (nyc_streets) se cargó anteriormente en el taller. Este conjunto de datos contiene detalles como nombre y tipo. Una calle real puede consistir en muchas linestrings, cada una representando un segmento de vía con diferentes atributos.
sv: Gatunätet för New York (``nyc_streets``) laddades tidigare under workshopen. Denna dataset innehåller detaljer som namn och typ. En enda gata i verkligheten kan bestå av många linjestringar, som var och en representerar ett vägsegment med olika attribut.

source: The following SQL query will return the geometry associated with one linestring (in the :command:`ST_AsText` column).
es: La siguiente consulta SQL devuelve la geometría asociada con una linestring (en la columna ST_AsText).
sv: Följande SQL-fråga returnerar den geometri som är associerad med en linjestring (i kolumnen :command:`ST_AsText`).

source: Some of the specific spatial functions for working with linestrings are:
es: Algunas funciones espaciales específicas para trabajar con linestrings son:
sv: Några av de specifika spatiala funktionerna för att arbeta med linjestrings är:

source: :command:`ST_Length(geometry)` returns the length of the linestring
es: :command:`ST_Length(geometry)` devuelve la longitud de la linestring
sv: :command:`ST_Length(geometry)` returnerar längden på linjesträngen

source: :command:`ST_StartPoint(geometry)` returns the first coordinate as a point
es: :command:`ST_StartPoint(geometry)` devuelve la primera coordenada como un punto
sv: :command:`ST_StartPoint(geometry)` returnerar den första koordinaten som en punkt

source: :command:`ST_EndPoint(geometry)` returns the last coordinate as a point
es: :command:`ST_EndPoint(geometry)` devuelve la última coordenada como un punto
sv: :command:`ST_EndPoint(geometry)` returnerar den sista koordinaten som en punkt

source: :command:`ST_NPoints(geometry)` returns the number of coordinates in the linestring
es: :command:`ST_NPoints(geometry)` devuelve el número de coordenadas en la linestring
sv: :command:`ST_NPoints(geometry)` returnerar antalet koordinater i linjesträngen

source: So, the length of our linestring is:
es: Entonces, la longitud de nuestro linestring es:
sv: Så längden på vår linjestring är:

source: Polygons
es: Polígonos
sv: Polygoner

source: A polygon is a representation of an area. The outer boundary of the polygon is represented by a ring. This ring is a linestring that is both closed and simple as defined above. Holes within the polygon are also represented by rings.
es: Un polígono es una representación de un área. El límite exterior del polígono está representado por un anillo. Este anillo es una linestring que es a la vez cerrada y simple. Los agujeros dentro del polígono también se representan mediante anillos.
sv: En polygon är en representation av ett område. Polygonens yttre gräns representeras av en ring. Denna ring är en linjestring som är både sluten och enkel enligt definitionen ovan. Hål inom polygonen representeras också av ringar.

source: Polygons are used to represent objects whose size and shape are important. City limits, parks, building footprints or bodies of water are all commonly represented as polygons when the scale is sufficiently high to see their area. Roads and rivers can sometimes be represented as polygons.
es: Los polígonos se usan para representar objetos cuyo tamaño y forma son importantes. Límites de ciudades, parques, huellas de edificios o cuerpos de agua se representan comúnmente como polígonos cuando la escala es lo suficientemente grande para ver su área. Carreteras y ríos a veces pueden representarse como polígonos.
sv: Polygoner används för att representera objekt vars storlek och form är viktiga. Stadsgränser, parker, byggnaders fotavtryck eller vattendrag representeras ofta som polygoner när skalan är tillräckligt hög för att man ska kunna se deras yta. Vägar och floder kan ibland representeras som polygoner.

source: The following SQL query will return the geometry associated with one polygon (in the :command:`ST_AsText` column).
es: La siguiente consulta SQL devuelve la geometría asociada con un polígono (en la columna :command:`ST_AsText`).
sv: Följande SQL-fråga returnerar den geometri som är associerad med en polygon (i kolumnen :command:`ST_AsText`).

source: Rather than using an ``=`` sign in our ``WHERE`` clause, we are using the ``LIKE`` operator to carry out a string matching operation. **You may be used to the ``*`` symbol as a "glob" for pattern matching, but in SQL the ``%`` symbol is used**, along with the ``LIKE`` operator to tell the system to do globbing.
es: En lugar de usar un signo ``=`` en nuestra cláusula ``WHERE``, estamos usando el operador ``LIKE`` para realizar una operación de coincidencia de cadenas. Puede que estés acostumbrado al símbolo * como comodín de coincidencia, pero en SQL se usa el símbolo ``%`` junto con el operador ``LIKE`` para indicar 'cualquier carácter'.
sv: I stället för att använda ett ``=``-tecken i vår ``WHERE``-sats använder vi operatorn ``LIKE`` för att utföra en strängmatchningsoperation. **Du kanske är van vid symbolen ``*`` som en "glob" för mönstermatchning, men i SQL används symbolen ``%``**, tillsammans med operatorn ``LIKE`` för att tala om för systemet att göra globbing.

source: The first polygon has only one ring. The second one has an interior "hole". Most graphics systems include the concept of a "polygon", but GIS systems are relatively unique in allowing polygons to explicitly have holes.
es: El primer polígono tiene solo un anillo. El segundo tiene un "agujero" interior. La mayoría de los sistemas gráficos incluyen el concepto de polígono, pero los sistemas GIS son relativamente únicos al permitir que los polígonos tengan agujeros explícitamente.
sv: Den första polygonen har bara en ring. Den andra har ett inre "hål". De flesta grafiksystem innehåller begreppet "polygon", men GIS-system är relativt unika genom att de tillåter polygoner att uttryckligen ha hål.

source: Some of the specific spatial functions for working with polygons are:
es: Algunas funciones espaciales específicas para trabajar con polígonos son:
sv: Några av de specifika spatiala funktionerna för att arbeta med polygoner är:

source: :command:`ST_Area(geometry)` returns the area of the polygons
es: :command:`ST_Area(geometría)` devuelve el área de la geometría
sv: :command:`ST_Area(geometry)` returnerar polygonernas area

source: :command:`ST_NRings(geometry)` returns the number of rings (usually 1, more if there are holes)
es: :command:`ST_NRings(geometry)` devuelve el número de anillos, usualmente 1 (o más si hay agujeros)
sv: :command:`ST_NRings(geometry)` returnerar antalet ringar (vanligtvis 1, fler om det finns hål)

source: :command:`ST_ExteriorRing(geometry)` returns the outer ring as a linestring
es: :command:`ST_ExteriorRing(geometry)` devuelve el anillo exterior como una linestring
sv: :command:`ST_ExteriorRing(geometry)` returnerar den yttre ringen som en linjestring

source: :command:`ST_InteriorRingN(geometry,n)` returns a specified interior ring as a linestring
es: :command:`ST_InteriorRingN(geometry,n)` devuelve un anillo interior específico como una linestring
sv: :command:`ST_InteriorRingN(geometry,n)` returnerar en angiven inre ring som en linjestring

source: :command:`ST_Perimeter(geometry)` returns the length of all the rings
es: :command:`ST_Perimeter(geometry)` devuelve la longitud de todos los anillos
sv: :command:`ST_Perimeter(geometry)` returnerar längden på alla ringar

source: We can calculate the area of our polygons using the area function:
es: Podemos calcular el área de nuestros polígonos usando la función de área:
sv: Vi kan beräkna arean av våra polygoner med hjälp av areafunktionen:

source: Note that the polygon with a hole has an area that is the area of the outer shell (a 10x10 square) minus the area of the hole (a 1x1 square).
es: Observe que el polígono con un agujero tiene un área que corresponde al área de la envolvente exterior (un cuadrado de 10x10) menos el área del agujero (un cuadrado de 1x1).
sv: Observera att polygonen med ett hål har en area som är arean av det yttre skalet (en 10x10 kvadrat) minus arean av hålet (en 1x1 kvadrat).

source: Collections
es: Colecciones
sv: Samlingar

source: There are four collection types, which group multiple simple geometries into sets.
es: Existen cuatro tipos de colecciones, que agrupan múltiples geometrías simples en conjuntos.
sv: Det finns fyra samlingstyper, som grupperar flera enkla geometrier i uppsättningar.

source: **MultiPoint**, a collection of points
es: **MultiPoint**, una colección de puntos
sv: **MultiPoint**, en samling punkter

source: **MultiLineString**, a collection of linestrings
es: **MultiLineString**, una colección de líneas
sv: **MultiLineString**, en samling av linjestrings

source: **MultiPolygon**, a collection of polygons
es: **MultiPolygon**, una colección de polígonos
sv: **MultiPolygon**, en samling av polygoner
