Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/index.po
Languages: sv

source: Introduction to PostGIS
sv: Introduktion till PostGIS

source: Getting Started
sv: Komma igång

source: This workshop uses a `data bundle <http://s3.cleverelephant.ca/postgis-workshop-2020.zip>`_. Download it and extract to a convenient location.
sv: I den här workshopen används ett `datapaket <http://s3.cleverelephant.ca/postgis-workshop-2020.zip>`_. Ladda ner den och extrahera den till en lämplig plats.

source: The **presentation deck** that goes with this workshop is available `on Google Slides <https://docs.google.com/presentation/d/1qYXdeCIymLl32uoAHvAPrp1r-hK-_4Z8InG7sHEo6vc/edit>`_.
sv: Den **presentation deck** som hör till denna workshop finns tillgänglig `på Google Slides <https://docs.google.com/presentation/d/1qYXdeCIymLl32uoAHvAPrp1r-hK-_4Z8InG7sHEo6vc/edit>`_.

source: The **cheat sheet** of SQL commands that are run in this workshop is `available here <workshop-sql.txt>`_.
sv: En lista över SQL-kommandon som körs i den här workshopen finns här <workshop-sql.txt>`_.

source: Data Bundle
sv: Datapaket

source: Inside the data bundle, you will find:
sv: Inuti datapaketet hittar du:

source: a directory containing the data files we will be loading
sv: en katalog som innehåller de datafiler som vi ska ladda

source: a directory containing the exercise pages and data model pages
sv: en katalog som innehåller övningssidorna och datamodellsidorna

source: License & Copying
sv: Licens och kopiering

source: All the data in the package is public domain and freely redistributable. All the software in the package is open source, and freely redistributable. This workshop is licensed as Creative Commons "`share alike with attribution <http://creativecommons.org/licenses/by-sa/3.0/us/>`_", and is freely redistributable under the terms of that license.
sv: All data i paketet är offentlig egendom och kan fritt vidarebefordras. All programvara i paketet är öppen källkod och kan fritt distribueras. Denna workshop är licensierad som Creative Commons "`dela på samma sätt med tillskrivning <http://creativecommons.org/licenses/by-sa/3.0/us/>`_" och kan fritt vidarebefordras enligt villkoren i den licensen.

source: Workshop Modules
sv: Workshop-moduler

source: Links to have on hand
sv: Länkar att ha till hands

source: Docs - https://postgis.net/docs/
sv: Dokument - https://postgis.net/docs/

source: Docs - https://www.postgresql.org/docs/
sv: Dokument - https://www.postgresql.org/docs/

source: Downloads - https://www.postgresql.org/download/
sv: Nedladdningar - https://www.postgresql.org/download/

source: JDBC Driver - https://jdbc.postgresql.org/
sv: JDBC-drivrutin - https://jdbc.postgresql.org/

source: .Net Driver - https://www.npgsql.org/
sv: .net-drivrutin - https://www.npgsql.org/

source: C/C++ Driver - https://www.postgresql.org/docs/current/static/libpq.html
sv: C/C++-drivrutin - https://www.postgresql.org/docs/current/static/libpq.html

source: Open Source Desktop Clients
sv: Skrivbordsklienter med öppen källkod
