Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/indexing.po
Languages: sv

source: Spatial Indexing
sv: Spatial indexering

source: Recall that spatial index is one of the three key features of a spatial database. Indexes make using a spatial database for large data sets possible. Without indexing, any search for a feature would require a "sequential scan" of every record in the database. Indexing speeds up searching by organizing the data into a search tree which can be quickly traversed to find a particular record.
sv: Kom ihåg att ett spatialt index är en av de tre viktigaste egenskaperna hos en spatial databas. Index gör det möjligt att använda en spatial databas för stora datamängder. Utan indexering skulle varje sökning efter en funktion kräva en "sekventiell skanning" av varje post i databasen. Indexering påskyndar sökningen genom att data organiseras i ett sökträd som snabbt kan genomgås för att hitta en viss post.

source: Spatial indices are one of the greatest assets of PostGIS. In the previous example building spatial joins requires comparing whole tables with each other. This can get very costly: joining two tables of 10,000 records each without indexes would require 100,000,000 comparisons; with indexes the cost could be as low as 20,000 comparisons.
sv: Spatiala index är en av de största tillgångarna i PostGIS. I det föregående exemplet krävdes det att hela tabeller jämfördes med varandra för att skapa spatiala sammankopplingar. Detta kan bli mycket kostsamt: att sammanfoga två tabeller med 10 000 poster vardera utan index skulle kräva 100 000 000 000 jämförelser; med index kan kostnaden bli så låg som 20 000 jämförelser.

source: Our data load file already included spatial indexes for all the tables, so in order to demonstrate the efficacy of indexes we will have to first remove them.
sv: Vår dataladdningsfil innehöll redan spatiala index för alla tabeller, så för att kunna visa indexens effektivitet måste vi först ta bort dem.

source: Let's run a query on ``nyc_census_blocks`` **without** our spatial index.
sv: Låt oss köra en fråga på ``nyc_census_blocks`` **utan** vårt spatiala index.

source: Our first step is to **remove** the index.
sv: Vårt första steg är att **ta bort** indexet.

source: The ``DROP INDEX`` statement drops an existing index from the database system. For more information, see the PostgreSQL `documentation <http://www.postgresql.org/docs/current/interactive/sql-dropindex.html>`_.
sv: Uttalandet ``DROP INDEX`` tappar ett befintligt index från databassystemet. För mer information, se PostgreSQL-dokumentationen <http://www.postgresql.org/docs/current/interactive/sql-dropindex.html>`_.

source: Now, watch the "Timing" meter at the lower right-hand corner of the pgAdmin query window and run the following. Our query searches through every single census block in order to identify blocks that contain subway stops that start with "B".
sv: Titta nu på "Timing"-mätaren i det nedre högra hörnet av pgAdmin-frågefönstret och kör följande. Vår fråga söker igenom varje enskilt folkbokföringsblock för att identifiera block som innehåller tunnelbanestationer som börjar med "B".

source: The ``nyc_census_blocks`` table is very small (only a few thousand records) so even without an index, the query only takes **300 ms** on my test computer.
sv: Tabellen ``nyc_census_blocks`` är mycket liten (bara några tusen poster) så även utan ett index tar frågan bara **300 ms** på min testdator.

source: Now add the spatial index back in and run the query again.
sv: Lägg nu till det spatiala indexet igen och kör frågan igen.

source: The ``USING GIST`` clause tells PostgreSQL to use the generic index structure (GIST) when building the index. If you receive an error that looks like ``ERROR: index row requires 11340 bytes, maximum size is 8191`` when creating your index, you have likely neglected to add the ``USING GIST`` clause.
sv: Klausulen `` ANVÄNDER GIST`` säger till PostgreSQL att använda den generiska indexstrukturen (GIST) när man bygger indexet. Om du får ett fel som ser ut som `` FEL: indexrad kräver 11340 byte, maximal storlek är 8191`` när du skapar ditt index, har du sannolikt försummat att lägga till klausulen `` ANVÄND GIST``.

source: On my test computer the time drops to **50 ms**. The larger your table, the larger the relative speed improvement of an indexed query will be.
sv: På min testdator sjönk tiden till **50 ms**. Ju större tabell du har, desto större blir den relativa hastighetsförbättringen av en indexerad fråga.

source: How Spatial Indexes Work
sv: Hur spatiala index fungerar

source: Standard database indexes create a hierarchical tree based on the values of the column being indexed. Spatial indexes are a little different -- they are unable to index the geometric features themselves and instead index the bounding boxes of the features.
sv: Standarddatabasindex skapar ett hierarkiskt träd baserat på värdena i den kolumn som indexeras. Spatiala index är lite annorlunda - de kan inte indexera själva de geometriska objekten utan indexerar i stället objektens avgränsande boxar.

source: In the figure above, the number of lines that intersect the yellow star is **one**, the red line. But the bounding boxes of features that intersect the yellow box is **two**, the red and blue ones.
sv: I figuren ovan är antalet linjer som korsar den gula stjärnan **en**, den röda linjen. Men de avgränsande rutorna för funktioner som skär den gula rutan är **två**, den röda och den blå.

source: The way the database efficiently answers the question "what lines intersect the yellow star" is to first answer the question "what boxes intersect the yellow box" using the index (which is very fast) and then do an exact calculation of "what lines intersect the yellow star" **only for those features returned by the first test**.
sv: Det sätt på vilket databasen effektivt besvarar frågan "vilka linjer skär den gula stjärnan" är att först besvara frågan "vilka rutor skär den gula rutan" med hjälp av indexet (vilket är mycket snabbt) och sedan göra en exakt beräkning av "vilka linjer skär den gula stjärnan" **endast för de funktioner som det första testet gav**.

source: For a large table, this "two pass" system of evaluating the approximate index first, then carrying out an exact test can radically reduce the amount of calculations necessary to answer a query.
sv: För en stor tabell kan detta "tvåpass"-system, där man först utvärderar det approximativa indexet och sedan utför ett exakt test, radikalt minska antalet beräkningar som krävs för att besvara en fråga.

source: Both PostGIS and Oracle Spatial share the same "R-Tree" [#RTree]_ spatial index structure. R-Trees break up data into rectangles, and sub-rectangles, and sub-sub rectangles, etc. It is a self-tuning index structure that automatically handles variable data density, differing amounts of object overlap, and object size.
sv: Både PostGIS och Oracle Spatial delar samma spatiala indexstruktur "R-Tree" [#RTree]_. R-Trees delar upp data i rektanglar och subrektanglar och sub-sub-rektanglar osv. Det är en självjusterande indexstruktur som automatiskt hanterar varierande datatäthet, olika mängder objektöverlappning och objektstorlek.

source: Spatially Indexed Functions
sv: Spatialt indexerade funktioner

source: Only a subset of functions will automatically make use of a spatial index, if one is available.
sv: Endast en del av funktionerna kommer automatiskt att använda ett spatialt index, om ett sådant finns tillgängligt.

source: The first four are the ones most commonly used in queries, and `ST_DWithin <http://postgis.net/docs/ST_DWithin.html>`_ is very important for doing "within a distance" or "within a radius" style queries while still getting a performance boost from the index.
sv: De fyra första är de som oftast används i frågor, och `ST_DWithin <http://postgis.net/docs/ST_DWithin.html>`_ är mycket viktigt för att göra frågor av typen "inom ett avstånd" eller "inom en radie" och samtidigt få en prestandaförbättring från indexet.

source: In order to add index acceleration to other functions that are not in this list (most commonly, `ST_Relate <http://postgis.net/docs/ST_Relate.html>`_) add an index-only clause as described below.
sv: För att lägga till indexacceleration till andra funktioner som inte finns i den här listan (oftast `ST_Relate <http://postgis.net/docs/ST_Relate.html>`_), lägg till en index-only-klausul enligt beskrivningen nedan.

source: Index-Only Queries
sv: Frågor med enbart index

source: Most of the commonly used functions in PostGIS (:command:`ST_Contains`, :command:`ST_Intersects`, :command:`ST_DWithin`, etc) include an index filter automatically. But some functions (e.g., :command:`ST_Relate`) do not include an index filter.
sv: De flesta av de vanligaste funktionerna i PostGIS (:command:`ST_Contains`, :command:`ST_Intersects`, :command:`ST_DWithin`, etc) inkluderar ett indexfilter automatiskt. Men vissa funktioner (t.ex. :command:`ST_Relate`) innehåller inte ett indexfilter.

source: To do a bounding-box search using the index (and no filtering), make use of the :command:`&&` operator. For geometries, the :command:`&&` operator means "bounding boxes overlap or touch" in the same way that for numbers the :command:`=` operator means "values are the same".
sv: För att göra en bounding-box-sökning med hjälp av indexet (och utan filtrering) använder du operatorn :command:`&&`. För geometrier betyder operatorn :command:`&&` "bounding boxes överlappar eller rör vid varandra" på samma sätt som operatorn :command:`=` för tal betyder "värdena är desamma".

source: Let's compare an index-only query for the population of the 'West Village' to a more exact query. Using :command:`&&` our index-only query looks like the following:
sv: Låt oss jämföra en indexfråga för befolkningen i "West Village" med en mer exakt fråga. Med hjälp av :command:`&&` ser vår indexfråga ut som följer:

source: Now let's do the same query using the more exact :command:`ST_Intersects` function.
sv: Låt oss nu göra samma fråga med hjälp av den mer exakta funktionen :command:`ST_Intersects`.

source: A much lower answer! The first query summed up every block whose bounding box intersects the neighborhood's bounding box; the second query only summed up those blocks that intersect the neighborhood itself.
sv: Ett mycket lägre svar! Den första frågan summerade varje kvarter vars begränsningsbox skär grannskapets begränsningsbox; den andra frågan summerade bara de kvarter som skär själva grannskapet.

source: Analyzing
sv: Analysering

source: The PostgreSQL query planner intelligently chooses when to use or not to use indexes to evaluate a query. Counter-intuitively, it is not always faster to do an index search: if the search is going to return every record in the table, traversing the index tree to get each record will actually be slower than just sequentially reading the whole table from the start.
sv: PostgreSQL-frågeplaneraren väljer intelligent när man ska använda eller inte använda index för att utvärdera en fråga. Motintuitivt är det inte alltid snabbare att göra en indexsökning: om sökningen kommer att returnera varje post i tabellen, kommer det faktiskt att vara långsammare att korsa indexträdet för att få varje post än att bara sekventiellt läsa hela tabellen från början.

source: Knowing the size of the query rectangle is not enough to pin down whether a query will return a large number or small number of records. Below, the red square is small, but will return many more records than the blue square.
sv: Att känna till storleken på frågerektangeln räcker inte för att avgöra om en fråga kommer att returnera ett stort antal eller ett litet antal poster. Nedan är den röda kvadraten liten, men kommer att returnera många fler poster än den blå kvadraten.

source: In order to figure out what situation it is dealing with (reading a small part of the table versus reading a large portion of the table), PostgreSQL keeps statistics about the distribution of data in each indexed table column. By default, PostgreSQL gathers statistics on a regular basis. However, if you dramatically change the contents of your table within a short period of time, the statistics will not be up-to-date.
sv: För att ta reda på vilken situation den har att göra med (läsa en liten del av tabellen jämfört med att läsa en stor del av tabellen) håller PostgreSQL statistik om fördelningen av data i varje indexerad tabellkolumn. Som standard samlar PostgreSQL statistik regelbundet. Men om du dramatiskt ändrar innehållet i din tabell inom en kort tidsperiod kommer statistiken inte att vara uppdaterad.

source: To ensure the statistics match your table contents, it is wise the to run the ``ANALYZE`` command after bulk data loads and deletes in your tables. This force the statistics system to gather data for all your indexed columns.
sv: För att säkerställa att statistiken stämmer överens med tabellinnehållet är det klokt att köra kommandot ``ANALYZE`` efter massinläsning och radering av data i tabellerna. Detta tvingar statistiksystemet att samla in data för alla dina indexerade kolumner.

source: The ``ANALYZE`` command asks PostgreSQL to traverse the table and update its internal statistics used for query plan estimation (query plan analysis will be discussed later).
sv: Kommandot `` ANALYZE`` ber PostgreSQL att korsa tabellen och uppdatera dess interna statistik som används för uppskattning av frågeplan (frågeplananalys kommer att diskuteras senare).

source: It's worth stressing that just creating an index is not enough to allow PostgreSQL to use it effectively. VACUUMing must be performed whenever a large number of UPDATEs, INSERTs or DELETEs are issued against a table. The ``VACUUM`` command asks PostgreSQL to reclaim any unused space in the table pages left by updates or deletes to records.
sv: Det är värt att betona att det inte räcker att bara skapa ett index för att PostgreSQL ska kunna använda det effektivt. VACUUMING måste utföras när ett stort antal UPDATEs, INSERTs eller DELETEs utfärdas mot en tabell. Kommandot `` VACUUM`` ber PostgreSQL att återta allt oanvänt utrymme på tabellsidorna som lämnas av uppdateringar eller raderingar till poster.

source: Vacuuming is so critical for the efficient running of the database that PostgreSQL provides an "autovacuum" facility by default.
sv: Vacuuming är så viktigt för en effektiv körning av databasen att PostgreSQL tillhandahåller en "autovacuum" -facilitet som standard.

source: Autovacuum both vacuums (recovers space) and analyzes (updates statistics) on your tables at sensible intervals determined by the level of activity. While this is essential for highly transactional databases, it is not advisable to wait for an autovacuum run after adding indices or bulk-loading data. Whenever a large batch update is performed, you should manually run ``VACUUM``.
sv: Autovacuum både dammsuger (återställer utrymme) och analyserar (uppdaterar statistik) dina tabeller med förnuftiga intervall som bestäms av aktivitetsnivån. Även om detta är viktigt för databaser med många transaktioner, är det inte tillrådligt att vänta på en autovacuum-körning efter att ha lagt till index eller laddat upp data. Varje gång en stor batchuppdatering utförs bör du manuellt köra ``VACUUM``.

source: Vacuuming and analyzing the database can be performed separately as needed. Issuing ``VACUUM`` command will not update the database statistics; likewise issuing an ``ANALYZE`` command will not recover unused table rows. Both commands can be run against the entire database, a single table, or a single column.
sv: Vacuuming och analys av databasen kan utföras separat efter behov. Kommandot ``VACUUM`` uppdaterar inte databasstatistiken, och kommandot ``ANALYZE`` återställer inte heller oanvända tabellrader. Båda kommandona kan köras mot hela databasen, en enstaka tabell eller en enstaka kolumn.

source: Function List
sv: Funktionslista

source: `geometry_a && geometry_b <http://postgis.net/docs/geometry_overlaps.html>`_: Returns TRUE if A's bounding box overlaps B's.
sv: `geometry_a && geometry_b <http://postgis.net/docs/geometry_overlaps.html>`_: Returnerar SANT om A:s avgränsande box överlappar B:s.

source: `geometry_a = geometry_b <http://postgis.net/docs/ST_Geometry_EQ.html>`_: Before PostGIS 2.4 returns true if A's bounding box is same as B's. From 2.4 on Returns TRUE only if A's geometry is the same as B.
sv: `geometry_a = geometry_b <http://postgis.net/docs/ST_Geometry_EQ.html>`_: Före PostGIS 2.4 returnerar true om A:s bounding box är densamma som B:s. Från 2.4 och framåt Returnerar SANT endast om A:s geometri är densamma som B:s.

source: `geometry_a ~= geometry_b <http://postgis.net/docs/ST_Geometry_Same.html>`_: Returns TRUE if A's bounding box equals B's bounding box.
sv: `geometry_a ~= geometry_b <http://postgis.net/docs/ST_Geometry_Same.html>`_: Returnerar SANT om A:s avgränsande box är lika med B:s avgränsande box.

source: `ST_Intersects(geometry_a, geometry_b) <http://postgis.net/docs/ST_Intersects.html>`_: Returns TRUE if the Geometries/Geography "spatially intersect" - (share any portion of space) and FALSE if they don't (they are Disjoint).
sv: `ST_Intersects(geometry_a, geometry_b) <http://postgis.net/docs/ST_Intersects.html>`_: Returnerar TRUE om geometrierna/geografin "spatialt korsar varandra" - (delar någon del av utrymmet) och FALSE om de inte gör det (de är disjunkta).

source: Footnotes
sv: Fotnoter
