Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/installation.po
Languages: sv, uk

source: Installation
uk: Встановлення

source: To explore the PostgreSQL/PostGIS database, and learn about writing spatial queries in SQL, we will need some software, either installed locally or available remotely on the cloud.
sv: För att utforska PostgreSQL/PostGIS-databasen och lära oss att skriva spatiala frågor i SQL behöver vi lite programvara, antingen installerad lokalt eller tillgänglig på distans i molnet.
uk: Щоб ознайомитися з базою даних PostgreSQL/PostGIS та навчитися писати просторові запити в SQL, нам знадобиться програмне забезпечення, яке можна встановити локально або отримати віддалено в хмарі.

source: There are instructions below on how to access PostgreSQL for installation on Windows or MacOS. PostgreSQL for Windows and MacOS either include PostGIS or have an easy way to add it on.
sv: Det finns instruktioner nedan om hur du får tillgång till PostgreSQL för installation på Windows eller MacOS. PostgreSQL för Windows och MacOS inkluderar antingen PostGIS eller har ett enkelt sätt att lägga till det.
uk: Нижче наведені інструкції щодо встановлення PostgreSQL на Windows або MacOS. Версії PostgreSQL для Windows і MacOS або вже містять PostGIS, або мають простий спосіб його додати.

source: There are instructions below on how to install `PgAdmin <https://www.pgadmin.org/>`_. PgAdmin is a graphical database explorer and SQL editor which provides a "user facing" interface to the database engine that does all the world.
sv: Nedan finns instruktioner om hur du installerar `PgAdmin <https://www.pgadmin.org/>`_. PgAdmin är en grafisk databasutforskare och SQL-editor som ger ett användarvänligt gränssnitt till databasmotorn som gör allt i världen.
uk: Нижче наведено інструкції щодо встановлення `PgAdmin <https://www.pgadmin.org/>`_. PgAdmin — це графічний браузер баз даних та редактор SQL, який надає «користувацький» інтерфейс до механізму бази даних, що виконує всі необхідні функції.

source: For always up-to-date directions on installing PostgreSQL, go to the `PostgreSQL download page <https://www.postgresql.org/download/>`_ and select the operating system you are using.
sv: För alltid uppdaterade anvisningar om installation av PostgreSQL, gå till `PostgreSQL nedladdningssida <https://www.postgresql.org/download/>`_ och välj det operativsystem du använder.
uk: Щоб отримати завжди актуальні інструкції з інсталяції PostgreSQL, перейдіть на сторінку завантаження PostgreSQL <https://www.postgresql.org/download/>_ і виберіть операційну систему, яку ви використовуєте.

source: PostgreSQL for Microsoft Windows
sv: PostgreSQL för Microsoft Windows
uk: PostgreSQL для Microsoft Windows

source: For a Windows install:
sv: För en Windows-installation:
uk: Для встановлення в Windows:

source: Go to the `Windows PostgreSQL download page <https://www.enterprisedb.com/downloads/postgres-postgresql-downloads>`_.
sv: Gå till nedladdningssidan för `Windows PostgreSQL <https://www.enterprisedb.com/downloads/postgres-postgresql-downloads>`_.
uk: Перейдіть на сторінку завантаження Windows PostgreSQL <https://www.enterprisedb.com/downloads/postgres-postgresql-downloads>_.

source: Select the latest version of PostgreSQL and save the installer to disk.
sv: Välj den senaste versionen av PostgreSQL och spara installationsprogrammet på disken.
uk: Виберіть останню версію PostgreSQL і збережіть інсталятор на комп'ютері.

source: Run the installer and accept the defaults.
sv: Kör installationsprogrammet och acceptera standardinställningarna.
uk: Запустіть інсталятор і прийміть стандартні налаштування.

source: Find and run the "StackBuilder" program that was installed with the database.
sv: Leta reda på och kör programmet "StackBuilder" som installerades tillsammans med databasen.
uk: Знайдіть і запустіть програму «StackBuilder», яка була встановлена разом із базою даних.

source: Select the "Spatial Extensions" section and choose latest "PostGIS ..Bundle" option.
sv: Välj avsnittet "Spatial Extensions" och välj det senaste alternativet "PostGIS ..Bundle".
uk: Виберіть розділ «Spatial Extensions» і виберіть останню опцію «PostGIS ..Bundle».

source: Accept the defaults and install.
sv: Acceptera standardinställningarna och installera.
uk: Прийміть стандартні налаштування та інсталюйте.

source: PostgreSQL for Apple MacOS
sv: PostgreSQL för Apple MacOS
uk: PostgreSQL для Apple MacOS

source: For a MacOS install:
sv: För en MacOS-installation:
uk: Для встановлення на MacOS:

source: Go to the `Postgres.app <https://postgresapp.com/>`_ site, and download the latest release.
sv: Gå till webbplatsen `Postgres.app <https://postgresapp.com/>`_ och ladda ner den senaste versionen.
uk: Перейдіть на сайт `Postgres.app <https://postgresapp.com/>`_ і завантажте останню версію.

source: Open the disk image, and drag the **Postgres** icon into the **Applications** folder.
sv: Öppna diskavbildningen och dra ikonen **Postgres** till mappen **Applications**.
uk: Відкрийте образ диска та перетягніть піктограму **Postgres** у папку **Програми**.

source: In the **Applications** folder, double-click the **Postgres** icon to start the server.
sv: I mappen **Applications** dubbelklickar du på ikonen **Postgres** för att starta servern.
uk: У папці **Applications** двічі клацніть піктограму **Postgres**, щоб запустити сервер.

source: Click the **Initialize** button to create a new blank database instance.
sv: Klicka på knappen **Initialize** för att skapa en ny tom databasinstans.
uk: Натисніть кнопку **Ініціалізувати**, щоб створити новий порожній екземпляр бази даних.

source: In the **Applications** folder, go to the **Utilities** folder and open **Terminal**.
sv: I mappen **Applications** går du till mappen **Utilities** och öppnar **Terminal**.
uk: У папці **Програми** перейдіть до папки **Утиліти** та відкрийте **Термінал**.

source: Add the command-line utilities to your `PATH` for convenience.
sv: Lägg till kommandoradsverktygen i din `PATH` för enkelhetens skull.
uk: Для зручності додайте утиліти командного рядка до вашого `PATH`.

source: PgAdmin for Windows and MacOS
sv: PgAdmin för Windows och MacOS
uk: PgAdmin для Windows і MacOS

source: PgAdmin is available for multiple platforms, at https://www.pgadmin.org/download/.
sv: PgAdmin är tillgänglig för flera plattformar på https://www.pgadmin.org/download/.
uk: PgAdmin доступний для різних платформ на сайті https://www.pgadmin.org/download/.

source: Download and install the latest version for your platform.
sv: Ladda ner och installera den senaste versionen för din plattform.
uk: Завантажте та встановіть останню версію для вашої платформи.

source: Start PgAdmin!
sv: Starta PgAdmin!
uk: Запустіть PgAdmin!
