Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/introduction.po
Languages: sv, uk

source: Combined, PostgreSQL provides a very easy development path to add new spatial types. In the proprietary world, only `Illustra <https://en.wikipedia.org/wiki/Illustra>`_ (now Informix Universal Server) allowed such easy extension. This is no coincidence; Illustra is a proprietary re-working of the original PostgreSQL code base from the 1980's.
sv: Kombinerat ger PostgreSQL en mycket enkel utvecklingsväg för att lägga till nya spatiala typer. I den proprietära världen tillät endast `Illustra <https://en.wikipedia.org/wiki/Illustra>`_ (nu Informix Universal Server) så enkel förlängning. Detta är ingen slump; Illustra är en proprietär omarbetning av den ursprungliga PostgreSQL-kodbasen från 1980-talet.
uk: У поєднанні PostgreSQL забезпечує дуже простий шлях розробки для додавання нових просторових типів. У світі пропрієтарного програмного забезпечення тільки `Illustra <https://en.wikipedia.org/wiki/Illustra>`_ (зараз Informix Universal Server) дозволяв таке просте розширення. Це не випадково; Illustra є пропрієтарною переробкою оригінальної кодової бази PostgreSQL 1980-х років.

source: Because the development path for adding types to PostgreSQL was so straightforward, it made sense to start there. When MySQL released basic spatial types in version 4.1, the PostGIS team took a look at their code, and the exercise reinforced the original decision to use PostgreSQL.
sv: Eftersom utvecklingsvägen för att lägga till typer till PostgreSQL var så enkel var det vettigt att börja där. När MySQL släppte grundläggande spatiala typer i version 4.1 tog PostGIS-teamet en titt på sin kod, och övningen förstärkte det ursprungliga beslutet att använda PostgreSQL.
uk: Оскільки шлях розвитку для додавання типів до PostgreSQL був настільки простим, було логічно почати саме звідти. Коли MySQL випустив базові просторові типи у версії 4.1, команда PostGIS ознайомилася з їхнім кодом, і це підкріпило початкове рішення використовувати PostgreSQL.

source: Because MySQL spatial objects had to be hacked on top of the string type as a special case, the MySQL code was spread over the entire code base. Development of PostGIS 0.1 took under a month. Doing a "MyGIS" 0.1 would have taken a lot longer, and as such, might never have seen the light of day.
sv: Eftersom MySQL:s spatiala objekt måste hackas ovanpå strängtypen som ett specialfall, spreds MySQL-koden över hela kodbasen. Utvecklingen av PostGIS 0.1 tog mindre än en månad. Att göra en "MyGIS" 0.1 skulle ha tagit mycket längre tid, och som sådan kanske den aldrig hade sett dagens ljus.
uk: Оскільки просторові об'єкти MySQL довелося хакнути поверх типу string як особливий випадок, код MySQL був розповсюджений по всій кодовій базі. Розробка PostGIS 0.1 зайняла менше місяця. Створення «MyGIS» 0.1 зайняло б набагато більше часу і, як наслідок, могло б ніколи не побачити світ.

source: Why not files?
sv: Varför inte filer?
uk: Чому не файли?

source: The `Shapefile <http://en.wikipedia.org/wiki/Shapefile>`_ (and other formats like the Esri File Geodatabase and the `GeoPackage <https://www.geopackage.org/>`_) have been a standard way of storing and interacting with spatial data since GIS software was first written. However, these "flat" files have the following disadvantages:
sv: Shapefile <http://en.wikipedia.org/wiki/Shapefile>`_ (och andra format som Esri File Geodatabase och `GeoPackage <https://www.geopackage.org/>`_) har varit ett standardiserat sätt att lagra och interagera med spatiala data sedan GIS-programvaran först skrevs. Dessa "platta" filer har dock följande nackdelar:
uk: Формат Shapefile <http://en.wikipedia.org/wiki/Shapefile>_ (та інші формати, такі як Esri File Geodatabase та GeoPackage <https://www.geopackage.org/>_) є стандартним способом зберігання та взаємодії з просторовими даними з моменту створення першого програмного забезпечення GIS. Однак ці «плоскі» файли мають такі недоліки:

source: **Files require special software to read and write.** SQL is an abstraction for random data access and analysis. Without that abstraction, you will need to write all the access and analysis code yourself.
sv: **SQL är en abstraktion för slumpmässig åtkomst till och analys av data. Utan denna abstraktion måste du skriva all åtkomst- och analyskod själv.
uk: **Для читання та запису файлів потрібне спеціальне програмне забезпечення.** SQL — це абстракція для довільного доступу до даних та їх аналізу. Без цієї абстракції вам доведеться самостійно писати весь код для доступу та аналізу.

source: **Concurrent users can cause corruption and slowdowns.** While it's possible to write extra code to ensure that multiple writes to the same file do not corrupt the data, by the time you have solved the problem and also solved the associated performance problem, you will have written the better part of a database system. Why not just use a standard database?
sv: **Samtidiga användare kan orsaka skadat data och fördröjningar.** Det är visserligen möjligt att skriva extra kod för att säkerställa att flera skrivningar till samma fil inte skadar data, men när du har löst problemet och även löst det därmed sammanhängande prestandaproblemet har du skrivit större delen av ett databassystem. Varför inte bara använda en standarddatabas?
uk: **Одночасні користувачі можуть спричинити пошкодження та уповільнення роботи.** Хоча можна написати додатковий код, щоб гарантувати, що багаторазове записування в один і той самий файл не пошкодить дані, до того часу, як ви вирішите цю проблему, а також пов'язану з нею проблему продуктивності, ви вже напишете більшу частину системи бази даних. Чому б просто не використовувати стандартну базу даних?

source: **Complicated questions require complicated software to answer.** Complicated and interesting questions (spatial joins, aggregations, etc) that are expressible in one line of SQL in the database take hundreds of lines of specialized code to answer when programming against files.
sv: **Komplicerade frågor kräver komplicerad programvara för att besvaras.** Komplicerade och intressanta frågor (spatial joins, aggregeringar etc) som kan uttryckas i en SQL-rad i databasen kräver hundratals rader specialiserad kod för att besvaras när man programmerar mot filer.
uk: **Складні питання вимагають складного програмного забезпечення для відповіді.** Складні та цікаві питання (просторові з'єднання, агрегації тощо), які можна виразити в одному рядку SQL у базі даних, вимагають сотень рядків спеціалізованого коду для відповіді при програмуванні з файлами.

source: Most users of PostGIS are setting up systems where multiple applications will be expected to access the data, so having a standard SQL access method simplifies deployment and development. Some users are working with large data sets; with files, they might be segmented into multiple files, but in a database they can be stored as a single large table.
sv: De flesta användare av PostGIS sätter upp system där flera applikationer förväntas komma åt data, så att ha en standard SQL-åtkomstmetod förenklar driftsättning och utveckling. Vissa användare arbetar med stora datamängder; med filer kan de segmenteras i flera filer, men i en databas kan de lagras som en enda stor tabell.
uk: Більшість користувачів PostGIS налаштовують системи, в яких очікується доступ до даних з боку декількох додатків, тому наявність стандартного методу доступу SQL спрощує розгортання та розробку. Деякі користувачі працюють з великими наборами даних; у файлах вони можуть бути розділені на кілька файлів, але в базі даних їх можна зберігати як одну велику таблицю.

source: In summation, the combination of support for multiple users, complex ad hoc queries, and performance on large data sets are what sets spatial databases apart from file-based systems.
sv: Sammanfattningsvis är det kombinationen av stöd för flera användare, komplexa ad hoc-frågor och prestanda för stora datamängder som gör att spatiala databaser skiljer sig från filbaserade system.
uk: Підсумовуючи, поєднання підтримки кількох користувачів, складних ad hoc-запитів та високої продуктивності на великих обсягах даних — ось що відрізняє просторові бази даних від файлових систем.

source: A brief history of PostGIS
sv: En kort historik över PostGIS
uk: Коротка історія PostGIS

source: In the May of 2001, `Refractions Research <http://www.refractions.net/>`_ released the first version of PostGIS. PostGIS 0.1 had objects, indexes and a handful of functions. The result was a database suitable for storage and retrieval, but not analysis.
sv: I maj 2001 släppte `Refractions Research <http://www.refractions.net/>`_ den första versionen av PostGIS. PostGIS 0.1 hade objekt, index och en handfull funktioner. Resultatet var en databas som lämpade sig för lagring och hämtning, men inte för analys.
uk: У травні 2001 року компанія `Refractions Research <http://www.refractions.net/>`_ випустила першу версію PostGIS. PostGIS 0.1 мала об'єкти, індекси та кілька функцій. Результатом стала база даних, придатна для зберігання та пошуку, але не для аналізу.

source: As the number of functions increased, the need for an organizing principle became clear. The "Simple Features for SQL" (:term:`SFSQL`) specification from the Open Geospatial Consortium provided such structure with guidelines for function naming and requirements.
sv: I takt med att antalet funktioner ökade blev behovet av en organiserande princip tydligt. Specifikationen "Simple Features for SQL" (:term:`SFSQL`) från Open Geospatial Consortium gav en sådan struktur med riktlinjer för namngivning av funktioner och krav.
uk: Зі збільшенням кількості функцій стала очевидною необхідність в організації принципу. Специфікація «Прості функції для SQL» (:term:`SFSQL`) від Open Geospatial Consortium надала таку структуру з рекомендаціями щодо найменування функцій та вимог.

source: With PostGIS support for simple analysis and spatial joins, `Mapserver <http://mapserver.org/>`_ became the first external application to provide visualization of data in the database.
sv: Med PostGIS-stöd för enkel analys och spatiala sammankopplingar blev `Mapserver <http://mapserver.org/>`_ den första externa applikationen som gav visualisering av data i databasen.
uk: Завдяки підтримці PostGIS для простого аналізу та просторових з'єднань, `Mapserver <http://mapserver.org/>`_ став першим зовнішнім додатком, що забезпечує візуалізацію даних у базі даних.

source: Over the next several years the number of PostGIS functions grew, but its power remained limited. Many of the most interesting functions (e.g., ST_Intersects(), ST_Buffer(), ST_Union()) were very difficult to code. Writing them from scratch promised years of work.
sv: Under de följande åren ökade antalet PostGIS-funktioner, men dess kraft var fortfarande begränsad. Många av de mest intressanta funktionerna (t.ex. ST_Intersects(), ST_Buffer(), ST_Union()) var mycket svåra att koda. Att skriva dem från grunden lovade åratal av arbete.
uk: Протягом наступних кількох років кількість функцій PostGIS зростала, але його можливості залишалися обмеженими. Багато найцікавіших функцій (наприклад, ST_Intersects(), ST_Buffer(), ST_Union()) було дуже складно запрограмувати. Написання їх з нуля обіцяло роки роботи.

source: Fortunately a second project, the "Geometry Engine, Open Source" or `GEOS <http://trac.osgeo.org/geos>`_, came along. The GEOS library provides the necessary algorithms for implementing the :term:`SFSQL` specification. By linking in GEOS, PostGIS provided complete support for :term:`SFSQL` by version 0.8.
sv: Lyckligtvis kom ett andra projekt, "Geometry Engine, Open Source" eller `GEOS <http://trac.osgeo.org/geos>`_, till. GEOS-biblioteket tillhandahåller de nödvändiga algoritmerna för att implementera :term:`SFSQL`-specifikationen. Genom att länka in GEOS gav PostGIS fullständigt stöd för :term:`SFSQL` i version 0.8.
uk: На щастя, з'явився другий проект, «Geometry Engine, Open Source» або `GEOS <http://trac.osgeo.org/geos>`_. Бібліотека GEOS надає необхідні алгоритми для реалізації специфікації :term:`SFSQL`. Завдяки зв'язку з GEOS, PostGIS забезпечив повну підтримку :term:`SFSQL` у версії 0.8.

source: As PostGIS data capacity grew, another issue surfaced: the representation used to store geometry proved relatively inefficient. For small objects like points and short lines, the metadata in the representation had as much as a 300% overhead. For performance reasons, it was necessary to put the representation on a diet. By shrinking the metadata header and required dimensions, overhead greatly reduced. In PostGIS 1.0, this new, faster, lightweight representation became the default.
sv: När PostGIS datakapacitet växte dök ett annat problem upp: den representation som användes för att lagra geometri visade sig vara relativt ineffektiv. För små objekt som punkter och korta linjer hade metadata i representationen så mycket som 300% overhead. Av prestandaskäl var det nödvändigt att sätta representationen på diet. Genom att krympa metadatahuvudet och de nödvändiga dimensionerna minskade overhead kraftigt. I PostGIS 1.0 blev denna nya, snabbare, lättviktiga representation standard.
uk: Зі збільшенням обсягу даних PostGIS виникла ще одна проблема: представлення, яке використовувалося для зберігання геометрії, виявилося відносно неефективним. Для невеликих об'єктів, таких як точки та короткі лінії, метадані в представленні мали на 300% більше накладних витрат. З міркувань продуктивності було необхідно скоротити представлення. Завдяки зменшенню розміру заголовка метаданих та необхідних розмірів накладні витрати значно зменшилися. У PostGIS 1.0 це нове, швидше та легше представлення стало стандартним.

source: Recent releases of PostGIS continue to add features and performance improvements, as well as support for new features in the PostgreSQL core system.
sv: Nya utgåvor av PostGIS fortsätter att lägga till funktioner och prestandaförbättringar, samt stöd för nya funktioner i PostgreSQL-kärnsystemet.
uk: Останні версії PostGIS продовжують додавати нові функції та покращення продуктивності, а також підтримку нових функцій в основній системі PostgreSQL.

source: Who uses PostGIS?
sv: Vem använder PostGIS?
uk: Хто використовує PostGIS?

source: For a complete list of case studies, see the `PostGIS case studies <https://postgis.net/category/casestudy/>`_ page.
sv: För en fullständig lista över fallstudier, se sidan `PostGIS fallstudier <https://postgis.net/category/casestudy/>`_.
uk: Повний перелік прикладів використання див. на сторінці «Приклади використання PostGIS <https://postgis.net/category/casestudy/>»_.

source: Institut Geographique National, France
sv: Institut Geographique National, Frankrike
uk: Institut Geographique National, Франція

source: IGN is the national mapping agency of France, and uses PostGIS to store the high resolution topographic map of the country, "BDUni". BDUni has more than 100 million features, and is maintained by a staff of over 100 field staff who verify observations and add new mapping to the database daily. The IGN installation uses the database transactional system to ensure consistency during update processes, and a `warm standby system <https://www.postgresql.org/docs/devel/warm-standby.html>`_ to maintain uptime in the event of a system failure.
sv: IGN är Frankrikes nationella kartmyndighet och använder PostGIS för att lagra den högupplösta topografiska kartan över landet, "BDUni". BDUni har mer än 100 miljoner objekt och underhålls av över 100 anställda på fältet som dagligen verifierar observationer och lägger till nya kartor i databasen. IGN-installationen använder databasens transaktionssystem för att säkerställa konsekvens under uppdateringsprocesser, och ett "varmt standbysystem" <https://www.postgresql.org/docs/devel/warm-standby.html>`_ för att upprätthålla drifttiden i händelse av ett systemfel.
uk: IGN — це національне картографічне агентство Франції, яке використовує PostGIS для зберігання топографічної карти країни з високою роздільною здатністю «BDUni». BDUni містить понад 100 мільйонів об'єктів і підтримується штатом із понад 100 польових співробітників, які щодня перевіряють спостереження та додають нові карти до бази даних. Встановлення IGN використовує транзакційну систему бази даних для забезпечення узгодженості під час процесів оновлення, а також «систему теплого резервування <https://www.postgresql.org/docs/devel/warm-standby.html>»_ для підтримання безперебійної роботи в разі збою системи.

source: `RedFin <https://www.redfin.com>`_ is a real estate agency with a web-based service for exploring properties and estimate values. Their system was originally built on MySQL, but they found that moving to PostgreSQL and PostGIS provided `huge benefits in performance and reliability <https://www.redfin.com/news/elephant_versus_dolphin_which_is_faster_which_is_smarter/>`_.
sv: `RedFin <https://www.redfin.com>`_ är en fastighetsbyrå med en webbaserad tjänst för att utforska fastigheter och uppskatta värden. Deras system byggdes ursprungligen på MySQL, men de fann att flyttningen till PostgreSQL och PostGIS gav "stora fördelar i prestanda och tillförlitlighet <https://www.redfin.com/news/elephant_versus_dolphin_which_is_faster_which_is_smarter/>`_.
uk: `RedFin <https://www.redfin.com>`_ — це агентство нерухомості, яке надає веб-сервіс для пошуку об'єктів нерухомості та оцінки їх вартості. Спочатку їхня система була побудована на MySQL, але вони виявили, що перехід на PostgreSQL і PostGIS дав `величезні переваги в продуктивності та надійності <https://www.redfin.com/news/elephant_versus_dolphin_which_is_faster_which_is_smarter/>`_.

source: What applications support PostGIS?
sv: Vilka applikationer stöder PostGIS?
uk: Які програми підтримують PostGIS?

source: PostGIS has become a widely used spatial database, and the number of third-party programs that support storing and retrieving data using it has increased as well. The `programs that support PostGIS <http://trac.osgeo.org/postgis/wiki/UsersWikiToolsSupportPostgis>`_ include both open source and proprietary software on both server and desktop systems.
sv: PostGIS har blivit en allmänt använd spatial databas och antalet tredjepartsprogram som stöder lagring och hämtning av data med hjälp av den har också ökat. Programmen som stöder PostGIS <http://trac.osgeo.org/postgis/wiki/UsersWikiToolsSupportPostgis>`_ inkluderar både öppen källkod och egenutvecklad programvara på både server- och skrivbordssystem.
uk: PostGIS став широко використовуваною просторовою базою даних, і кількість сторонніх програм, що підтримують зберігання та вилучення даних за допомогою нього, також зросла. Програми, що підтримують PostGIS <http://trac.osgeo.org/postgis/wiki/UsersWikiToolsSupportPostgis>_, включають як відкрите, так і пропрієтарне програмне забезпечення як на серверних, так і на настільних системах.

source: The following table shows a list of some of the software that leverages PostGIS:
sv: Följande tabell visar en lista över några av de programvaror som utnyttjar PostGIS:
uk: У наступній таблиці наведено перелік деяких програм, що використовують PostGIS:

source: Open/Free
sv: Öppen/fri
uk: Відкритий/Безкоштовний

source: Closed/Proprietary/Paid services
sv: Stängt/Proprietära/betalda tjänster
uk: Закриті/власні/платні послуги

source: Loading/Extracting
sv: Inläsning/extrahering
uk: Завантаження/вивантаження

source: Web-Based
sv: Web-baserad

source: MapGuide Open Source (using FDO)
sv: MapGuide Open Source (med hjälp av FDO)
uk: MapGuide Open Source (використовуючи FDO)

source: Safe FME Desktop Translator/Converter
sv: Säker FME Desktop-översättare/konverterare

source: Services / DbaaS
sv: Tjänster / DbaaS
uk: Сервіси / DbaaS

source: Aiven for PostgreSQL
sv: Aiven för PostgreSQL

source: Amazon RDS / Aurora for PostgreSQL
sv: Amazon RDS / Aurora för PostgreSQL
uk: Amazon RDS / Aurora для PostgreSQL

source: Microsoft Azure for PostgreSQL
sv: Microsoft Azure för PostgreSQL
uk: Microsoft Azure для PostgreSQL

source: Google Cloud SQL for PostgreSQL
sv: Google Cloud SQL för PostgreSQL
uk: Google Cloud SQL для PostgreSQL

source: Microimages TNTmips GIS
sv: Mikroavbildningar TNTmips GIS
