Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/introduction.po
Languages: sv, uk

source: Introduction
sv: Introduktion
uk: Вступ

source: What is a Spatial Database?
sv: Vad är en spatial databas?
uk: Що таке просторова база даних?

source: PostGIS is a spatial database. Oracle Spatial and SQL Server (2008 and later) are also spatial databases. But what does that mean; what is it that makes an ordinary database a spatial database?
sv: PostGIS är en spatial databas. Oracle Spatial och SQL Server (2008 och senare) är också spatiala databaser. Men vad innebär det, vad är det som gör en vanlig databas till en spatial databas?
uk: PostGIS — це просторова база даних. Oracle Spatial і SQL Server (2008 і пізніші версії) також є просторовими базами даних. Але що це означає? Що саме робить звичайну базу даних просторовою?

source: The short answer, is...
sv: Det korta svaret är...
uk: Коротка відповідь така...

source: **Spatial databases store and manipulate spatial objects like any other object in the database.**
sv: **Spatiala databaser lagrar och manipulerar spatiala objekt som vilket annat objekt som helst i databasen.**
uk: **Просторові бази даних зберігають і обробляють просторові об'єкти так само, як і будь-які інші об'єкти в базі даних.**

source: The following briefly covers the evolution of spatial databases, and then reviews three aspects that associate *spatial* data with a database -- data types, indexes, and functions.
sv: I det följande beskrivs kortfattat utvecklingen av spatiala databaser och sedan granskas tre aspekter som associerar *spatiala* data med en databas - datatyper, index och funktioner.
uk: Нижче коротко розглядається еволюція просторових баз даних, а потім аналізуються три аспекти, що пов'язують *просторові* дані з базою даних — типи даних, індекси та функції.

source: **Spatial data types** refer to shapes such as point, line, and polygon;
sv: **Spatiala datatyper** hänvisar till former som punkt, linje och polygon;
uk: **Типи просторових даних** відносяться до фігур, таких як точка, лінія та багатокутник;

source: Multi-dimensional **spatial indexing** is used for efficient processing of spatial operations;
sv: Flerdimensionell **spatial indexering** används för effektiv bearbetning av spatiala operationer;
uk: Для ефективної обробки просторових операцій використовується багатовимірне **просторове індексування**;

source: **Spatial functions**, posed in :term:`SQL`, are for querying of spatial properties and relationships.
sv: **Spatial functions**, som ingår i :term:`SQL`, är till för att ställa frågor om spatiala egenskaper och relationer.
uk: **Просторові функції**, задані в :term:`SQL`, призначені для запиту просторових властивостей і взаємозв'язків.

source: Combined, spatial data types, indexes, and functions provide a flexible structure for optimized performance and analysis.
sv: Kombinationen av spatiala datatyper, index och funktioner ger en flexibel struktur för optimerad prestanda och analys.
uk: У поєднанні типи просторових даних, індекси та функції забезпечують гнучку структуру для оптимізації продуктивності та аналізу.

source: In the Beginning
sv: I början
uk: На початку

source: In legacy first-generation :term:`GIS` implementations, all spatial data is stored in flat files and special :term:`GIS` software is required to interpret and manipulate the data. These first-generation management systems are designed to meet the needs of users where all required data is within the user's organizational domain. They are proprietary, self-contained systems specifically built for handling spatial data.
sv: I äldre första generationens :term:`GIS`-implementeringar lagras alla spatiala data i platta filer och det krävs speciell :term:`GIS`-programvara för att tolka och manipulera data. Dessa första generationens ledningssystem är utformade för att tillgodose användarnas behov där alla nödvändiga data finns inom användarens organisatoriska domän. De är proprietära, fristående system som är speciellt byggda för att hantera spatiala data.
uk: У застарілих реалізаціях :term:`GIS` першого покоління всі просторові дані зберігаються у плоских файлах, а для їх інтерпретації та обробки потрібне спеціальне програмне забезпечення :term:`GIS`. Ці системи управління першого покоління розроблені для задоволення потреб користувачів, у яких усі необхідні дані знаходяться в межах організаційної домену користувача. Вони є пропрієтарними, автономними системами, спеціально створеними для обробки просторових даних.

source: Second-generation spatial systems store some data in relational databases (usually the "attribute" or non-spatial parts) but still lack the flexibility afforded with direct integration.
sv: Andra generationens spatiala system lagrar vissa data i relationsdatabaser (vanligtvis "attribut" eller icke-spatiala delar) men saknar fortfarande den flexibilitet som direkt integration ger.
uk: Просторові системи другого покоління зберігають деякі дані в реляційних базах даних (зазвичай «атрибути» або непросторові частини), але все ще не мають гнучкості, яку забезпечує пряма інтеграція.

source: **True spatial databases were born when people started to treat spatial features as first class database objects.**
sv: **Äkta spatiala databaser föddes när man började behandla spatiala egenskaper som förstklassiga databasobjekt.**
uk: **Справжні просторові бази даних з'явилися, коли люди почали розглядати просторові об'єкти як об'єкти першокласних баз даних.**

source: Spatial databases fully integrate spatial data with a relational database. The system orientation changes from GIS-centric to database-centric.
sv: Spatiala databaser integrerar helt spatiala data med en relationsdatabas. Systemets orientering ändras från GIS-centrerat till databascentrerat.
uk: Просторові бази даних повністю інтегрують просторові дані з реляційною базою даних. Орієнтація системи змінюється з орієнтованої на ГІС на орієнтовану на базу даних.

source: A spatial database management system may be used in applications besides the geographic world. Spatial databases are used to manage data related to the anatomy of the human body, large-scale integrated circuits, molecular structures, and electro-magnetic fields, among others.
sv: Ett system för hantering av spatiala databaser kan användas i andra tillämpningar än den geografiska världen. Spatiala databaser används bland annat för att hantera data som rör människokroppens anatomi, storskaliga integrerade kretsar, molekylära strukturer och elektromagnetiska fält.
uk: Система управління просторовими базами даних може використовуватися в застосунках, що не стосуються географічного світу. Просторові бази даних використовуються для управління даними, пов'язаними, зокрема, з анатомією людського тіла, великомасштабними інтегральними схемами, молекулярними структурами та електромагнітними полями.

source: Spatial Data Types
sv: Typer av spatiala data
uk: Типи просторових даних

source: An ordinary database has strings, numbers, and dates. A spatial database adds additional (spatial) types for representing **geographic features**. These spatial data types abstract and encapsulate spatial structures such as boundary and dimension. In many respects, spatial data types can be understood simply as shapes.
sv: En vanlig databas har strängar, siffror och datum. En spatial databas lägger till ytterligare (spatiala) typer för att representera **geografiska egenskaper**. Dessa spatiala datatyper abstraherar och kapslar in spatiala strukturer som gränser och dimensioner. I många avseenden kan spatiala datatyper helt enkelt förstås som former.
uk: Звичайна база даних містить рядки, числа та дати. Просторова база даних додає додаткові (просторові) типи для представлення **географічних об'єктів**. Ці просторові типи даних абстрагують та інкапсулюють просторові структури, такі як межі та розміри. У багатьох відношеннях просторові типи даних можна просто розуміти як фігури.

source: Spatial data types are organized in a type hierarchy. Each sub-type inherits the structure (attributes) and the behavior (methods or functions) of its super-type.
sv: Spatiala datatyper är organiserade i en typhierarki. Varje subtyp ärver strukturen (attributen) och beteendet (metoderna eller funktionerna) hos sin supertyp.
uk: Типи просторових даних організовані в ієрархію типів. Кожен підтип успадковує структуру (атрибути) та поведінку (методи або функції) свого супертипу.

source: Spatial Indexes and Bounding Boxes
sv: Spatiala index och avgränsande boxar
uk: Просторові індекси та обмежувальні прямокутники

source: An ordinary database provides **indexes** to allow for fast and random access to subsets of data. Indexing for standard types (numbers, strings, dates) is usually done with `B-tree <http://en.wikipedia.org/wiki/B-tree>`_ indexes.
sv: En vanlig databas tillhandahåller **index** för att möjliggöra snabb och slumpmässig åtkomst till delmängder av data. Indexering för standardtyper (tal, strängar, datum) görs vanligtvis med index av typen `B-tree <http://en.wikipedia.org/wiki/B-tree>`_.
uk: Звичайна база даних надає **індекси**, що забезпечують швидкий і довільний доступ до підмножин даних. Індексування стандартних типів (числа, рядки, дати) зазвичай виконується за допомогою `B-tree <http://en.wikipedia.org/wiki/B-tree>`_індексів.

source: A B-tree partitions the data using the natural sort order to put the data into a hierarchical tree. The natural sort order of numbers, strings, and dates is simple to determine -- every value is less than, greater than or equal to every other value.
sv: Ett B-träd delar upp data med hjälp av den naturliga sorteringsordningen för att placera data i ett hierarkiskt träd. Den naturliga sorteringsordningen för tal, strängar och datum är enkel att fastställa - varje värde är mindre än, större än eller lika med alla andra värden.
uk: B-дерево розділяє дані, використовуючи природний порядок сортування, щоб розмістити дані в ієрархічному дереві. Природний порядок сортування чисел, рядків і дат визначити просто — кожне значення менше, більше або дорівнює кожному іншому значенню.

source: But because polygons can overlap, can be contained in one another, and are arrayed in a two-dimensional (or more) space, a B-tree cannot be used to efficiently index them. Real spatial databases provide a "spatial index" that instead answers the question "which objects are within this particular bounding box?".
sv: Men eftersom polygoner kan överlappa varandra, kan vara inneslutna i varandra och är placerade i ett tvådimensionellt (eller mer) utrymme kan ett B-träd inte användas för att effektivt indexera dem. Riktiga spatiala databaser tillhandahåller ett "spatialt index" som i stället svarar på frågan "vilka objekt finns inom den här avgränsande rutan?".
uk: Але оскільки полігони можуть перекриватися, міститися один в одному і розташовуватися у двовимірному (або більш вимірному) просторі, B-дерево не може бути використане для їх ефективного індексування. Реальні просторові бази даних надають «просторовий індекс», який замість цього відповідає на питання «які об'єкти знаходяться в межах цієї конкретної обмежувальної рамки?».

source: A **bounding box** is the smallest rectangle -- parallel to the coordinate axes -- capable of containing a given feature.
sv: En **bounding box** är den minsta rektangel - parallell med koordinataxlarna - som kan innehålla en given funktion.
uk: **Обмежувальна рамка** — це найменший прямокутник, паралельний осям координат, який може вмістити задану фігуру.

source: Bounding boxes are used because answering the question "is A inside B?" is very computationally intensive for polygons but very fast in the case of rectangles. Even the most complex polygons and linestrings can be represented by a simple bounding box.
sv: Bounding boxes används eftersom svaret på frågan "är A inuti B?" är mycket beräkningsintensivt för polygoner men mycket snabbt när det gäller rektanglar. Även de mest komplexa polygonerna och linjestringarna kan representeras av en enkel bounding box.
uk: Обмежувальні рамки використовуються тому, що відповідь на питання «чи знаходиться A всередині B?» є дуже обчислювально інтенсивною для багатокутників, але дуже швидкою у випадку прямокутників. Навіть найскладніші багатокутники та лінійні ланцюжки можуть бути представлені простим обмежувальним рамкою.

source: Indexes have to perform quickly in order to be useful. So instead of providing exact results, as B-trees do, spatial indexes provide approximate results. The question "what lines are inside this polygon?" will be instead interpreted by a spatial index as "what lines have bounding boxes that are contained inside this polygon's bounding box?"
sv: Index måste fungera snabbt för att vara användbara. Så i stället för att ge exakta resultat, som B-träd gör, ger spatiala index ungefärliga resultat. Frågan "vilka linjer finns inuti den här polygonen?" tolkas istället av ett spatialt index som "vilka linjer har begränsningsboxar som finns inuti den här polygonens begränsningsbox?"
uk: Індекси повинні працювати швидко, щоб бути корисними. Тому замість того, щоб надавати точні результати, як це роблять B-дерева, просторові індекси надають приблизні результати. Питання «які лінії знаходяться всередині цього багатокутника?» буде інтерпретуватися просторовим індексом як «які лінії мають обмежувальні рамки, що містяться всередині обмежувальної рамки цього багатокутника?»

source: The actual spatial indexes implemented by various databases vary widely. The most common implementations are the `R-Tree <http://en.wikipedia.org/wiki/R-tree>`_ and `Quadtree <http://en.wikipedia.org/wiki/Quadtree>`_ (used in PostGIS), but there are also `grid-based indexes <http://en.wikipedia.org/wiki/Grid_(spatial_index)>`_ and `GeoHash indexes <https://en.wikipedia.org/wiki/Geohash>`_ implemented in other spatial databases.
sv: De faktiska spatiala index som implementeras av olika databaser varierar mycket. De vanligaste implementationerna är `R-Tree <http://en.wikipedia.org/wiki/R-tree>`_ och `Quadtree <http://en.wikipedia.org/wiki/Quadtree>`_ (används i PostGIS), men det finns också `gridbaserade index <http://en.wikipedia.org/wiki/Grid_(spatial_index)>`_ och `GeoHash-index <https://en.wikipedia.org/wiki/Geohash>`_ som implementerats i andra spatiala databaser.
uk: Фактичні просторові індекси, що реалізуються різними базами даних, сильно відрізняються між собою. Найпоширенішими реалізаціями є `R-Tree <http://en.wikipedia.org/wiki/R-tree>`_ та `Quadtree <http://en.wikipedia.org/wiki/Quadtree>`_ (використовується в PostGIS), але є також `індекси на основі сітки <http://en.wikipedia.org/wiki/Grid_(spatial_index)>`_ та `індекси GeoHash <https://en.wikipedia.org/wiki/Geohash>`_, реалізовані в інших просторових базах даних.

source: Spatial Functions
sv: Spatiala funktioner
uk: Просторові функції

source: For manipulating data during a query, an ordinary database provides **functions** such as concatenating strings, performing hash operations on strings, doing mathematics on numbers, and extracting information from dates.
sv: För att manipulera data under en sökning tillhandahåller en vanlig databas **funktioner** som att sammanfoga strängar, utföra hashoperationer på strängar, göra matematik på siffror och extrahera information från datum.
uk: Для обробки даних під час запиту звичайна база даних надає **функції**, такі як об'єднання рядків, виконання хеш-операцій над рядками, математичні операції над числами та вилучення інформації з дат.

source: A spatial database provides a complete set of functions for analyzing geometric components, determining spatial relationships, and manipulating geometries. These spatial functions serve as the building block for any spatial project.
sv: En spatial databas innehåller en komplett uppsättning funktioner för att analysera geometriska komponenter, fastställa spatiala relationer och manipulera geometrier. Dessa spatiala funktioner fungerar som byggstenar för alla spatiala projekt.
uk: Просторова база даних надає повний набір функцій для аналізу геометричних компонентів, визначення просторових взаємозв'язків та маніпулювання геометріями. Ці просторові функції слугують основою для будь-якого просторового проекту.

source: The majority of all spatial functions can be grouped into one of the following five categories:
sv: Majoriteten av alla spatiala funktioner kan grupperas i någon av följande fem kategorier:
uk: Більшість усіх просторових функцій можна об'єднати в одну з п'яти наступних категорій:

source: **Conversion**: Functions that *convert* between geometries and external data formats.
sv: **Konvertering**: Funktioner som *konverterar* mellan geometrier och externa dataformat.
uk: **Перетворення**: Функції, що *перетворюють* геометрії та зовнішні формати даних.

source: **Management**: Functions that *manage* information about spatial tables and PostGIS administration.
sv: **Hantering**: Funktioner som *hanterar* information om spatiala tabeller och PostGIS-administration.
uk: **Управління**: Функції, що *управляють* інформацією про просторові таблиці та адміністрування PostGIS.

source: **Retrieval**: Functions that *retrieve* properties and measurements of a Geometry.
sv: **Hämtning**: Funktioner som *hämtar* egenskaper och mått för en Geometri.
uk: **Отримання**: Функції, які *отримують* властивості та виміри геометрії.

source: **Comparison**: Functions that *compare* two geometries with respect to their spatial relation.
sv: **Jämförelse**: Funktioner som *jämför* två geometrier med avseende på deras spatiala relation.
uk: **Порівняння**: Функції, які *порівнюють* дві геометрії щодо їх просторового відношення.

source: **Generation**: Functions that *generate* new geometries from others.
sv: **Generering**: Funktioner som *genererar* nya geometrier från andra.
uk: **Генерація**: Функції, які *генерують* нові геометрії на основі інших.

source: The list of possible functions is very large, but a common set of functions is defined by the :term:`OGC` :term:`SFSQL` and implemented (along with additional useful functions) by PostGIS.
sv: Listan över möjliga funktioner är mycket lång, men en gemensam uppsättning funktioner definieras av :term:`OGC` :term:`SFSQL` och implementeras (tillsammans med ytterligare användbara funktioner) av PostGIS.
uk: Список можливих функцій дуже великий, але загальний набір функцій визначається :term:`OGC` :term:`SFSQL` і реалізується (разом з додатковими корисними функціями) PostGIS.

source: What is PostGIS?
sv: Vad är PostGIS?
uk: Що таке PostGIS?

source: PostGIS turns the `PostgreSQL <http://www.postgresql.org/>`_ Database Management System into a spatial database by adding support for the three features: spatial types, spatial indexes, and spatial functions. Because it is built on PostgreSQL, PostGIS automatically inherits important "enterprise" features as well as open standards for implementation.
sv: PostGIS förvandlar `PostgreSQL <http://www.postgresql.org/>`_ Database Management System till en spatial databas genom att lägga till stöd för de tre funktionerna: spatiala typer, spatiala index och spatiala funktioner. Eftersom det är byggt på PostgreSQL ärver PostGIS automatiskt viktiga "företagsfunktioner" såväl som öppna standarder för implementering.
uk: PostGIS перетворює систему управління базами даних `PostgreSQL <http://www.postgresql.org/>`_ на просторову базу даних, додаючи підтримку трьох функцій: просторових типів, просторових індексів та просторових функцій. Оскільки PostGIS побудований на базі PostgreSQL, він автоматично успадковує важливі «корпоративні» функції, а також відкриті стандарти реалізації.

source: But what is PostgreSQL?
sv: Men vad är PostgreSQL?
uk: Але що таке PostgreSQL?

source: PostgreSQL is a powerful relational database management system (RDBMS). It is released under a BSD-style license and is thus free and open source software. As with many other open source programs, PostgreSQL is not controlled by any single company, but has a `global community of developers <https://www.postgresql.org/community/contributors/>`_ and companies to develop it.
sv: PostgreSQL är ett kraftfullt system för hantering av relationsdatabaser (RDBMS). Den släpps under en BSD-stillicens och är därmed gratis och öppen källkodsprogramvara. Som med många andra program med öppen källkod kontrolleras PostgreSQL inte av något enda företag, utan har en "global gemenskap av utvecklare <https://www.postgresql.org/community/contributors/>`_ och företag för att utveckla den.
uk: PostgreSQL — це потужна система управління реляційними базами даних (СУБД). Вона випускається під ліцензією типу BSD і, отже, є безкоштовним програмним забезпеченням з відкритим кодом. Як і багато інших програм з відкритим кодом, PostgreSQL не контролюється жодною окремою компанією, а має «глобальну спільноту розробників <https://www.postgresql.org/community/contributors/>»_ та компаній, які займаються її розробкою.

source: PostgreSQL was designed from the very start with type extension in mind -- the ability to add new data types, functions and indexes at run-time. Because of this, the PostGIS extension can be developed by a separate development team, yet still integrate very tightly into the core PostgreSQL database.
sv: PostgreSQL designades från början med typförlängning i åtanke - möjligheten att lägga till nya datatyper, funktioner och index vid körning. På grund av detta kan PostGIS-tillägget utvecklas av ett separat utvecklingsteam, men ändå integreras mycket tätt i kärnan i PostgreSQL-databasen.
uk: PostgreSQL з самого початку розроблявся з урахуванням розширення типів — можливості додавати нові типи даних, функції та індекси під час виконання. Завдяки цьому розширення PostGIS може розроблятися окремою командою розробників, але при цьому дуже тісно інтегруватися в основну базу даних PostgreSQL.

source: Why choose PostgreSQL?
sv: Varför välja PostgreSQL?
uk: Чому варто вибрати PostgreSQL?

source: A common question from people familiar with open source databases is, "Why wasn't PostGIS built on MySQL?".
sv: En vanlig fråga från personer som känner till databaser med öppen källkod är: "Varför byggdes inte PostGIS på MySQL?".
uk: Часто зустрічається питання від людей, які знайомі з базами даних з відкритим кодом: «Чому PostGIS не було побудовано на MySQL?».

source: PostgreSQL has:
sv: PostgreSQL har det:
uk: PostgreSQL має:

source: Proven reliability and transactional integrity by default (ACID)
sv: Beprövad tillförlitlighet och transaktionsintegritet som standard (ACID)
uk: Доведена надійність і цілісність транзакцій за замовчуванням (ACID)

source: Careful support for SQL standards (full SQL92)
sv: Noggrannt stöd för SQL-standarder (full SQL92)
uk: Ретельна підтримка стандартів SQL (повний SQL92)

source: Pluggable type extension and function extension
sv: Pluggbar typförlängning och funktionsförlängning
uk: Розширюваність типу підключення та розширюваність функцій

source: Community-oriented development model
sv: Modell för samhällsorienterad utveckling
uk: Модель розвитку, орієнтована на спільноту

source: No limit on column sizes ("TOAST"able tuples) to support big GIS objects
sv: Ingen begränsning av kolumnstorlekar ("TOAST"-duples) för att stödja stora GIS-objekt
uk: Немає обмежень на розмір стовпців (tuples, що підтримують TOAST) для підтримки великих об'єктів GIS

source: Generic index structure (GiST) to allow R-Tree index
sv: Generisk indexstruktur (GiST) för att möjliggöra R-Tree-index
uk: Generic index structure (GiST) для забезпечення індексу R-Tree

source: Easy to add custom functions
sv: Enkelt att lägga till anpassade funktioner
uk: Легко додавати власні функції
