Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/joins.po
Languages: es, sv

source: Spatial Joins
es: Joins Espaciales
sv: Spatiala sammanfogningar

source: Spatial joins are the bread-and-butter of spatial databases. They allow you to combine information from different tables by using spatial relationships as the join key. Much of what we think of as "standard GIS analysis" can be expressed as spatial joins.
es: Las uniones espaciales son el pan de cada día de las bases de datos espaciales. Permiten combinar información de diferentes tablas usando relaciones espaciales como la clave de unión. Gran parte de lo que consideramos "análisis GIS estándar" puede expresarse como uniones espaciales.
sv: Spatial joins är själva grundbulten i spatiala databaser. De gör att du kan kombinera information från olika tabeller genom att använda spatiala relationer som länknyckel. Mycket av det vi tänker på som "standard GIS-analys" kan uttryckas som spatiala joins.

source: In the previous section, we explored spatial relationships using a two-step process: first we extracted a subway station point for 'Broad St'; then, we used that point to ask further questions such as "what neighborhood is the 'Broad St' station in?"
es: En la sección anterior, exploramos relaciones espaciales usando un proceso de dos pasos: primero extrajimos un punto de estación de metro para 'Broad St'; luego, usamos ese punto para hacer más preguntas como "¿en qué vecindario está la estación 'Broad St'?"
sv: I föregående avsnitt utforskade vi spatiala relationer med hjälp av en tvåstegsprocess: först extraherade vi en tunnelbanestationspunkt för "Broad St"; sedan använde vi den punkten för att ställa ytterligare frågor som "i vilket område ligger stationen 'Broad St'?"

source: Using a spatial join, we can answer the question in one step, retrieving information about the subway station and the neighborhood that contains it:
es: Usando una unión espacial, podemos responder la pregunta en un solo paso, recuperando información sobre la estación de metro y el vecindario que la contiene:
sv: Med hjälp av en spatial join kan vi besvara frågan i ett steg och hämta information om tunnelbanestationen och det område där den ligger:

source: We could have joined every subway station to its containing neighborhood, but in this case we wanted information about just one. Any function that provides a true/false relationship between two tables can be used to drive a spatial join, but the most commonly used ones are: :command:`ST_Intersects`, :command:`ST_Contains`, and :command:`ST_DWithin`.
es: Podríamos haber unido cada estación de metro con su vecindario contenedor, pero en este caso queríamos información solo de una. Cualquier función que proporcione una relación verdadero/falso entre dos tablas puede usarse para realizar una unión espacial, pero las más comúnmente usadas son: :command:`ST_Intersects`, :command:`ST_Contains`, y :command:`ST_DWithin`.
sv: Vi kunde ha länkat varje tunnelbanestation till dess närområde, men i det här fallet ville vi bara ha information om en station. Alla funktioner som ger en sann/falsk relation mellan två tabeller kan användas för att driva en spatial join, men de vanligaste är: :command:`ST_Intersects`, :command:`ST_Contains` och :command:`ST_DWithin`.

source: Join and Summarize
es: Unir y resumir
sv: Sammanfoga och sammanfatta

source: The combination of a ``JOIN`` with a ``GROUP BY`` provides the kind of analysis that is usually done in a GIS system.
es: La combinación de un ``JOIN`` con un ``GROUP BY`` proporciona el tipo de análisis que usualmente se hace en un SIG.
sv: Kombinationen av en ``JOIN`` med en ``GROUP BY`` ger den typ av analys som vanligtvis görs i ett GIS-system.

source: For example: **"What is the population and racial make-up of the neighborhoods of Manhattan?"** Here we have a question that combines information from about population from the census with the boundaries of neighborhoods, with a restriction to just one borough of Manhattan.
es: Por ejemplo: **"¿Cuál es la población y la composición racial de los vecindarios de Manhattan?"** Aquí tenemos una pregunta que combina información de la población del censo con los límites de los vecindarios, con una restricción a solo un distrito de Manhattan.
sv: Till exempel: **"Hur ser befolkningen och rassammansättningen ut i stadsdelarna på Manhattan?"** Här har vi en fråga som kombinerar information om befolkning från folkräkningen med stadsdelarnas gränser, med en begränsning till bara en stadsdel på Manhattan.

source: What's going on here? Notionally (the actual evaluation order is optimized under the covers by the database) this is what happens:
es: ¿Qué está pasando aquí? En teoría (el orden de evaluación real es optimizado internamente por la base de datos) esto es lo que ocurre:
sv: Vad är det som händer här? Notionellt (den faktiska utvärderingsordningen optimeras under täckmantel av databasen) är detta vad som händer:

source: The ``JOIN`` clause creates a virtual table that includes columns from both the neighborhoods and census tables.
es: La cláusula ``JOIN`` crea una tabla virtual que incluye columnas tanto de la tabla de vecindarios como de la tabla del censo.
sv: Klausulen ``JOIN`` skapar en virtuell tabell som innehåller kolumner från både grannskaps- och folkräkningstabellerna.

source: The ``WHERE`` clause filters our virtual table to just rows in Manhattan.
es: La cláusula ``WHERE`` filtra nuestra tabla virtual a solo filas en Manhattan.
sv: Klausulen ``WHERE`` filtrerar vår virtuella tabell till bara rader på Manhattan.

source: The remaining rows are grouped by the neighborhood name and fed through the aggregation function to :command:`Sum()` the population values.
es: Las filas restantes se agrupan por el nombre del vecindario y se procesan a través de la función de agregación :command:`Sum()` de los valores de población.
sv: De återstående raderna grupperas efter grannskapsnamnet och matas genom aggregeringsfunktionen till :command:`Sum()` populationsvärdena.

source: After a little arithmetic and formatting (e.g., ``GROUP BY``, ``ORDER BY``) on the final numbers, our query spits out the percentages.
es: Después de un poco de aritmética y formato (por ejemplo, ``GROUP BY``, ``ORDER BY``) sobre los números finales, nuestra consulta arroja los porcentajes.
sv: Efter lite aritmetik och formatering (t.ex. ``GROUP BY``, ``ORDER BY``) på de slutliga siffrorna spottar vår fråga ut procentsatserna.

source: The ``JOIN`` clause combines two ``FROM`` items. By default, we are using an ``INNER JOIN``, but there are four other types of joins. For further information see the `join_type <http://www.postgresql.org/docs/9.1/interactive/sql-select.html#SQL-FROM>`_ definition in the PostgreSQL documentation.
es: La cláusula ``JOIN`` combina dos elementos de ``FROM``. Por defecto, estamos usando un ``INNER JOIN``, pero hay otros cuatro tipos de joins. Para más información ver la definición de `join_type <http://www.postgresql.org/docs/9.1/interactive/sql-select.html#SQL-FROM>`_ en la documentación de PostgreSQL.
sv: Klausulen ``JOIN`` kombinerar två ``FROM``-objekt. Som standard använder vi en ``INNER JOIN``, men det finns fyra andra typer av sammanfogningar. För mer information se definitionen av `join_type <http://www.postgresql.org/docs/9.1/interactive/sql-select.html#SQL-FROM>`_ i PostgreSQL-dokumentationen.

source: We can also use distance tests as a join key, to create summarized "all items within a radius" queries. Let's explore the racial geography of New York using distance queries.
es: También podemos usar pruebas de distancia como clave de unión, para crear consultas resumidas de "todos los elementos dentro de un radio". Exploremos la geografía racial de Nueva York usando consultas de distancia.
sv: Vi kan också använda avståndstester som en join-nyckel för att skapa sammanfattade "alla objekt inom en radie"-frågor. Låt oss utforska New Yorks rasgeografi med hjälp av avståndsfrågor.

source: First, let's get the baseline racial make-up of the city.
es: Primero, obtengamos la composición racial de referencia de la ciudad.
sv: Låt oss först ta reda på hur stadens rasmässiga sammansättning ser ut.

source: So, of the 8M people in New York, about 44% are recorded as "white" and 26% are recorded as "black".
es: Así, de los 8 millones de personas en Nueva York, aproximadamente 44% están registradas como "blancas" y 26% están registradas como "negras".
sv: Så av de 8 miljoner människorna i New York registreras cirka 44% som "vita" och 26% som "svarta".

source: Duke Ellington once sang that "You / must take the A-train / To / go to Sugar Hill way up in Harlem." As we saw earlier, Harlem has far and away the highest African-American population in Manhattan (80.5%). Is the same true of Duke's A-train?
es: Duke Ellington una vez cantó "You / must take the A-train / To / go to Sugar Hill way up in Harlem." Como vimos antes, Harlem tiene por mucho la mayor población afroamericana en Manhattan (80.5%). ¿Es lo mismo cierto para el tren A de Duke?
sv: Duke Ellington sjöng en gång att "Du / måste ta A-tåget / för att / åka till Sugar Hill långt uppe i Harlem." Som vi såg tidigare har Harlem den överlägset högsta andelen afroamerikaner på Manhattan (80,5%). Gäller samma sak för Dukes A-train?

source: First, note that the contents of the ``nyc_subway_stations`` table ``routes`` field is what we are interested in to find the A-train. The values in there are a little complex.
es: Primero, nota que el contenido del campo ``routes`` de la tabla ``nyc_subway_stations`` es lo que nos interesa para encontrar el tren A. Los valores allí son un poco complejos.
sv: Observera först att det är innehållet i fältet ``routes`` i tabellen ``nyc_subway_stations`` som vi är intresserade av för att hitta A-tåget. Värdena där inne är lite komplexa.

source: The ``DISTINCT`` keyword eliminates duplicate rows from the result. Without the ``DISTINCT`` keyword, the query above identifies 491 results instead of 73.
es: La palabra clave ``DISTINCT`` elimina filas duplicadas del resultado. Sin la palabra clave ``DISTINCT``, la consulta anterior identifica 491 resultados en lugar de 73.
sv: Nyckelordet ``DISTINCT`` eliminerar duplicerade rader från resultatet. Utan nyckelordet ``DISTINCT`` identifierar frågan ovan 491 resultat istället för 73.

source: So to find the A-train, we will want any row in ``routes`` that has an 'A' in it. We can do this a number of ways, but today we will use the fact that :command:`strpos(routes,'A')` will return a non-zero number only if 'A' is in the ``routes`` field.
es: Así que para encontrar el tren A, queremos cualquier fila en ``routes`` que tenga una 'A'. Podemos hacerlo de varias formas, pero hoy usaremos el hecho de que :command:`strpos(routes,'A')` devolverá un número distinto de cero solo si 'A' está en el campo ``routes``.
sv: Så för att hitta A-tåget vill vi ha alla rader i ``routes`` som har ett 'A' i sig. Vi kan göra detta på ett antal olika sätt, men idag kommer vi att använda det faktum att :command:`strpos(routes,'A')` kommer att returnera ett tal som inte är noll endast om 'A' finns i fältet ``routes``.

source: Let's summarize the racial make-up of within 200 meters of the A-train line.
es: Resumamos la composición racial dentro de 200 metros de la línea del tren A.
sv: Låt oss sammanfatta rasblandningen inom 200 meter från A-tågslinjen.

source: So the racial make-up along the A-train isn't radically different from the make-up of New York City as a whole.
es: Así que la composición racial a lo largo del tren A no es radicalmente diferente de la composición de la ciudad de Nueva York en su conjunto.
sv: Så rassammansättningen längs A-train skiljer sig inte radikalt från sammansättningen i New York City som helhet.

source: Advanced Join
es: Joins avanzados
sv: Avancerad join

source: In the last section we saw that the A-train didn't serve a population that differed much from the racial make-up of the rest of the city. Are there any trains that have a non-average racial make-up?
es: En la última sección vimos que el tren A no servía a una población que difiriera mucho de la composición racial del resto de la ciudad. ¿Hay algunos trenes que tengan una composición racial no promedio?
sv: I förra avsnittet såg vi att A-tåget inte trafikerade en befolkning som skilde sig mycket från rassammansättningen i resten av staden. Finns det några tåg som har en rassammansättning som avviker från genomsnittet?

source: To answer that question, we'll add another join to our query, so that we can simultaneously calculate the make-up of many subway lines at once. To do that, we'll need to create a new table that enumerates all the lines we want to summarize.
es: Para responder a esa pregunta, añadiremos otra unión a nuestra consulta, de modo que podamos calcular simultáneamente la composición de muchas líneas de metro a la vez. Para hacer eso, necesitaremos crear una nueva tabla que enumere todas las líneas que queremos resumir.
sv: För att svara på den frågan lägger vi till ytterligare en länk i vår fråga, så att vi samtidigt kan beräkna sammansättningen av många tunnelbanelinjer på en gång. För att göra det måste vi skapa en ny tabell som räknar upp alla de linjer vi vill sammanfatta.

source: Now we can join the table of subway lines onto our original query.
es: Ahora podemos unir la tabla de líneas de metro a nuestra consulta original.
sv: Nu kan vi koppla tabellen med tunnelbanelinjer till vår ursprungliga fråga.

source: As before, the joins create a virtual table of all the possible combinations available within the constraints of the ``JOIN ON`` restrictions, and those rows are then fed into a ``GROUP`` summary. The spatial magic is in the ``ST_DWithin`` function, that ensures only census blocks close to the appropriate subway stations are included in the calculation.
es: Como antes, las uniones crean una tabla virtual de todas las combinaciones posibles disponibles dentro de las restricciones de ``JOIN ON``, y esas filas luego se pasan a un resumen con ``GROUP``. La magia espacial está en la función ``ST_DWithin``, que asegura que solo los bloques censales cercanos a las estaciones de metro apropiadas se incluyan en el cálculo.
sv: Som tidigare skapar sammanfogningarna en virtuell tabell med alla möjliga kombinationer som är tillgängliga inom ramen för begränsningarna i ``JOIN ON``, och dessa rader matas sedan in i en ``GROUP``-sammanfattning. Den spatiala magin ligger i funktionen ``ST_DWithin``, som säkerställer att endast folkbokföringsblock nära de lämpliga tunnelbanestationerna ingår i beräkningen.

source: Function List
es: Lista de funciones
sv: Funktionslista

source: `ST_Contains(geometry A, geometry B) <http://postgis.net/docs/ST_Contains.html>`_: Returns true if and only if no points of B lie in the exterior of A, and at least one point of the interior of B lies in the interior of A.
es: `ST_Contains(geometry A, geometry B) <http://postgis.net/docs/ST_Contains.html>`_: Devuelve true si y solo si ningún punto de B se encuentra en el exterior de A, y al menos un punto del interior de B se encuentra en el interior de A.
sv: `ST_Contains(geometri A, geometri B) <http://postgis.net/docs/ST_Contains.html>`_: Returnerar sant om och endast om inga punkter i B ligger i utsidan av A, och minst en punkt i insidan av B ligger i insidan av A.

source: `ST_DWithin(geometry A, geometry B, radius) <http://postgis.net/docs/ST_DWithin.html>`_: Returns true if the geometries are within the specified distance of one another.
es: `ST_DWithin(geometry A, geometry B, radius) <http://postgis.net/docs/ST_DWithin.html>`_: Devuelve true si las geometrías están dentro de la distancia especificada entre sí.
sv: `ST_DWithin(geometri A, geometri B, radie) <http://postgis.net/docs/ST_DWithin.html>`_: Returnerar sant om geometrierna ligger inom det angivna avståndet från varandra.

source: `ST_Intersects(geometry A, geometry B) <http://postgis.net/docs/ST_Intersects.html>`_: Returns TRUE if the Geometries/Geography "spatially intersect" - (share any portion of space) and FALSE if they don't (they are Disjoint).
es: `ST_Intersects(geometry A, geometry B) <http://postgis.net/docs/ST_Intersects.html>`_: Devuelve TRUE si las geometrías/geografías "intersectan espacialmente" (comparten alguna porción del espacio) y FALSE si no lo hacen (son disjuntas).
sv: `ST_Intersects(geometri A, geometri B) <http://postgis.net/docs/ST_Intersects.html>`_: Returnerar TRUE om geometrierna/geografin "spatialt korsar varandra" - (delar någon del av utrymmet) och FALSE om de inte gör det (de är disjunkta).

source: `round(v numeric, s integer) <http://www.postgresql.org/docs/current/interactive/functions-math.html>`_: PostgreSQL math function that rounds to s decimal places
es: `round(v numeric, s integer) <http://www.postgresql.org/docs/current/interactive/functions-math.html>`_: Función matemática de PostgreSQL que redondea a s decimales
sv: `round(v numerisk, s heltal) <http://www.postgresql.org/docs/current/interactive/functions-math.html>`_: PostgreSQL-matematisk funktion som avrundar till s decimaler

source: `strpos(string, substring) <http://www.postgresql.org/docs/current/static/functions-string.html>`_: PostgreSQL string function that returns an integer location of a specified substring.
es: `strpos(string, substring) <http://www.postgresql.org/docs/current/static/functions-string.html>`_: Función de cadena de PostgreSQL que devuelve una ubicación entera de una subcadena especificada.
sv: `strpos (sträng, delsträng) <http://www.postgresql.org/docs/current/static/functions-string.html>`_: PostgreSQL-strängfunktion som returnerar en heltalsplats för en angiven delsträng.

source: `sum(expression) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL aggregate function that returns the sum of records in a set of records.
es: `sum(expresión) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: Función de PostgreSQL que devuelve la suma de los valores de un conjunto de registros.
sv: `sum(uttryck) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL-aggregeringsfunktion som returnerar summan av poster i en uppsättning poster.
