Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/joins_advanced.po
Languages: es, sv

source: More Spatial Joins
es: Más Joins Espaciales
sv: Fler spatiala sammanfogningar

source: In the last section we saw the :command:`ST_Centroid(geometry)` and :command:`ST_Union([geometry])` functions, and some simple examples. In this section we will do some more elaborate things with them.
es: En la última sección vimos las funciones :command:`ST_Centroid(geometría)` y :command:`ST_Union([geometría])`, y algunos ejemplos sencillos. En esta sección haremos algunas cosas más elaboradas con ellas.
sv: I förra avsnittet såg vi funktionerna :command:`ST_Centroid(geometry)` och :command:`ST_Union([geometry])`, och några enkla exempel. I det här avsnittet ska vi göra lite mer avancerade saker med dem.

source: Creating a Census Tracts Table
es: Creación de una tabla de secciones censales
sv: Skapa en tabell över folkräkningsområden

source: In the workshop ``\data\`` directory, is a file that includes attribute data, but no geometry, ``nyc_census_sociodata.sql``. The table includes interesting socioeconomic data about New York: commute times, incomes, and education attainment. There is just one problem. The data are summarized by "census tract" and we have no census tract spatial data!
es: En el directorio ``\data\`` del taller, hay un archivo que incluye datos de atributos, pero no geometría, ``nyc_census_sociodata.sql``. La tabla incluye datos socioeconómicos interesantes sobre Nueva York: tiempos de desplazamiento, ingresos y nivel de estudios. Sólo hay un problema. Los datos se resumen por «zona censal», ¡y no tenemos datos espaciales por zona censal!
sv: I workshoppens katalog "data" finns en fil som innehåller attributdata, men ingen geometri, "NYC_census_sociodata.sql". Tabellen innehåller intressanta socioekonomiska data om New York: pendlingstider, inkomster och utbildningsnivå. Det finns bara ett problem. Uppgifterna sammanfattas av "census tract" och vi har inga spatiala data för census tract!

source: In this section we will
es: En esta sección vamos a
sv: I detta avsnitt kommer vi att

source: Load the ``nyc_census_sociodata.sql`` table
es: Cargar la tabla ``nyc_census_sociodata.sql``
sv: Läs in tabellen ``nyc_census_sociodata.sql``

source: Create a spatial table for census tracts
es: Crear una tabla espacial para las secciones censales
sv: Skapa en spatial tabell för folkräkningstrakter

source: Join the attribute data to the spatial data
es: Unir los datos de atributos a los datos espaciales
sv: Koppla attributdata till spatiala data

source: Carry out some analysis using our new data
es: Realizar algunos análisis con nuestros nuevos datos
sv: Genomföra en analys med hjälp av våra nya data

source: Loading nyc_census_sociodata.sql
es: Cargando nyc_census_sociodata.sql
sv: Läser in nyc_census_sociodata.sql

source: Open the SQL query window in PgAdmin
es: Abrir la ventana de consulta SQL en PgAdmin
sv: Öppna SQL-frågefönstret i PgAdmin

source: Select **File->Open** from the menu and browse to the ``nyc_census_sociodata.sql`` file
es: Selecciona **File->Open** en el menú y busca el archivo ``nyc_census_sociodata.sql``
sv: Välj **File->Open** från menyn och bläddra till filen ``nyc_census_sociodata.sql``

source: Press the "Run Query" button
es: Presiona el botón "Run Query"
sv: Tryck på knappen "Run Query" (Kör fråga)

source: If you press the "Refresh" button in PgAdmin, the list of tables should now include at ``nyc_census_sociodata`` table
es: Si presionas el botón "Refresh" en PgAdmin, la lista de tablas ahora debería incluir la tabla ``nyc_census_sociodata``
sv: Om du trycker på knappen "Uppdatera" i PgAdmin bör listan över tabeller nu innehålla tabellen ``nyc_census_sociodata``

source: As we saw in the previous section, we can build up higher level geometries from the census block by summarizing on substrings of the ``blkid`` key. In order to get census tracts, we need to summarize grouping on the first 11 characters of the ``blkid``.
es: Como vimos en la sección anterior, podemos construir geometrías de nivel superior a partir del bloque censal resumiendo en subcadenas de la clave ``blkid``. Para obtener distritos censales, necesitamos resumir agrupando los primeros 11 caracteres del ``blkid``.
sv: Som vi såg i föregående avsnitt kan vi bygga upp geometrier på högre nivå från folkräkningsblocket genom att sammanfatta delsträngar av nyckeln ``blkid``. För att få census tracts måste vi sammanfatta grupperingen på de första 11 tecknen i ``blkid``.

source: Create the new table using the :command:`ST_Union` aggregate:
es: Crea la nueva tabla usando el agregado :command:`ST_Union`:
sv: Skapa den nya tabellen med hjälp av aggregatet :command:`ST_Union`:

source: Join the Attributes to the Spatial Data
es: Unir los Atributos a los Datos Espaciales
sv: Koppla attributen till de spatiala data

source: Join the table of tract geometries to the table of tract attributes with a standard attribute join
es: Une la tabla de geometrías de distrito con la tabla de atributos de distrito mediante una unión de atributos estándar
sv: Anslut tabellen över traktgeometrier till tabellen över traktattribut med en standardattributanslutning

source: Answer an Interesting Question
es: Responder una Pregunta Interesante
sv: Svara på en intressant fråga

source: Answer an interesting question! "List top 10 New York neighborhoods ordered by the proportion of people who have graduate degrees."
es: Responde una pregunta interesante! "Lista los 10 principales vecindarios de Nueva York ordenados por la proporción de personas que tienen títulos de posgrado."
sv: Svara på en intressant fråga! "Lista de 10 bästa stadsdelarna i New York ordnade efter andelen människor som har en akademisk examen."

source: We sum up the statistics we are interested, then divide them together at the end. In order to avoid divide-by-zero errors, we don't bother bringing in tracts that have a population count of zero.
es: Sumamos las estadísticas que nos interesan y luego las dividimos al final. Para evitar errores de división por cero, no incluimos distritos con población igual a cero.
sv: Vi sammanfattar den statistik vi är intresserade av och delar sedan upp den i slutet. För att undvika dividera med noll-fel bryr vi oss inte om att ta med områden som har ett befolkningsantal på noll.

source: New York geographers will be wondering at the presence of "Flatbush" in this list of over-educated neighborhoods. The answer is discussed in the next section.
es: Los geógrafos de Nueva York se preguntarán por la presencia de "Flatbush" en esta lista de vecindarios sobreeducados. La respuesta se analiza en la siguiente sección.
sv: New York-geografer kommer att undra över närvaron av "Flatbush" i denna lista över överutbildade stadsdelar. Svaret diskuteras i nästa avsnitt.

source: In our interesting query (in :ref:`interestingquestion`) we used the :command:`ST_Intersects(geometry_a, geometry_b)` function to determine which census tract polygons to include in each neighborhood summary. Which leads to the question: what if a tract falls on the border between two neighborhoods? It will intersect both, and so will be included in the summary statistics for **both**.
es: En nuestra consulta interesante (en :ref:`interestingquestion`) usamos la función :command:`ST_Intersects(geometry_a, geometry_b)` para determinar qué polígonos de distritos censales incluir en cada resumen de vecindario. Lo que lleva a la pregunta: ¿qué pasa si un distrito se encuentra en la frontera entre dos vecindarios? Intersectará ambos, y por lo tanto será incluido en las estadísticas resumidas de **ambos**.
sv: I vår intressanta fråga (i :ref:`interestingquestion`) använde vi funktionen :command:`ST_Intersects(geometry_a, geometry_b)` för att avgöra vilka polygoner för folkbokföringstrakter som skulle ingå i varje grannskapssammanfattning. Vilket leder till frågan: Vad händer om en trakt faller på gränsen mellan två stadsdelar? Den kommer att korsa båda, och kommer därför att ingå i den sammanfattande statistiken för **båda**.

source: To avoid this kind of double counting there are two methods:
es: Para evitar este tipo de doble conteo hay dos métodos:
sv: För att undvika denna typ av dubbelräkning finns det två metoder:

source: The simple method is to ensure that each tract only falls in **one** summary area (using :command:`ST_Centroid(geometry)`)
es: El método simple es asegurar que cada distrito solo caiga en **una** área de resumen (usando :command:`ST_Centroid(geometry)`)
sv: Den enkla metoden är att se till att varje trakt bara faller inom **ett** sammanfattningsområde (med hjälp av :command:`ST_Centroid(geometry)`)

source: The complex method is to divide crossing tracts at the borders (using :command:`ST_Intersection(geometry,geometry)`)
es: El método complejo es dividir los distritos que cruzan fronteras (usando :command:`ST_Intersection(geometry,geometry)`)
sv: Den komplexa metoden är att dela upp korsande trakter vid gränserna (med :kommandot:`ST_Intersection(geometry,geometry)`)

source: Here is an example of using the simple method to avoid double counting in our graduate education query:
es: Aquí hay un ejemplo de cómo usar el método simple para evitar el doble conteo en nuestra consulta de educación de posgrado:
sv: Här är ett exempel på hur vi använder den enkla metoden för att undvika dubbelräkning i vår fråga om forskarutbildning:

source: Note that the query takes longer to run now, because the :command:`ST_Centroid` function has to be run on every census tract.
es: Observa que la consulta tarda más en ejecutarse ahora, porque la función :command:`ST_Centroid` debe ejecutarse en cada distrito censal.
sv: Observera att det tar längre tid att köra frågan nu, eftersom funktionen :command:`ST_Centroid` måste köras på varje folkräkningstrakt.

source: Avoiding double counting changes the results!
es: Evitar el doble conteo cambia los resultados!
sv: Att undvika dubbelräkning förändrar resultatet!

source: What about Flatbush?
es: ¿Qué pasa con Flatbush?
sv: Flatbush, då?

source: In particular, the Flatbush neighborhood has dropped off the list. The reason why can be seen by looking more closely at the map of the Flatbush neighborhood in our table.
es: En particular, el vecindario de Flatbush ha desaparecido de la lista. La razón se puede ver observando más de cerca el mapa del vecindario Flatbush en nuestra tabla.
sv: I synnerhet har Flatbush-kvarteret tappat från listan. Anledningen till detta kan man se genom att titta närmare på kartan över stadsdelen Flatbush i vår tabell.

source: As defined by our data source, Flatbush is not really a neighborhood in the conventional sense, since it just covers the area of Prospect Park. The census tract for that area records, naturally, zero residents. However, the neighborhood boundary does scrape one of the expensive census tracts bordering the north side of the park (in the gentrified Park Slope neighborhood). When using polygon/polygon tests, this single tract was added to the otherwise empty Flatbush, resulting in the very high score for that query.
es: Según lo definido por nuestra fuente de datos, Flatbush no es realmente un vecindario en el sentido convencional, ya que solo cubre el área de Prospect Park. El distrito censal de esa área registra, naturalmente, cero residentes. Sin embargo, el límite del vecindario toca uno de los distritos censales costosos que bordean el lado norte del parque (en el gentrificado vecindario de Park Slope). Al usar pruebas de polígono/polígono, este único distrito fue agregado al Flatbush vacío, resultando en la puntuación muy alta de esa consulta.
sv: Enligt definitionen i vår datakälla är Flatbush egentligen inte en stadsdel i konventionell mening, eftersom den bara omfattar området Prospect Park. Folkräkningstrakten för det området registrerar naturligtvis noll invånare. Grannskapsgränsen skrapar dock ett av de dyra folkräkningstrakterna som gränsar till norra sidan av parken (i det gentrifierade Park Slope-området). När man använde polygon/polygontester lades denna enstaka trakt till det annars tomma Flatbush, vilket resulterade i den mycket höga poängen för den frågan.

source: Large Radius Distance Joins
sv: Förband med stort radieavstånd

source: A query that is fun to ask is "How do the commute times of people near (within 500 meters) subway stations differ from those of people far away from subway stations?"
es: Una consulta divertida de hacer es: "¿Cómo difieren los tiempos de viaje de las personas que viven cerca (a menos de 500 metros) de estaciones de metro de aquellos que viven lejos de las estaciones de metro?"
sv: En fråga som är rolig att ställa är "Hur skiljer sig pendlingstiderna för människor nära (inom 500 meter) tunnelbanestationer från dem för människor långt bort från tunnelbanestationer?"

source: However, the question runs into some problems of double counting: many people will be within 500 meters of multiple subway stations. Compare the population of New York:
es: Sin embargo, la pregunta se enfrenta a algunos problemas de doble conteo: muchas personas estarán a menos de 500 metros de múltiples estaciones de metro. Compara la población de Nueva York:
sv: Frågan stöter dock på vissa problem med dubbelräkning: många människor kommer att befinna sig inom 500 meter från flera tunnelbanestationer. Jämför befolkningen i New York:

source: With the population of the people in New York within 500 meters of a subway station:
es: Con la población de personas en Nueva York dentro de 500 metros de una estación de metro:
sv: Med befolkningen i New York inom 500 meter från en tunnelbanestation:

source: There's more people close to the subway than there are people! Clearly, our simple SQL is making a big double-counting error. You can see the problem looking at the picture of the buffered subways.
es: Hay más personas cerca del metro de las que existen! Claramente, nuestro SQL simple está cometiendo un gran error de doble conteo. Puedes ver el problema observando la imagen de los buffers de las estaciones de metro.
sv: Det finns fler människor nära tunnelbanan än det finns människor! Det är uppenbart att vår enkla SQL gör ett stort dubbelräkningsfel. Du kan se problemet när du tittar på bilden av de buffrade tunnelbanorna.

source: The solution is to ensure that we have only distinct census blocks before passing them into the summarization portion of the query. We can do that by breaking our query up into a subquery that finds the distinct blocks, wrapped in a summarization query that returns our answer:
es: La solución es asegurarse de tener solo bloques censales distintos antes de pasarlos a la parte de resumen de la consulta. Podemos hacerlo dividiendo nuestra consulta en una subconsulta que encuentra los bloques distintos, envuelta en una consulta de resumen que devuelve nuestra respuesta:
sv: Lösningen är att se till att vi bara har distinkta folkräkningsblock innan vi skickar dem till sammanfattningsdelen av frågan. Vi kan göra det genom att bryta upp vår fråga i en underfråga som hittar de distinkta blocken, inslagna i en sammanfattningsfråga som returnerar vårt svar:

source: That's better! So a bit over half the population of New York is within 500m (about a 5-7 minute walk) of the subway.
es: Eso es mejor! Así que un poco más de la mitad de la población de Nueva York está dentro de 500 m (aproximadamente una caminata de 5 a 7 minutos) del metro.
sv: Det var bättre! Lite mer än hälften av New Yorks befolkning bor alltså inom 500 meter (cirka 5-7 minuters promenad) från tunnelbanan.
