Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/joins_exercises.po
Languages: es, sv

source: Spatial Joins Exercises
es: Ejercicios de Joins espaciales
sv: Spatial Joins-övningar

source: Here's a reminder of some of the functions we have seen. Hint: they should be useful for the exercises!
es: Aquí tienes un recordatorio de algunas de las funciones que hemos visto. Pista: ¡serán útiles para los ejercicios!
sv: Här är en påminnelse om några av de funktioner vi har sett. Tips: de bör vara användbara för övningarna!

source: :command:`sum(expression)`: aggregate to return a sum for a set of records
es: :command:`suma(expresión)`: función de agregación para devolver una suma de un conjunto de registros
sv: :command:`sum(expression)`: aggregat för att returnera en summa för en uppsättning poster

source: :command:`count(expression)`: aggregate to return the size of a set of records
es: :comando:`count(expresión)`: agregado para devolver el tamaño de un conjunto de registros.
sv: :command:`count(expression)`: aggregat för att returnera storleken på en uppsättning poster

source: :command:`ST_Area(geometry)` returns the area of the polygons
es: :comando:`ST_Area(geometría)` devuelve el área de las geometrías
sv: :command:`ST_Area(geometry)` returnerar polygonernas area

source: :command:`ST_AsText(geometry)` returns WKT ``text``
es: :command:`ST_AsText(geometry)` convierte formato binario en WKT
sv: :command:`ST_AsText(geometry)` returnerar WKT ``text``

source: :command:`ST_Contains(geometry A, geometry B)` returns the true if geometry A contains geometry B
es: :command:`ST_Contains(geometría A, geometría B)` devuelve verdadero si la geometría A contiene la geometría B
sv: :command:`ST_Contains(geometry A, geometry B)` returnerar true om geometri A innehåller geometri B

source: :command:`ST_Distance(geometry A, geometry B)` returns the minimum distance between geometry A and geometry B
es: :command:`ST_Distance(geometría A, geometría B)` devuelve la distancia mínima entre la geometría A y la geometría B
sv: :command:`ST_Distance(geometry A, geometry B)` returnerar det minsta avståndet mellan geometri A och geometri B

source: :command:`ST_DWithin(geometry A, geometry B, radius)` returns the true if geometry A is radius distance or less from geometry B
es: :command:`ST_DWithin(geometría A, geometría B, radio)` devuelve verdadero si la geometría A está a una distancia dentro del 'radio' de la geometría B
sv: :command:`ST_DWithin(geometry A, geometry B, radius)` returnerar true om geometri A ligger på radieavstånd eller mindre från geometri B

source: :command:`ST_GeomFromText(text)` returns ``geometry``
es: :command:`ST_GeomFromText(text)` retorna un objeto ``geometry`` desde una definición WKT
sv: :command:`ST_GeomFromText(text)` returnerar ``geometri``

source: :command:`ST_Intersects(geometry A, geometry B)` returns the true if geometry A intersects geometry B
es: :command:`ST_Intersects(geometry A, geometry B)` devuelve verdadero si la geometría A intersecta la geometría B
sv: :command:`ST_Intersects(geometry A, geometry B)` returnerar true om geometri A skär geometri B

source: :command:`ST_Length(linestring)` returns the length of the linestring
es: :command:`ST_Length(linestring)` retorna la longitud de la línea
sv: :command:`ST_Length(linestring)` returnerar längden på linestring

source: :command:`ST_Touches(geometry A, geometry B)` returns the true if the boundary of geometry A touches geometry B
es: :command:`ST_Touches(geometry A, geometry B)` devuelve verdadero si el límite de la geometría A toca la geometría B
sv: :command:`ST_Touches(geometry A, geometry B)` returnerar true om gränsen för geometri A berör geometri B

source: :command:`ST_Within(geometry A, geometry B)` returns the true if geometry A is within geometry B
es: :command:`ST_Within(geometry A, geometry B)` devuelve verdadero si la geometría A está dentro de la geometría B
sv: :command:`ST_Within(geometri A, geometri B)` returnerar true om geometri A ligger inom geometri B

source: Also remember the tables we have available:
es: También recuerde las tablas que tenemos disponibles:
sv: Tänk också på de bord vi har tillgängliga:

source: Exercises
es: Ejercicios
sv: Övningar

source: **What subway station is in 'Little Italy'? What subway route is it on?**
es: **¿Qué estación de metro está en 'Little Italy'? ¿En qué ruta de metro está?**
sv: **Vilken tunnelbanestation ligger i "Little Italy"? Vilken tunnelbanelinje ligger den på?**

source: **What are all the neighborhoods served by the 6-train?** (Hint: The ``routes`` column in the ``nyc_subway_stations`` table has values like 'B,D,6,V' and 'C,6')
es: **¿Cuáles son todos los vecindarios servidos por el tren 6?** (Pista: la columna ``routes`` en la tabla ``nyc_subway_stations`` tiene valores como 'B,D,6,V' y 'C,6')
sv: **Vilka stadsdelar trafikeras av 6-tåget? ** (Tips: Kolumnen ``routes`` i tabellen ``nyc_subway_stations`` har värden som "B,D,6,V" och "C,6")

source: We used the ``DISTINCT`` keyword to remove duplicate values from our result set where there were more than one subway station in a neighborhood.
es: Usamos la palabra clave ``DISTINCT`` para eliminar valores duplicados de nuestro conjunto de resultados cuando había más de una estación de metro en un vecindario.
sv: Vi använde nyckelordet ``DISTINCT`` för att ta bort duplicerade värden från vår resultatuppsättning där det fanns mer än en tunnelbanestation i ett område.

source: **After 9/11, the 'Battery Park' neighborhood was off limits for several days. How many people had to be evacuated?**
es: **Después del 11/9, el vecindario 'Battery Park' estuvo fuera de límites durante varios días. ¿Cuántas personas tuvieron que ser evacuadas?**
sv: **Efter 11 september var Battery Park-området avspärrat i flera dagar. Hur många människor var tvungna att evakueras?**

source: **What neighborhood has the highest population density (persons/km2)?**
es: **¿Qué vecindario tiene la mayor densidad de población (personas/km2)?**
sv: **Vilket område har den högsta befolkningstätheten (personer/km2)?**
