Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/knn.po
Languages: es, sv, uk

source: Nearest-Neighbour Searching
es: Vecinos cercanos
sv: Närmaste granne-sökning
uk: Пошук найближчого сусіда

source: What is a Nearest Neighbour Search?
es: ¿Qué es el Buscador de Vecinos Cercanos?
sv: Vad är en Nearest Neighbour-sökning?
uk: Що таке пошук найближчого сусіда?

source: A frequently posed spatial query is: "what is the nearest <candidate feature> to <query feature>?"
es: Una pregunta espacial frecuente es: "¿Cuál es la <<entidad>> más cercana a la <<entidad de consulta>>?"
sv: En ofta ställd spatial fråga är: "Vad är det närmaste <candidate feature> till <query feature>?"
uk: Часто задається просторовий запит: «що є найближчим <кандидат-елемент> до <елемент запиту>?»

source: Unlike a distance search, the "nearest neighbour" search doesn't include any measurement restricting how far away candidate geometries might be, features of any distance away will be accepted, as long as they are the *nearest*.
es: A diferencia de la búsqueda por distancia, la búsqueda por «vecino más próximo» no incluye ninguna medida que restrinja la distancia a la que pueden estar las geometrías candidatas, se aceptarán características de cualquier distancia, siempre que sean las *más próximas*.
sv: Till skillnad från en avståndssökning innehåller sökningen efter "närmaste granne" inte något mått som begränsar hur långt bort kandidatgeometrierna kan befinna sig. Funktioner på vilket avstånd som helst accepteras, så länge de är de *närmaste*.
uk: На відміну від пошуку за відстанню, пошук «найближчого сусіда» не включає жодних обмежень щодо відстані, на якій можуть знаходитися геометрії-кандидати. Будуть прийняті об'єкти, що знаходяться на будь-якій відстані, якщо вони є *найближчими*.

source: PostgreSQL solves the nearest neighbor problem by introducing an "order by distance" (``<->``) operator that induces the database to use an index to speed up a sorted return set. With an "order by distance" operator in place, a nearest neighbor query can return the "N nearest features" just by adding an ordering and limiting the result set to N entries.
es: PostgreSQL resuelve el problema del vecino más cercano introduciendo un operador de «orden por distancia» (``<->``) que induce a la base de datos a utilizar un índice para acelerar un conjunto de resultados ordenado. Con un operador de «orden por distancia» en su lugar, una consulta de vecino más cercano puede devolver las «N características más cercanas» simplemente añadiendo un orden y limitando el conjunto de resultados a N entradas.
sv: PostgreSQL löser det närmaste grannproblemet genom att införa en "order by distance" (``<->``) operatör som inducerar databasen att använda ett index för att påskynda en sorterad returuppsättning. Med en "order by distance" -operatör på plats kan en närmaste grannfråga returnera "N närmaste funktioner" bara genom att lägga till en beställning och begränsa resultatuppsättningen till N-poster.
uk: PostgreSQL вирішує проблему найближчого сусіда, вводячи оператор «order by distance» (``<->``), який змушує базу даних використовувати індекс для прискорення сортування набору результатів. За допомогою оператора «order by distance» запит на найближчого сусіда може повернути «N найближчих об'єктів», просто додавши сортування та обмеживши набір результатів до N записів.

source: The "order by distance" operator works for both geometry and geography types. The only difference between how they work between the two types is the distance value returned. For geometry ``<->`` returns the same answer as `ST_Distance` which is dependent on the units of the spatial reference system in use. For geography the distance value returned is the sphere distance, instead of the more accurate spheroidal distance that ``ST_Distance(geography,geography)`` returns.
es: El operador «ordenar por distancia» funciona tanto para los tipos de geometría como de geografía. La única diferencia de funcionamiento entre ambos tipos es el valor de distancia devuelto. Para geometría ``<->`` devuelve la misma respuesta que `ST_Distance` que depende de las unidades del sistema de referencia espacial en uso. Para geografía el valor de distancia devuelto es la distancia esférica, en lugar de la distancia esferoidal más precisa que devuelve ``ST_Distance(geography,geography)``.
sv: Operatorn "order by distance" fungerar för både geometri- och geograftyper. Den enda skillnaden mellan hur de fungerar mellan de två typerna är det avståndsvärde som returneras. För geometri ``<->`` returneras samma svar som `ST_Distance` som är beroende av enheterna i det spatiala referenssystem som används. För geografi är avståndsvärdet som returneras sfäravståndet, istället för det mer exakta sfäroidala avståndet som ``ST_Distance(geography,geography)`` returnerar.
uk: Оператор «order by distance» працює як для геометричних, так і для географічних типів. Єдина відмінність між цими двома типами полягає у значенні відстані, що повертається. Для геометрії ``<->`` повертає той самий результат, що і `ST_Distance`, який залежить від одиниць виміру використовуваної системи просторових координат. Для географії повертається значення відстані по сфері, а не більш точна сфероїдальна відстань, яку повертає ``ST_Distance(geography,geography)``.

source: Here's the 3 nearest streets to 'Broad St' subway station:
es: Aquí están las 3 calles más cercanas a la estación de metro “Broad St”:
sv: Här är de tre närmaste gatorna till "Broad St" tunnelbanestation:
uk: Ось 3 найближчі вулиці до станції метро «Broad St»:

source: How can we be sure we are getting an index-assisted query? It's a good idea to check the ``EXPLAIN`` output for a nearest-neighbor query, because it's possible to get correct answers from non-indexed SQL and the lack of an index might not be obvious until the size of the tables scales up.
es: ¿Cómo podemos estar seguros de que estamos obteniendo una consulta asistida por índices? Es una buena idea comprobar la salida de ``EXPLAIN`` para una consulta de vecino más cercano, porque es posible obtener respuestas correctas de SQL no indexado y la falta de un índice podría no ser obvia hasta que el tamaño de las tablas aumente.
sv: Hur kan vi vara säkra på att vi får en indexassisterad fråga? Det är en bra idé att kontrollera ``EXPLAIN``-utdata för en närmaste granne-fråga, eftersom det är möjligt att få korrekta svar från icke-indexerad SQL och avsaknaden av ett index kanske inte är uppenbart förrän storleken på tabellerna skalas upp.
uk: Як ми можемо бути впевнені, що отримуємо запит з індексом? Варто перевірити вихідні дані ``EXPLAIN`` для запиту найближчого сусіда, оскільки можна отримати правильні відповіді з неіндексованого SQL, а відсутність індексу може бути непомітною, доки розмір таблиць не збільшиться.

source: This is the output from ``EXPLAIN``, note the index scan over the order by:
es: Esta es la salida de ``EXPLAIN``, observe la exploración del índice sobre el order by:
sv: Det här är utdata från ``EXPLAIN``, notera indexskanningen över order by:
uk: Це вивід команди EXPLAIN, зверніть увагу на сканування індексу під час виконання операції сортування (order by):

source: Nearest Neighbor Join
es: Join Vecino más próximo
sv: Närmaste granne Join
uk: З’єднання найближчих сусідів

source: The index assisted order by operator has one major draw back: it only works with a **single geometry literal** on one side of the operator. This is fine for finding the objects nearest to one query object, but does not help for a spatial join, where the goal is to find the nearest neighbor for each of a full set of candidates.
es: El operador de ordenación por índice tiene un inconveniente importante: sólo funciona con **un único literal geométrico** en un lado del operador. Esto está bien para encontrar los objetos más cercanos a un objeto definido, pero no ayuda para un JOIN espacial, donde el objetivo es encontrar el vecino más cercano para cada uno de los objetos de un conjunto completo de candidatos.
sv: Den indexassisterade order by-operatorn har en stor nackdel: den fungerar bara med en **enkel geometrilitteral** på ena sidan av operatorn. Detta är bra för att hitta de objekt som ligger närmast ett frågeobjekt, men hjälper inte för en spatial join, där målet är att hitta den närmaste grannen för var och en av en fullständig uppsättning kandidater.
uk: Оператор сортування з підтримкою індексу має один суттєвий недолік: він працює лише з одним геометричним літералом з одного боку оператора. Це підходить для пошуку об’єктів, найближчих до одного запитного об’єкта, але не допомагає для просторового з’єднання, де мета — знайти найближчого сусіда для кожного об’єкта з повного набору кандидатів.

source: Fortunately, there's a SQL language feature that allows us to run a query repeatedly driven in a loop: the `LATERAL join <https://medium.com/kkempin/postgresqls-lateral-join-bfd6bd0199df>`_.
es: Afortunadamente, existe una característica del lenguaje SQL que nos permite ejecutar una consulta en un bucle: el `LATERAL join <https://medium.com/kkempin/postgresqls-lateral-join-bfd6bd0199df>`_.
sv: Lyckligtvis finns det en funktion i SQL-språket som gör att vi kan köra en fråga upprepade gånger i en slinga: `LATERAL join <https://medium.com/kkempin/postgresqls-lateral-join-bfd6bd0199df>`_.
uk: На щастя, у мові SQL є можливість виконувати запит багаторазово в циклі — це LATERAL join <https://medium.com/kkempin/postgresqls-lateral-join-bfd6bd0199df>_.

source: Here we will find the nearest street to each subway station:
es: Aquí encontrará la calle más cercana a cada estación de metro:
sv: Här hittar vi den närmaste gatan till varje tunnelbanestation:
uk: Тут ми знайдемо найближчу вулицю до кожної станції метро:

source: Note the way the ``CROSS JOIN LATERAL`` acts as the inner part of a loop driven by the subways table. Each record in the subways table gets fed into the lateral subquery, one at a time, so you get a nearest result for each subway record.
es: Observe cómo el ``CROSS JOIN LATERAL`` actúa como la parte interna de un bucle controlado por la tabla subways. Cada registro de la tabla subways se introduce en la subconsulta lateral, de uno en uno, de forma que se obtiene un resultado más cercano para cada registro de metro.
sv: Observera hur ``CROSS JOIN LATERAL`` fungerar som den inre delen av en slinga som drivs av tunnelbanetabellen. Varje post i tunnelbanetabellen matas in i den laterala underfrågan, en i taget, så att du får ett närmaste resultat för varje tunnelbanepost.
uk: Зверніть увагу, що CROSS JOIN LATERAL працює як внутрішня частина циклу, керованого таблицею метро. Кожен запис із таблиці метро по черзі передається в латеральний підзапит, тож ви отримуєте найближчий результат для кожного запису метро.

source: The explain shows the loop on the subway stations, and the index-assisted order by inside the loop where we want it:
es: La explicación muestra el bucle en las estaciones de metro, y el orden asistido por índices dentro del bucle donde queramos:
sv: Förklaringen visar slingan på tunnelbanestationerna och den indexassisterade beställningen genom att lägga in slingan där vi vill ha den:
uk: План виконання показує цикл по станціях метро та сортування з підтримкою індексу всередині циклу, саме там, де це потрібно:
