Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/linear_referencing.po
Languages: es, sv

source: Linear Referencing
es: Referencia Lineal
sv: Linjär referenstagning

source: Linear referencing (sometimes called "dynamic segmentation") is a means of representing features that can be described by referencing a base set of linear features. Common examples of features that are modelled using linear referencing are:
es: La referenciación lineal (a veces llamada "segmentación dinámica") es un medio de representar entidades que pueden describirse haciendo referencia a un conjunto base de entidades lineales. Ejemplos comunes de entidades que se modelan usando referenciación lineal son:
sv: Linjär referenstagning (ibland kallad "dynamisk segmentering") är ett sätt att representera egenskaper som kan beskrivas genom att referera till en basuppsättning av linjära egenskaper. Vanliga exempel på funktioner som modelleras med hjälp av linjär referering är:

source: Highway assets, which are referenced using miles along a highway network
es: Activos de carreteras, que se referencian usando millas a lo largo de una red de carreteras
sv: Highway assets, som refereras till med hjälp av mil längs ett motorvägsnätverk

source: Road maintenance operations, which are referenced as occurring along a road network between a pair of mile measurements.
es: Operaciones de mantenimiento de carreteras, que se referencian como ocurriendo a lo largo de una red vial entre un par de medidas de millas.
sv: Väghållningsåtgärder, som refereras till som förekommande längs ett vägnät mellan ett par milmätningar.

source: Aquatic inventories, where fish presence is recorded as existing between a pair of mileage-upstream measurements.
es: Inventarios acuáticos, donde la presencia de peces se registra como existente entre un par de medidas río arriba.
sv: Vatteninventeringar, där fiskförekomst registreras som befintlig mellan ett par mätningar av kilometer uppströms.

source: Hydrologic characterizations ("reaches") of streams, recorded with a from- and to- mileage.
es: Caracterizaciones hidrológicas ("reaches") de arroyos, registradas con una milla de inicio y de fin.
sv: Hydrologiska karakteriseringar ("sträckor") av vattendrag, registrerade med en från- och till-kilometer.

source: The benefit of linear referencing models is that the dependent spatial observations do not need to be separately recorded from the base observations, and updates to the base observation layer can be carried out knowing that the dependent observations will automatically track the new geometry.
es: El beneficio de los modelos de referenciación lineal es que las observaciones espaciales dependientes no necesitan ser registradas por separado de las observaciones base, y las actualizaciones a la capa de observación base pueden llevarse a cabo sabiendo que las observaciones dependientes seguirán automáticamente la nueva geometría.
sv: Fördelen med linjära referensmodeller är att de beroende spatiala observationerna inte behöver registreras separat från basobservationerna, och uppdateringar av basobservationslagret kan utföras i vetskap om att de beroende observationerna automatiskt kommer att följa den nya geometrin.

source: The Esri terminological convention for linear referencing is to have a base table of linear spatial features, and a non-spatial table of "events" which includes a foreign key reference to the spatial feature and a measure along the referenced feature. We will use the term "event table" to refer to the non-spatial tables we build.
es: La convención terminológica de Esri para la referenciación lineal es tener una tabla base de entidades espaciales lineales y una tabla no espacial de "eventos" que incluye una clave foránea de referencia a la entidad espacial y una medida a lo largo de la entidad referenciada. Usaremos el término "tabla de eventos" para referirnos a las tablas no espaciales que construimos.
sv: Esris terminologiska konvention för linjär referens är att ha en bastabell med linjära spatiala egenskaper och en icke-spatial tabell med "händelser" som innehåller en främmande nyckelreferens till den spatiala egenskapen och en mätning längs den refererade egenskapen. Vi kommer att använda termen "händelsetabell" för att hänvisa till de icke-spatiala tabeller vi bygger.

source: Creating Linear References
es: Creando referencias lineales
sv: Skapa linjära referenser

source: If you have an existing point table that you want to reference to a linear network, use the :command:`ST_LineLocatePoint` function, which takes a line and point, and returns the proportion along the line that the point can be found.
es: Si tienes una tabla de puntos existente que quieres referenciar a una red lineal, usa la función :command:`ST_LineLocatePoint`, que toma una línea y un punto, y devuelve la proporción a lo largo de la línea donde se puede encontrar el punto.
sv: Om du har en befintlig punkttabell som du vill referera till ett linjärt nätverk använder du funktionen :command:`ST_LineLocatePoint`, som tar en linje och en punkt och returnerar den andel längs linjen som punkten kan hittas.

source: We can convert the **nyc_subway_stations** into an "event table" relative to the streets by using :command:`ST_LineLocatePoint`.
es: Podemos convertir la tabla **nyc_subway_stations** en una "tabla de eventos" relativa a las calles usando :command:`ST_LineLocatePoint`.
sv: Vi kan konvertera **nyc_subway_stations** till en "händelsetabell" i förhållande till gatorna genom att använda :command:`ST_LineLocatePoint`.

source: Once we have an event table, it's fun to turn it back into a spatial view, so we can visualize the events relative to the original points they were derived from.
es: Una vez que tenemos una tabla de eventos, es divertido convertirla nuevamente en una vista espacial, para que podamos visualizar los eventos en relación con los puntos originales de los que se derivaron.
sv: När vi väl har en händelsetabell är det kul att omvandla den till en spatial vy, så att vi kan visualisera händelserna i förhållande till de ursprungliga punkter som de härrör från.

source: To go from a measure to a point, we use the :command:`ST_LineInterpolatePoint` function. Here's our previous simple examples reversed:
es: Para ir de una medida a un punto, usamos la función :command:`ST_LineInterpolatePoint`. Aquí están nuestros ejemplos simples anteriores invertidos:
sv: För att gå från ett mått till en punkt använder vi funktionen :command:`ST_LineInterpolatePoint`. Här är våra tidigare enkla exempel omvända:

source: And we can join the **nyc_subway_station_events** tables back to the **nyc_streets** table and use the **measure** attribute to generate the spatial event points, without referencing the original **nyc_subway_stations** table.
es: Y podemos unir las tablas **nyc_subway_station_events** de nuevo a la tabla **nyc_streets** y usar el atributo **measure** para generar los puntos de eventos espaciales, sin hacer referencia a la tabla original **nyc_subway_stations**.
sv: Och vi kan koppla **nyc_subway_station_events**-tabellerna tillbaka till **nyc_streets**-tabellen och använda attributet **measure** för att generera de spatiala händelsepunkterna, utan att hänvisa till den ursprungliga **nyc_subway_stations**-tabellen.

source: Viewing the original (red star) and event (blue circle) points with the streets, you can see how the events are snapped directly to the closest street lines.
es: Viendo los puntos originales (estrella roja) y los puntos de eventos (círculo azul) con las calles, puedes ver cómo los eventos se ajustan directamente a las líneas de calle más cercanas.
sv: Om du tittar på originalpunkterna (röd stjärna) och händelsepunkterna (blå cirkel) med gatorna kan du se hur händelserna knyts direkt till de närmaste gatulinjerna.

source: One surprising use of the linear referencing functions has nothing to do with linear referencing models. As shown above, it's possible to use the functions to snap points to linear features. For use cases like GPS tracks or other inputs that are expected to reference a linear network, snapping is a handy feature to have available.
es: Un uso sorprendente de las funciones de referenciación lineal no tiene nada que ver con modelos de referenciación lineal. Como se muestra arriba, es posible usar las funciones para ajustar puntos a entidades lineales. Para casos de uso como trayectorias GPS u otras entradas que se espera que hagan referencia a una red lineal, el ajuste es una característica útil a tener disponible.
sv: En överraskande användning av de linjära referensfunktionerna har inget att göra med linjära referensmodeller. Som visas ovan är det möjligt att använda funktionerna för att snäppa punkter till linjära funktioner. För användningsfall som GPS-spår eller andra ingångar som förväntas referera till ett linjärt nätverk är snäppning en praktisk funktion att ha tillgänglig.

source: Function List
es: Lista de funciones
sv: Funktionslista

source: `ST_LineInterpolatePoint(geometry A, double measure) <http://postgis.net/docs/ST_LineInterpolatePoint.html>`_: Returns a point interpolated along a line.
es: `ST_LineInterpolatePoint(geometry A, double measure) <http://postgis.net/docs/ST_LineInterpolatePoint.html>`_: Devuelve un punto interpolado a lo largo de una línea.
sv: `ST_LineInterpolatePoint(geometry A, double measure) <http://postgis.net/docs/ST_LineInterpolatePoint.html>`_: Returnerar en punkt interpolerad längs en linje.

source: `ST_LineLocatePoint(geometry A, geometry B) <http://postgis.net/docs/ST_LineLocatePoint.html>`_: Returns a float between 0 and 1 representing the location of the closest point on LineString to the given Point.
es: `ST_LineLocatePoint(geometry A, geometry B) <http://postgis.net/docs/ST_LineLocatePoint.html>`_: Devuelve un número flotante entre 0 y 1 que representa la ubicación del punto más cercano en LineString al Punto dado.
sv: `ST_LineLocatePoint(geometri A, geometri B) <http://postgis.net/docs/ST_LineLocatePoint.html>`_: Returnerar en flottör mellan 0 och 1 som representerar platsen för den punkt på LineString som ligger närmast den angivna Point.

source: `ST_LineSubstring(geometry A, double from, double to) <http://postgis.net/docs/ST_LineSubstring.html>`_: Return a linestring being a substring of the input one starting and ending at the given fractions of total 2d length.
es: `ST_LineSubstring(geometry A, double from, double to) <http://postgis.net/docs/ST_LineSubstring.html>`_: Devuelve un linestring que es una subcadena del de entrada comenzando y terminando en las fracciones dadas de la longitud total 2D.
sv: `ST_LineSubstring(geometri A, dubbel från, dubbel till) <http://postgis.net/docs/ST_LineSubstring.html>`_: Returnerar en linjestring som är en delsträng av den ingående som börjar och slutar vid de angivna fraktionerna av den totala 2d-längden.

source: `ST_LocateAlong(geometry A, double measure) <http://postgis.net/docs/ST_LocateAlong.html>`_: Return a derived geometry collection value with elements that match the specified measure.
es: `ST_LocateAlong(geometry A, double measure) <http://postgis.net/docs/ST_LocateAlong.html>`_: Devuelve un valor de colección de geometrías derivadas con elementos que coinciden con la medida especificada.
sv: `ST_LocateAlong(geometri A, dubbelmått) <http://postgis.net/docs/ST_LocateAlong.html>`_: Returnerar ett härlett geometrisamlingsvärde med element som matchar det angivna måttet.

source: `ST_LocateBetween(geometry A, double from, double to) <http://postgis.net/docs/ST_LocateBetween.html>`_: Return a derived geometry collection value with elements that match the specified range of measures inclusively.
es: `ST_LocateBetween(geometry A, double from, double to) <http://postgis.net/docs/ST_LocateBetween.html>`_: Devuelve un valor de colección de geometrías derivadas con elementos que coinciden con el rango de medidas especificado de forma inclusiva.
sv: `ST_LocateBetween(geometry A, double from, double to) <http://postgis.net/docs/ST_LocateBetween.html>`_: Returnerar ett härlett geometrisamlingsvärde med element som matchar det angivna intervallet av mått inklusive.

source: `ST_AddMeasure(geometry A, double from, double to) <http://postgis.net/docs/ST_AddMeasure.html>`_: Return a derived geometry with measure elements linearly interpolated between the start and end points. If the geometry has no measure dimension, one is added.
es: `ST_AddMeasure(geometry A, double from, double to) <http://postgis.net/docs/ST_AddMeasure.html>`_: Devuelve una geometría derivada con elementos de medida interpolados linealmente entre los puntos inicial y final. Si la geometría no tiene dimensión de medida, se añade una.
sv: `ST_AddMeasure(geometry A, double from, double to) <http://postgis.net/docs/ST_AddMeasure.html>`_: Returnerar en härledd geometri med måttelement linjärt interpolerade mellan start- och slutpunkterna. Om geometrin inte har någon måttdimension läggs en till.
