Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/projection.po
Languages: es, sv, uk

source: Projecting Data
es: Proyección de datos
sv: Projektering av data
uk: Проекція даних

source: The earth is not flat, and there is no simple way of putting it down on a flat paper map (or computer screen), so people have come up with all sorts of ingenious solutions, each with pros and cons. Some projections preserve area, so all objects have a relative size to each other; other projections preserve angles (conformal) like the Mercator projection; some projections try to find a good intermediate mix with only little distortion on several parameters. Common to all projections is that they transform the (spherical) world onto a flat Cartesian coordinate system, and which projection to choose depends on how you will be using the data.
es: La Tierra no es plana, y no hay una manera simple de representarla en un mapa de papel plano (o en una pantalla de computadora), por lo que se han ideado todo tipo de soluciones ingeniosas, cada una con pros y contras. Algunas proyecciones preservan el área, de modo que todos los objetos tienen un tamaño relativo entre sí; otras proyecciones preservan los ángulos (conformes), como la proyección de Mercator; algunas proyecciones intentan encontrar un buen equilibrio intermedio con poca distorsión en varios parámetros. Lo común a todas las proyecciones es que transforman el mundo (esférico) en un sistema de coordenadas cartesianas planas, y la proyección a elegir depende de cómo se usarán los datos.
sv: Jorden är inte platt, och det finns inget enkelt sätt att avbilda den på en platt papperskarta (eller datorskärm), så människor har kommit på alla möjliga geniala lösningar, var och en med för- och nackdelar. Vissa projektioner bevarar ytan, så att alla objekt har en relativ storlek i förhållande till varandra; andra projektioner bevarar vinklar (konforma) som Mercator-projektionen; vissa projektioner försöker hitta en bra mellanliggande mix med endast liten förvrängning på flera parametrar. Gemensamt för alla projektioner är att de omvandlar den (sfäriska) världen till ett platt kartesiskt koordinatsystem, och vilken projektion som ska väljas beror på hur du ska använda data.
uk: Земля не є пласкою, і немає простого способу зобразити її на плоскому паперовому мапі (або на екрані комп’ютера), тому люди придумали різноманітні винахідливі рішення, кожне з яких має свої переваги і недоліки. Деякі проекції зберігають площу, тож усі об’єкти мають відносний розмір один до одного; інші проекції зберігають кути (конформні), як, наприклад, проекція Меркатора; деякі проекції намагаються знайти хороший проміжний варіант із мінімальними спотвореннями по кількох параметрах. Спільним для всіх проекцій є те, що вони трансформують (сферичний) світ у плоску декартову систему координат, а вибір проекції залежить від того, як ви плануєте використовувати ці дані.

source: We've already encountered projections when we :ref:`loaded our nyc data <loading_data>`. (Recall that pesky SRID 26918). Sometimes, however, you need to transform and re-project between spatial reference systems. PostGIS includes built-in support for changing the projection of data, using the :command:`ST_Transform(geometry, srid)` function. For managing the spatial reference identifiers on geometries, PostGIS provides the :command:`ST_SRID(geometry)` and :command:`ST_SetSRID(geometry, srid)` functions.
es: Ya nos hemos encontrado con proyecciones cuando :ref:`cargamos nuestros datos de nyc <loading_data>`. (Recuerde ese molesto SRID 26918). Sin embargo, a veces es necesario transformar y reproyectar entre sistemas de referencia espacial. PostGIS incluye soporte integrado para cambiar la proyección de los datos, usando la función :command:`ST_Transform(geometry, srid)`. Para gestionar los identificadores de referencia espacial en geometrías, PostGIS proporciona las funciones :command:`ST_SRID(geometry)` y :command:`ST_SetSRID(geometry, srid)`.
sv: Vi har redan stött på projektioner när vi :ref:`laddade våra nyc-data <loading_data>`. (Minns den där irriterande SRID 26918). Ibland behöver du dock transformera och omprojicera mellan spatiala referenssystem. PostGIS har inbyggt stöd för att ändra projektionen av data med hjälp av funktionen :command:`ST_Transform(geometry, srid)`. För att hantera de spatiala referensidentifierarna på geometrier tillhandahåller PostGIS funktionerna :command:`ST_SRID(geometry)` och :command:`ST_SetSRID(geometry, srid)`.
uk: Ми вже зустрічали проекції, коли :ref:`завантажували наші дані Нью-Йорка <loading_data>` — пам’ятаєте той нав’язливий SRID 26918? Іноді, однак, потрібно трансформувати та повторно проектувати між системами просторових координат. PostGIS має вбудовану підтримку зміни проекції даних за допомогою функції :command:`ST_Transform(geometry, srid)`. Для керування ідентифікаторами просторових систем координат (SRID) у геометріях, PostGIS надає функції :command:`ST_SRID(geometry)` та :command:`ST_SetSRID(geometry, srid)`.

source: We can confirm the SRID of our data with the :command:`ST_SRID` function:
es: Podemos confirmar el SRID de nuestros datos con la función :command:`ST_SRID`:
sv: Vi kan bekräfta SRID för våra data med funktionen :command:`ST_SRID`:
uk: Ми можемо підтвердити SRID наших даних за допомогою функції :command:`ST_SRID`:

source: And what is definition of "26918"? As we saw in ":ref:`loading data section <loading_data>`", the definition is contained in the ``spatial_ref_sys`` table. In fact, **two** definitions are there. The "well-known text" (:term:`WKT`) definition is in the ``srtext`` column, and there is a second definition in "proj.4" format in the ``proj4text`` column.
es: ¿Y cuál es la definición de "26918"? Como vimos en ":ref:`sección de carga de datos <loading_data>`", la definición está contenida en la tabla ``spatial_ref_sys``. De hecho, hay **dos** definiciones allí. La definición en "texto bien conocido" (:term:`WKT`) está en la columna ``srtext``, y hay una segunda definición en formato "proj.4" en la columna ``proj4text``.
sv: Och vad är definitionen av "26918"? Som vi såg i ":ref:`loading data section <loading_data>`", finns definitionen i tabellen ``spatial_ref_sys``. Faktum är att **två** definitioner finns där. Definitionen "well-known text" (:term:`WKT`) finns i kolumnen ``srtext``, och det finns en andra definition i "proj.4" format i kolumnen ``proj4text``.
uk: А що таке визначення "26918"? Як ми бачили у розділі ":ref: `завантаження даних <loading_data>"`, це визначення міститься у таблиці ``spatial_ref_sys``. Насправді, там є дві версії визначення. Визначення у форматі "well-known text" (:term:`WKT`) знаходиться у стовпці ``srtext``, а друга версія у форматі "proj.4" — у стовпці ``proj4text``.

source: The PostGIS reprojection engine will attempt to find the best projection from the ``spatial_ref_sys`` table:
es: El motor de reproyección de PostGIS intentará encontrar la mejor proyección de la tabla ``spatial_ref_sys``:
sv: PostGIS reprojektionsmotor kommer att försöka hitta den bästa projektionen från tabellen ``spatial_ref_sys``:
uk: Механізм перепроектування PostGIS спробує знайти найкращу проекцію з таблиці ``spatial_ref_sys``:

source: **auth_name / auth_srid** If proj can find a valid "authority name" and "authority srid" in its internal catalogue, it will use that to generate a projection definition.
es: **auth_name / auth_srid** Si proj puede encontrar un "nombre de autoridad" y un "srid de autoridad" válidos en su catálogo interno, lo usará para generar una definición de proyección.
sv: **auth_name / auth_srid** Om proj kan hitta ett giltigt "authority name" och "authority srid" i sin interna katalog, kommer den att använda det för att generera en projektionsdefinition.
uk: **auth_name / auth_srid** Якщо proj може знайти дійсне «authority name» та «authority srid» у своєму внутрішньому каталозі, він використає їх для створення визначення проекції.

source: **srtext** If proj can parse and form a definition object from the ``srtext`` it will use that.
es: **srtext** Si proj puede analizar y formar un objeto de definición a partir de ``srtext``, lo usará.
sv: **srtext** Om proj kan tolka och skapa ett definitionsobjekt från ``srtext`` kommer det att användas.
uk: **srtext** Якщо proj може проаналізувати та сформувати об'єкт визначення з ``srtext``, він буде використовувати його.

source: **proj4text** Finally, proj will attempt to process the ``proj4text``.
es: **proj4text** Finalmente, proj intentará procesar el ``proj4text``.
sv: **proj4text** Slutligen kommer proj att försöka bearbeta ``proj4text``.
uk: **proj4text** Зрештою, proj спробує обробити ``proj4text``.

source: All this redundancy means that all you need to create a new projection in PostGIS is either a valid ``srtext`` string or ``proj4text`` string. All the common authority name/code pairs are already loaded in the table by default.
es: Toda esta redundancia significa que todo lo que necesita para crear una nueva proyección en PostGIS es una cadena ``srtext`` válida o una cadena ``proj4text`` válida. Todos los pares comunes de nombre/código de autoridad ya están cargados en la tabla de manera predeterminada.
sv: All denna redundans innebär att allt du behöver för att skapa en ny projektion i PostGIS är antingen en giltig ``rtext``-sträng eller ``proj4text``-sträng. Alla par av namn/kod för gemensamma myndigheter är redan inlästa i tabellen som standard.
uk: Вся ця надмірність означає, що для створення нової проекції в PostGIS вам потрібно лише дійсний рядок ``srtext`` або ``proj4text``. Усі поширені пари назв/кодів органів влади вже завантажені в таблицю за замовчуванням.

source: If you have a choice when creating a custom projection, fill out the ``srtext`` column, since that column is also used by external programs like `GeoServer <http://geoserver.org>`_, `QGIS <https://qgis.org>`_, and `FME <http://www.safe.com/>`_ and others.
es: Si tiene la opción al crear una proyección personalizada, complete la columna ``srtext``, ya que esa columna también es utilizada por programas externos como `GeoServer <http://geoserver.org>`_, `QGIS <https://qgis.org>`_, y `FME <http://www.safe.com/>`_, entre otros.
sv: Om du har möjlighet att välja när du skapar en anpassad projektion, fyll i kolumnen ``rtext``, eftersom den kolumnen också används av externa program som `GeoServer <http://geoserver.org>`_, `QGIS <https://qgis.org>`_ och `FME <http://www.safe.com/>`_ m.fl.
uk: Якщо у вас є вибір під час створення власного проектування, заповніть стовпець «srtext», оскільки цей стовпець також використовується зовнішніми програмами, такими як «GeoServer <http://geoserver.org>», «QGIS <https://qgis.org>» та «FME <http://www.safe.com/>» та іншими.

source: Comparing Data
es: Comparación de datos
sv: Jämförelse av data
uk: Порівняння даних

source: Taken together, a coordinate and an SRID define a location on the globe. Without an SRID, a coordinate is just an abstract notion. A "Cartesian" coordinate plane is defined as a "flat" coordinate system placed on the surface of Earth. Because PostGIS functions work on such a plane, comparison operations require that both geometries be represented in the same SRID.
es: Tomados en conjunto, una coordenada y un SRID definen una ubicación en el globo. Sin un SRID, una coordenada es solo una noción abstracta. Un plano de coordenadas "cartesiano" se define como un sistema de coordenadas "plano" colocado en la superficie de la Tierra. Dado que las funciones de PostGIS funcionan en dicho plano, las operaciones de comparación requieren que ambas geometrías estén representadas en el mismo SRID.
sv: Tillsammans definierar en koordinat och en SRID en plats på jordklotet. Utan en SRID är en koordinat bara ett abstrakt begrepp. Ett "kartesiskt" koordinatplan definieras som ett "platt" koordinatsystem placerat på jordens yta. Eftersom PostGIS-funktioner arbetar i ett sådant plan, kräver jämförelseoperationer att båda geometrierna representeras i samma SRID.
uk: Разом координати та SRID визначають місце на земній кулі. Без SRID координати є лише абстрактним поняттям. «Декартова» координатна площина визначається як «плоска» система координат, розміщена на поверхні Землі. Оскільки функції PostGIS працюють на такій площині, операції порівняння вимагають, щоб обидві геометрії були представлені в одному SRID.

source: If you feed in geometries with differing SRIDs you will just get an error:
es: Si introduce geometrías con SRID diferentes, solo obtendrá un error:
sv: Om du matar in geometrier med olika SRID:er kommer du bara att få ett felmeddelande:
uk: Якщо ви введете геометрії з різними SRID, ви отримаєте помилку:

source: Be careful of getting too happy with using :command:`ST_Transform` for on-the-fly conversion. Spatial indexes are built using SRID of the stored geometries. If comparison are done in a different SRID, spatial indexes are (often) not used. It is best practice to choose **one SRID** for all the tables in your database. Only use the transformation function when you are reading or writing data to external applications.
es: Tenga cuidado de abusar del uso de :command:`ST_Transform` para conversiones al vuelo. Los índices espaciales se construyen usando el SRID de las geometrías almacenadas. Si las comparaciones se realizan en un SRID diferente, los índices espaciales (a menudo) no se usan. La mejor práctica es elegir **un SRID** para todas las tablas de su base de datos. Use la función de transformación solo cuando esté leyendo o escribiendo datos en aplicaciones externas.
sv: Var försiktig så att du inte blir alltför nöjd med att använda :command:`ST_Transform` för konvertering direkt. Spatiala index byggs upp med hjälp av SRID för de lagrade geometrierna. Om jämförelsen görs i en annan SRID används (ofta) inte spatiala index. Bästa praxis är att välja **ett SRID** för alla tabeller i databasen. Använd endast transformationsfunktionen när du läser eller skriver data till externa applikationer.
uk: Будьте обережні, не захоплюйтеся використанням команди :command:`ST_Transform` для перетворення на льоту. Просторові індекси будуються з використанням SRID збережених геометрій. Якщо порівняння виконується в іншому SRID, просторові індекси (часто) не використовуються. Найкраще вибрати **один SRID** для всіх таблиць у вашій базі даних. Використовуйте функцію перетворення тільки під час читання або запису даних у зовнішні додатки.

source: Transforming Data
es: Transformación de datos
sv: Omvandling av data
uk: Перетворення даних

source: If we return to our proj4 definition for SRID 26918, we can see that our working projection is UTM (Universal Transverse Mercator) of zone 18, with meters as the unit of measurement.
es: Si volvemos a nuestra definición proj4 para el SRID 26918, podemos ver que nuestra proyección de trabajo es UTM (Transversa Universal de Mercator) de la zona 18, con metros como unidad de medida.
sv: Om vi återgår till vår proj4-definition för SRID 26918 kan vi se att vår arbetsprojektion är UTM (Universal Transverse Mercator) i zon 18, med meter som måttenhet.
uk: Якщо повернутися до нашого визначення proj4 для SRID 26918, ми побачимо, що наша робоча проекція — це UTM (універсальна поперечна проекція Меркатора) зони 18, з метрами як одиницею вимірювання.

source: Let's convert some data from our working projection to geographic coordinates -- also known as "longitude/latitude".
es: Convirtamos algunos datos de nuestra proyección de trabajo a coordenadas geográficas —también conocidas como "longitud/latitud".
sv: Låt oss konvertera några data från vår arbetsprojektion till geografiska koordinater - även kända som "longitud/latitud".
uk: Давайте перетворимо деякі дані з нашої робочої проекції в географічні координати, також відомі як «довгота/широта».

source: To convert data from one SRID to another, you must first verify that your geometry has a valid SRID. Since we have already confirmed a valid SRID, we next need the SRID of the projection to transform into. In other words, what is the SRID of geographic coordinates?
es: Para convertir datos de un SRID a otro, primero debe verificar que su geometría tenga un SRID válido. Como ya hemos confirmado un SRID válido, lo siguiente que necesitamos es el SRID de la proyección a la que se desea transformar. En otras palabras, ¿cuál es el SRID de las coordenadas geográficas?
sv: För att konvertera data från en SRID till en annan måste du först verifiera att din geometri har en giltig SRID. Eftersom vi redan har bekräftat en giltig SRID behöver vi nästa SRID för projektionen att transformera till. Med andra ord, vad är SRID för geografiska koordinater?
uk: Щоб перетворити дані з одного SRID в інший, спочатку потрібно перевірити, чи має ваша геометрія дійсний SRID. Оскільки ми вже підтвердили дійсність SRID, нам потрібно SRID проекції, в яку ми хочемо перетворити дані. Іншими словами, який SRID мають географічні координати?

source: The most common SRID for geographic coordinates is 4326, which corresponds to "longitude/latitude on the WGS84 spheroid". You can see the definition here:
es: El SRID más común para coordenadas geográficas es 4326, que corresponde a "longitud/latitud en el esferoide WGS84". Puede ver la definición aquí:
sv: Den vanligaste SRID:en för geografiska koordinater är 4326, vilket motsvarar "longitud/latitud på sfäroiden WGS84". Du kan se definitionen här:
uk: Найпоширенішим SRID для географічних координат є 4326, що відповідає «довготі/широті на сфероїді WGS84». Ви можете ознайомитися з визначенням тут:

source: You can also pull the definitions from the ``spatial_ref_sys`` table:
es: También puede extraer las definiciones de la tabla ``spatial_ref_sys``:
sv: Du kan också hämta definitionerna från tabellen ``spatial_ref_sys``:
uk: Ви також можете витягти визначення з таблиці ``spatial_ref_sys``:

source: Let's convert the coordinates of the 'Broad St' subway station into geographics:
es: Convirtamos las coordenadas de la estación de metro 'Broad St' a geográficas:
sv: Låt oss omvandla koordinaterna för tunnelbanestationen "Broad St" till geografi:
uk: Перетворимо координати станції метро «Broad St» у географічні:

source: If you load data or create a new geometry without specifying an SRID, the SRID value will be 0. Recall in :ref:`geometries`, that when we created our ``geometries`` table we didn't specify an SRID. If we query our database, we should expect all the ``nyc_`` tables to have an SRID of 26918, while the ``geometries`` table defaulted to an SRID of 0.
es: Si carga datos o crea una nueva geometría sin especificar un SRID, el valor de SRID será 0. Recuerde en :ref:`geometrías`, que cuando creamos nuestra tabla ``geometries`` no especificamos un SRID. Si consultamos nuestra base de datos, deberíamos esperar que todas las tablas ``nyc_`` tengan un SRID de 26918, mientras que la tabla ``geometries`` tiene de manera predeterinada un SRID de 0.
sv: Om du laddar data eller skapar en ny geometri utan att ange en SRID, kommer SRID-värdet att vara 0. Kom ihåg i :ref:`geometries`, att när vi skapade vår ``geometries``-tabell angav vi inte någon SRID. Om vi gör en sökning i vår databas kan vi förvänta oss att alla ``nyc_``-tabeller har SRID 26918, medan tabellen ``geometries`` som standard har SRID 0.
uk: Якщо ви завантажуєте дані або створюєте нову геометрію без вказання SRID, значення SRID буде 0. Згадайте в :ref:`geometries`, що коли ми створювали нашу таблицю ``geometries``, ми не вказали SRID. Якщо ми зробимо запит до нашої бази даних, ми повинні очікувати, що всі таблиці ``nyc_`` матимуть SRID 26918, тоді як таблиця ``geometries`` за замовчуванням матиме SRID 0.

source: To view a table's SRID assignment, query the database's ``geometry_columns`` table.
es: Para ver la asignación de SRID de una tabla, consulte la tabla ``geometry_columns`` de la base de datos.
sv: Om du vill visa en tabells SRID-tilldelning ställer du en fråga till databasens tabell ``geometry_columns``.
uk: Щоб переглянути призначення SRID таблиці, виконайте запит до таблиці ``geometry_columns`` бази даних.

source: However, if you know what the SRID of the coordinates is supposed to be, you can set it post-facto, using :command:`ST_SetSRID` on the geometry. Then you will be able to transform the geometry into other systems.
es: Sin embargo, si sabe cuál se supone que es el SRID de las coordenadas, puede establecerlo a posteriori usando :command:`ST_SetSRID` en la geometría. Luego podrá transformar la geometría a otros sistemas.
sv: Men om du vet vad koordinaternas SRID ska vara kan du ställa in den i efterhand genom att använda :command:`ST_SetSRID` på geometrin. Då kommer du att kunna transformera geometrin till andra system.
uk: Однак, якщо ви знаєте, яким має бути SRID координат, ви можете встановити його постфактум, використовуючи :command:`ST_SetSRID` на геометрії. Після цього ви зможете перетворити геометрію в інші системи.

source: Function List
es: Lista de funciones
sv: Funktionslista
uk: Список функцій

source: `ST_AsText <http://postgis.net/docs/ST_AsText.html>`_: Returns the Well-Known Text (WKT) representation of the geometry/geography without SRID metadata.
es: `ST_AsText <http://postgis.net/docs/ST_AsText.html>`_: Devuelve la representación Well-Known Text (WKT) de la geometría/geografía sin metadatos SRID.
sv: `ST_AsText <http://postgis.net/docs/ST_AsText.html>`_: Returnerar WKT-representationen (Well-Known Text) av geometrin/geografin utan SRID-metadata.
uk: `ST_AsText <http://postgis.net/docs/ST_AsText.html>`_: Повертає представлення геометрії/географії у вигляді добре відомого тексту (WKT) без метаданих SRID.

source: `ST_SetSRID(geometry, srid) <http://postgis.net/docs/ST_SetSRID.html>`_: Sets the SRID on a geometry to a particular integer value.
es: ST_SetSRID(geometry, srid) <http://postgis.net/docs/ST_SetSRID.html>_: Establece el SRID de una geometría en un valor entero específico.
sv: `ST_SetSRID(geometry, srid) <http://postgis.net/docs/ST_SetSRID.html>`_: Ställer in SRID på en geometri till ett visst heltalsvärde.
uk: `ST_SetSRID(geometry, srid) <http://postgis.net/docs/ST_SetSRID.html>`_: Встановлює SRID для геометрії на певне ціле значення.

source: `ST_SRID(geometry) <http://postgis.net/docs/ST_SRID.html>`_: Returns the spatial reference identifier for the ST_Geometry as defined in spatial_ref_sys table.
es: ST_SRID(geometry) <http://postgis.net/docs/ST_SRID.html>_: Devuelve el identificador de referencia espacial (SRID) de la geometría definida en la tabla spatial_ref_sys.
sv: `ST_SRID(geometri) <http://postgis.net/docs/ST_SRID.html>`_: Returnerar den spatiala referensidentifieraren för ST_Geometry enligt definitionen i tabellen spatial_ref_sys.
uk: `ST_SRID(geometry) <http://postgis.net/docs/ST_SRID.html>`_: Повертає ідентифікатор просторового посилання для ST_Geometry, як визначено в таблиці spatial_ref_sys.

source: `ST_Transform(geometry, srid) <http://postgis.net/docs/ST_Transform.html>`_: Returns a new geometry with its coordinates transformed to the SRID referenced by the integer parameter.
es: `ST_Transform(geometry, srid) <http://postgis.net/docs/ST_Transform.html>`_: Devuelve una nueva geometría con sus coordenadas transformadas al SRID indicado.
sv: `ST_Transform(geometry, srid) <http://postgis.net/docs/ST_Transform.html>`_: Returnerar en ny geometri med dess koordinater transformerade till den SRID som refereras till av heltalsparametern.
uk: `ST_Transform(geometry, srid) <http://postgis.net/docs/ST_Transform.html>`_: Повертає нову геометрію з координатами, перетвореними у SRID, на який посилається цілочисельний параметр.
