Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/projection_exercises.po
Languages: es, sv

source: Projection Exercises
es: Ejercicios sobre Proyecciones
sv: Övningar för projicering

source: Here's a reminder of some of the functions we have seen. Hint: they should be useful for the exercises!
es: Aquí tienes un recordatorio de algunas de las funciones que hemos visto. Pista: ¡serán útiles para los ejercicios!
sv: Här är en påminnelse om några av de funktioner vi har sett. Tips: de bör vara användbara för övningarna!

source: :command:`sum(expression)` aggregate to return a sum for a set of records
es: :command:`sum(expresión)` función de agregación para devolver una suma de un conjunto de registros
sv: :command:`sum(uttryck)` aggregat för att returnera en summa för en uppsättning poster

source: :command:`ST_Length(linestring)` returns the length of the linestring
es: :command:`ST_Length(linestring)` retorna la longitud de la línea
sv: :command:`ST_Length(linestring)` returnerar längden på linestring

source: :command:`ST_SRID(geometry)` returns the SRID of the geometry
es: :command:`ST_SRID(geometry)` retorna el SRID de la geometría
sv: :command:`ST_SRID(geometry)` returnerar geometrins SRID

source: :command:`ST_Transform(geometry, srid)` converts geometries into different spatial reference systems
es: :command:`ST_Transform(geometry, srid)` convierte las geometrías a un determinado SRID
sv: :command:`ST_Transform(geometry, srid)` konverterar geometrier till olika spatiala referenssystem

source: :command:`ST_GeomFromText(text)` returns ``geometry``
es: :command:`ST_GeomFromText(text)` retorna un objeto ``geometry`` desde una definición WKT
sv: :command:`ST_GeomFromText(text)` returnerar ``geometry``

source: :command:`ST_AsText(geometry)` returns WKT ``text``
es: :command:`ST_AsText(geometry)` devuelve la representación de geometry en formato WKT
sv: :command:`ST_AsText(geometry)` returnerar WKT ``text``

source: :command:`ST_AsGML(geometry)` returns GML ``text``
es: :command:`ST_AsGML(geometry)` retorna la geometría expresada como un texto GML
sv: :command:`ST_AsGML(geometry)` returnerar GML ``text``

source: Remember the online resources that are available to you:
es: Recuerde los recursos que están disponibles:
sv: Kom ihåg de online-resurser som finns tillgängliga för dig:

source: Also remember the tables we have available:
es: También recuerde las tablas que tenemos disponibles:
sv: Tänk också på de tabeller vi har tillgängliga:

source: Exercises
es: Ejercicios
sv: Övningar

source: **What is the length of all streets in New York, as measured in UTM 18?**
es: **¿Cuál es la longitud total de las calles de Nueva York, medida en UTM 18?**
sv: **Vad är längden på alla gator i New York, mätt i UTM 18?**

source: **What is the WKT definition of SRID 2831?**
es: **¿Cuál es la definición WKT del SRID 2831?**
sv: **Vad är WKT-definitionen av SRID 2831?**

source: Or, via https://epsg.io/2831
es: O, vía https://epsg.io/2831
sv: Eller, via https://epsg.io/2831

source: **What is the length of all streets in New York, as measured in SRID 2831?**
es: **¿Cuál es la longitud de todas las calles de Nueva York, medida en el SRID 2831?**
sv: **Vad är längden på alla gator i New York, mätt i SRID 2831?**

source: The difference between the UTM 18 and the State Plane Long Island measurements is (10421993 - 10418904)/10418904, or 0.02%. Calculated on the spheroid using :ref:`geography` the total street length is 10421999, which is closer to the State Plane value. This is not surprising, since the State Plane Long Island projection is precisely calibrated for a very small area (New York City) while UTM 18 has to provide reasonable results for a large regional area.
es: La diferencia entre las medidas de Long Island en UTM 18 y State Plane Long Island es de (10421993 - 10418904)/10418904, es decir, 0,02%. Calculado en el esferoide utilizando :ref:`geography` la longitud total de las calles es 10421999, que se aproxima más al valor del State Plane. Esto no es sorprendente, ya que la proyección State Plane Long Island está calibrada con precisión para un área muy pequeña (la ciudad de Nueva York), mientras que UTM 18 tiene que proporcionar resultados para un región grande.
sv: Skillnaden mellan UTM 18 och State Plane Long Island-måtten är (10421993 - 10418904)/10418904, eller 0,02%. Beräknat på sfäroiden med hjälp av :ref:`geography` är den totala gatulängden 10421999, vilket är närmare State Plane-värdet. Detta är inte förvånande, eftersom State Plane Long Island-projektionen är exakt kalibrerad för ett mycket litet område (New York City) medan UTM 18 måste ge rimliga resultat för ett stort regionalt område.

source: **How many streets cross the 74th meridian?**
es: **¿Cuántas calles cruza el meridiano 74?**
sv: **Hur många gator korsar 74:e meridianen?**

source: The "74th meridian" is a fancy way of saying "a vertical line in geographics where the X value is -74". We can construct such a line and then compare it to the streets, projected into geographics also. Projecting the line into UTM and comparing it there will return a slightly different answer. To get the same answer, you need to "segmentize" it, so it has more points, before transforming.
es: El «meridiano 74» es una forma elegante de decir «una línea vertical en geografía donde el valor X es -74». Podemos construir dicha línea y compararla con las calles, proyectadas también en geografía. Si proyectamos la línea en UTM y la comparamos allí, obtendremos una respuesta ligeramente distinta. Para obtener la misma respuesta, hay que «segmentarla», para que tenga más puntos, antes de transformarla.
sv: "74:e meridianen" är ett fint sätt att säga "en vertikal linje i geografin där X-värdet är -74". Vi kan konstruera en sådan linje och sedan jämföra den med gatorna, som också projiceras i geografin. Om man projicerar linjen i UTM och jämför den där får man ett något annorlunda svar. För att få samma svar måste du "segmentisera" den, så att den har fler punkter, innan du transformerar.
