Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/rasters.po
Languages: es, sv

source: `-F` to add file name, if you have only one tif file, this is kinda pointless. If you had multiple, this would be useful to tell you what file each row came from.
es: `-F` para añadir el nombre de archivo, si solo tienes un archivo tif, esto no tiene mucho sentido. Si tuvieras varios, sería útil para saber de qué archivo proviene cada fila.
sv: `-F` för att lägga till filnamn, om du bara har en tif-fil är det här ganska meningslöst. Om du hade flera, detta skulle vara användbart för att berätta vilken fil varje rad kom från.

source: `-t` to set the block size. Note if you are not sure the best size use, use `-t auto` instead and raster2pgql will use the same tiling as what was in the tif. The output will tell you what the blocksize is it chose. Cancel if it looks huge or weird. The original file had a size of 300x7 which is not ideal.
es: `-t` para establecer el tamaño de bloque. Nota: si no estás seguro del mejor tamaño a usar, usa `-t auto` y raster2pgql usará el mismo tamaño de teselado que el tif original. La salida te dirá cuál es el tamaño de bloque elegido. Cancela si parece enorme o extraño. El archivo original tenía un tamaño de 300x7, lo cual no es ideal.
sv: `-t` för att ställa in blockstorleken. Observera att om du inte är säker på vilken storlek som är bäst att använda, använd `-t auto` istället och raster2pgql kommer att använda samma tiling som vad som fanns i tif. Utmatningen kommer att berätta vilken blockstorlek den valde. Avbryt om det ser stort eller konstigt ut. Originalfilen hade en storlek på 300x7 vilket inte är idealiskt.

source: Use :command:`psql` to run the generated sql against the database. If you want to dump to a file instead, use `> nyc_dem.sql`
es: Usa :command:`psql` para ejecutar el sql generado contra la base de datos. Si quieres volcarlo a un archivo en su lugar, usa `> nyc_dem.sql`
sv: Använd :command:`psql` för att köra den genererade sql:en mot databasen. Om du vill dumpa till en fil istället, använd `> nyc_dem.sql`

source: For this example, we have only one tif file, so we could instead specify the full file name, instead of `*.tif`. If the files are not in your current directory, you can also specify a folder path with `*.tif`.
es: Para este ejemplo, solo tenemos un archivo tif, así que podríamos especificar el nombre completo del archivo, en lugar de `*.tif`. Si los archivos no están en tu directorio actual, también puedes especificar una ruta de carpeta con `*.tif`.
sv: I det här exemplet har vi bara en tif-fil, så vi kan i stället ange det fullständiga filnamnet i stället för `*.tif`. Om filerna inte finns i din aktuella katalog kan du också ange en mappsökväg med `*.tif`.

source: If you are on windows and need to reference the folder, make sure to include the drive letter such as `C:/workshop/*.tif`
es: Si estás en Windows y necesitas referenciar la carpeta, asegúrate de incluir la letra de la unidad, como `C:/workshop/*.tif`
sv: Om du använder Windows och behöver hänvisa till mappen, se till att inkludera enhetsbeteckningen, t.ex. `C:/workshop/*.tif`

source: You'll often hear in PostGIS lingo, the term **raster tile** and **raster** used somewhat interchangeably. A raster tile really corresponds to a particular raster in a raster column which is a subset of a bigger raster, such as this NYC dem data we just loaded. This is because when rasters are loaded into PostGIS from big raster files, they chopped into many rows to make them manageable. Each raster in each row then is a part of a bigger raster. Each tile covers same size area denoted by the blocksize you specified. Rasters are sadly limited by the 1GB PostgreSQL `TOAST <https://www.postgresql.org/docs/current/storage-toast.html>`_ limit and also the slow process of detoasting and so we need to chop up in order to achieve decent performance or to even store them.
es: A menudo escucharás en la jerga de PostGIS los términos **raster tile** y **raster** usados de manera algo intercambiable. Un raster tile realmente corresponde a un raster particular en una columna raster que es un subconjunto de un raster más grande, como estos datos DEM de NYC que acabamos de cargar. Esto se debe a que cuando los raster se cargan en PostGIS desde archivos raster grandes, se cortan en muchas filas para hacerlos manejables. Cada raster en cada fila es entonces parte de un raster más grande. Cada tile cubre un área del mismo tamaño indicada por el blocksize que especificaste. Los raster están tristemente limitados por el límite de 1GB de PostgreSQL `TOAST <https://www.postgresql.org/docs/current/storage-toast.html>`_ y también por el proceso lento de "detoasting", por lo que necesitamos cortarlos para lograr un rendimiento decente o incluso para poder almacenarlos.
sv: I PostGIS-lingo används ofta termerna **raster tile** och **raster** omväxlande. En rasterplatta motsvarar egentligen ett visst raster i en rasterkolumn som är en delmängd av ett större raster, till exempel NYC dem-data som vi just laddade. Detta beror på att när raster laddas in i PostGIS från stora rasterfiler, hackas de i många rader för att göra dem hanterbara. Varje raster i varje rad är då en del av ett större raster. Varje platta täcker samma storlek på området som anges av den blockstorlek du angav. Rasters är tyvärr begränsade av 1 GB PostgreSQL `TOAST <https://www.postgresql.org/docs/current/storage-toast.html>`_-gränsen och även den långsamma processen med detoasting och så måste vi hugga upp för att uppnå anständig prestanda eller till och med lagra dem.

source: Viewing Rasters in Browser
es: Visualizando raster en el navegador
sv: Visa raster i webbläsaren

source: Although pgAdmin and psql have no mechanism yet to view postgis rasters, we have a couple of options. For smallish rasters the easiest is to output to a web-friendly raster format such as PNG using batteries included postgis raster functions like `ST_AsPNG` or `ST_AsGDALRaster` listed in `PostGIS Raster output functions <https://postgis.net/docs/RT_reference.html#Raster_Outputs>`_. As your rasters get larger, you'll want to graduate to a tool such as QGIS to view them in all their glory or the GDAL family of commandline tools such as :command:`gdal_translate` to export them to other raster formats. Remember though, postgis rasters are built for analysis, not for generating pretty pictures for you to look at.
es: Aunque pgAdmin y psql no tienen aún un mecanismo para ver raster de PostGIS, tenemos un par de opciones. Para raster pequeños la forma más fácil es exportarlos a un formato raster amigable para la web como PNG usando funciones incluidas de PostGIS raster como `ST_AsPNG` o `ST_AsGDALRaster` listadas en `PostGIS Raster output functions <https://postgis.net/docs/RT_reference.html#Raster_Outputs>`_. A medida que tus raster sean más grandes, querrás pasar a una herramienta como QGIS para verlos en todo su esplendor o la familia de herramientas de línea de comandos GDAL como :command:`gdal_translate` para exportarlos a otros formatos raster. Recuerda, sin embargo, que los raster de PostGIS están construidos para análisis, no para generar imágenes bonitas para que las mires.
sv: Även om pgAdmin och psql ännu inte har någon mekanism för att visa postgis-raster, har vi ett par alternativ. För små raster är det enklaste att mata ut till ett webbvänligt rasterformat som PNG med hjälp av batterier som ingår i postgis rasterfunktioner som `ST_AsPNG` eller `ST_AsGDALRaster` som listas i `PostGIS Rasterutmatningsfunktioner <https://postgis.net/docs/RT_reference.html#Raster_Outputs>`_. När dina raster blir större kommer du att vilja gå över till ett verktyg som QGIS för att visa dem i all sin prakt eller GDAL-familjen med kommandoradsverktyg som :command:`gdal_translate` för att exportera dem till andra rasterformat. Kom dock ihåg att Postgis raster är byggda för analys, inte för att generera vackra bilder som du kan titta på.

source: One caveat, by default all different raster types outputs are disabled. In order to utilize these, you'll need to enable drivers, all or a subset as detailed in `Enable GDAL Raster drivers <https://postgis.net/docs/postgis_gdal_enabled_drivers.html>`_
es: Un detalle: de manera predeterminada todos los tipos de salida raster están deshabilitados. Para utilizarlos, necesitarás habilitar drivers, todos o un subconjunto, como se detalla en `Enable GDAL Raster drivers <https://postgis.net/docs/postgis_gdal_enabled_drivers.html>`_
sv: En varning, som standard är alla olika utmatningar för rastertyper inaktiverade. För att kunna använda dessa måste du aktivera drivrutiner, alla eller en delmängd enligt beskrivningen i `Aktivera GDAL Raster-drivrutiner <https://postgis.net/docs/postgis_gdal_enabled_drivers.html>`_

source: If you don't want to have to do this for each connection, you can set at the database level using:
es: Si no quieres tener que hacer esto para cada conexión, puedes establecerlo a nivel de base de datos usando:
sv: Om du inte vill behöva göra detta för varje anslutning kan du ställa in på databasnivå med hjälp av:

source: Each new connection to the database will use that setting.
es: Cada nueva conexión a la base de datos usará esa configuración.
sv: Varje ny anslutning till databasen kommer att använda den inställningen.

source: Run the below query and copy and paste the output into the address bar of your web browser.
es: Ejecuta la siguiente consulta y copia y pega la salida en la barra de direcciones de tu navegador web.
sv: Kör nedanstående fråga och kopiera och klistra in resultatet i adressfältet i din webbläsare.

source: For the rasters created thus far, we didn't specify the number of bands nor did we even define their relation to earth. As such our rasters have an unknown spatial reference system (0).
es: Para los raster creados hasta ahora, no especificamos el número de bandas ni siquiera definimos su relación con la Tierra. Como tal, nuestros raster tienen un sistema de referencia espacial desconocido (0).
sv: För de raster som skapats hittills har vi inte specificerat antalet band eller ens definierat deras relation till jorden. Därför har våra raster ett okänt spatialt referenssystem (0).

source: You can think of a rasters exoskeletal as a geometry. A matrix encased in a geometric envelop. In order to do useful analysis, we need to georeference our rasters, meaning we want each pixel (rectangle) to represent some meaningful plot of space.
es: Puedes pensar en el exoesqueleto de un raster como una geometría. Una matriz encerrada en un envolvente geométrico. Para hacer análisis útil, necesitamos georreferenciar nuestros raster, lo que significa que queremos que cada píxel (rectángulo) represente alguna parcela significativa de espacio.
sv: Man kan tänka sig ett rasters exoskelett som en geometri. En matris innesluten i ett geometriskt kuvert. För att kunna göra användbara analyser måste vi georeferera våra raster, vilket innebär att vi vill att varje pixel (rektangel) ska representera någon meningsfull del av rymden.

source: The `ST_AsRaster` has many overloaded representations. The earlier example used the simplest such implementation and accepted the default arguments which are 8BUI and 1 band, with no data being 0. If you need to use the other variants, you should use the named arguments call syntax so that you don't accidentally fall into the wrong variant of the function or get **function is not unique** errors.
es: El `ST_AsRaster` tiene muchas representaciones sobrecargadas. El ejemplo anterior usó la implementación más simple y aceptó los argumentos predeterminados que son 8BUI y 1 banda, con nodata siendo 0. Si necesitas usar las otras variantes, deberías usar la sintaxis de llamada con argumentos nombrados para no caer accidentalmente en la variante equivocada de la función o recibir errores de **function is not unique**.
sv: `ST_AsRaster` har många överladdade representationer. Det tidigare exemplet använde den enklaste implementeringen och accepterade standardargumenten som är 8BUI och 1 band, där inga data är 0. Om du behöver använda de andra varianterna bör du använda anropssyntaxen för namngivna argument så att du inte av misstag hamnar i fel variant av funktionen eller får **funktionen är inte unik**-fel.

source: If you start with a geometry that has a spatial reference system, you'll end up with a raster with same spatial reference system. In this next example, we'll plop our words in New York in bright cheery colors. We will also use pixel scale instead of width and height so that our raster pixel sizes represent 1 meter x 1 meter of space.
es: Si comienzas con una geometría que tiene un sistema de referencia espacial, terminarás con un raster con el mismo sistema de referencia espacial. En este siguiente ejemplo, colocaremos nuestras palabras en Nueva York en colores brillantes y alegres. También usaremos escala de píxel en lugar de ancho y alto para que el tamaño de nuestros píxeles raster represente 1 metro x 1 metro de espacio.
sv: Om du börjar med en geometri som har ett spatialt referenssystem kommer du att sluta med ett raster med samma spatiala referenssystem. I nästa exempel placerar vi våra ord i New York i ljusa, glada färger. Vi kommer också att använda pixelskala i stället för bredd och höjd så att våra rasterpixelstorlekar representerar 1 meter x 1 meter utrymme.

source: If we then look at this, we'll see a non-squashed colored geometry.
es: Si luego miramos esto, veremos una geometría coloreada no deformada.
sv: Om vi sedan tittar på detta ser vi en geometri som inte är färgad med kvadrater.

source: Repeat for Raster:
es: Repetir para Raster:
sv: Upprepa för Raster:

source: What is more telling, if we rerun the
es: Lo más revelador es que si volvemos a ejecutar el
sv: Vad som är mer talande är att om vi kör om

source: Observe the metadata of the New York entries. They have the New York state plane meter spatial reference system. They also have the same scale. Since each unit is 1x1 meter, the width of the word **Raster** is now wider than **Hello**.
es: Observa los metadatos de las entradas de Nueva York. Tienen el sistema de referencia espacial state plane meter de Nueva York. También tienen la misma escala. Como cada unidad es de 1x1 metro, el ancho de la palabra **Raster** es ahora mayor que **Hello**.
sv: Observera metadata för New York-posterna. De har det spatiala referenssystemet New York state plane meter. De har också samma skala. Eftersom varje enhet är 1x1 meter är bredden på ordet **Raster** nu bredare än **Hello**.

source: Raster Spatial Catalog tables
es: Tablas de catálogo espacial de raster
sv: Raster Spatiala Katalogtabeller

source: Similar to the geometry and geography types, raster has a set of catalogs that show you all raster columns in your database. These are `raster_columns and raster_overviews <https://postgis.net/docs/using_raster_dataman.html#RT_Raster_Catalog>`_.
es: Al igual que con los tipos geometry y geography, raster tiene un conjunto de catálogos que muestran todas las columnas raster en tu base de datos. Estos son `raster_columns and raster_overviews <https://postgis.net/docs/using_raster_dataman.html#RT_Raster_Catalog>`_.
sv: I likhet med geometri- och geograftyperna har raster en uppsättning kataloger som visar alla rasterkolumner i din databas. Dessa är `raster_columns och raster_overviews <https://postgis.net/docs/using_raster_dataman.html#RT_Raster_Catalog>`_.

source: The `raster_columns` view to the sibling to the `geometry_columns` and `geography_columns`, providing much the same data and more, but for raster columns.
es: La vista `raster_columns` es la hermana de `geometry_columns` y `geography_columns`, proporcionando básicamente los mismos datos y más, pero para columnas raster.
sv: Vyn `raster_columns` är syskon till `geometry_columns` och `geography_columns` och tillhandahåller i stort sett samma data och mer därtill, men för rasterkolumner.

source: Explore the table, and you'll find this:
es: Explora la tabla y encontrarás esto:
sv: Om du utforskar tabellen hittar du det här:

source: a disappointing row of largely unfilled information for the `rasters` table.
es: una fila decepcionante de datos, en gran parte sin llenar, para la tabla `rasters`.
sv: en nedslående rad med i stort sett ofylld information för `rasters` tabell.

source: Unlike geometry and geography, raster does not support type modifiers, because type modifier space is too limited and there are more critical properties than what can fit in a type modifier.
es: A diferencia de geometry y geography, raster no soporta modificadores de tipo, porque el espacio de modificador de tipo es demasiado limitado y hay propiedades más críticas que las que caben en un modificador de tipo.
sv: Till skillnad från geometri och geografi har raster inte stöd för typmodifierare, eftersom utrymmet för typmodifierare är för begränsat och det finns fler kritiska egenskaper än vad som ryms i en typmodifierare.

source: Raster instead relies on constraints, and reads these constraints back as part of the view.
es: Raster en su lugar se basa en restricciones, y lee estas restricciones como parte de la vista.
sv: Raster förlitar sig istället på begränsningar och läser tillbaka dessa begränsningar som en del av vyn.

source: Look at the other rows from the tables we loaded using :command:`raster2pgsql`. Because we used the `-C` switch :command:`raster2pgsql` added constraints for the srid and other info it was able to read from the tif or that we passed in. The overview tables generated with the `-l` switch `o_2_nyc_dem` and `o_3_nyc_dem` show up as well.
es: Mira las otras filas de las tablas que cargamos usando :command:`raster2pgsql`. Debido a que usamos la opción `-C`, :command:`raster2pgsql` añadió restricciones para el srid y otra información que pudo leer del tif o que pasamos nosotros. Las tablas de overview generadas con la opción `-l` `o_2_nyc_dem` y `o_3_nyc_dem` también aparecen.
sv: Titta på de andra raderna från de tabeller vi laddade med :command:`raster2pgsql`. Eftersom vi använde `-C`-omkopplaren lade :command:`raster2pgsql` till begränsningar för srid och annan information som den kunde läsa från tif eller som vi skickade in. Översiktstabellerna som genererades med `-l` switch `o_2_nyc_dem` och `o_3_nyc_dem` dyker också upp.

source: Let's try to add some constraints to our table.
es: Intentemos añadir algunas restricciones a nuestra tabla.
sv: Låt oss försöka lägga till några begränsningar i vår tabell.

source: And you'll be bombarded with a whole bunch of notices about how your raster data is a mess and nothing can be constrained. If you look at raster_columns again, still the same disappointing story of many blank rows for `rasters`.
es: Y serás bombardeado con un montón de avisos sobre cómo tus datos raster son un desastre y nada puede ser restringido. Si vuelves a mirar raster_columns, todavía la misma decepcionante historia de muchas filas en blanco para `rasters`.
sv: Och du kommer att bombarderas med en hel massa meddelanden om hur dina rasterdata är en röra och ingenting kan begränsas. Om du tittar på raster_columns igen, är det fortfarande samma nedslående historia med många tomma rader för `rasters`.

source: In order for constraints to be applied, all rasters in your table must be constrainable by at least one rule.
es: Para que las restricciones puedan aplicarse, todos los raster en tu tabla deben ser restringibles por al menos una regla.
sv: För att begränsningar ska kunna tillämpas måste alla raster i tabellen vara möjliga att begränsa med minst en regel.

source: We can perhaps do this, let's just lie and say all our data is in New York State plane.
es: Podemos quizás hacer esto, digamos simplemente que todos nuestros datos están en el sistema de coordenadas state plane de Nueva York.
sv: Vi kan kanske göra det här, låt oss bara ljuga och säga att alla våra data finns i New York State-planet.

source: Ah progress:
es: Ah, progreso:
sv: Ah framsteg:

source: The more you can constrain all your rasters, the more columns you'll see filled in and also the more operations you'll be able to do across all the tiles in your raster. Keep in mind that in some cases, you may not want to apply all constraints.
es: Cuanto más puedas restringir todos tus raster, más columnas verás llenas y también más operaciones podrás realizar en todos los tiles de tu raster. Ten en cuenta que en algunos casos puede que no quieras aplicar todas las restricciones.
sv: Ju mer du kan begränsa alla dina raster, desto fler kolumner kommer du att se ifyllda och desto fler operationer kommer du att kunna göra över alla plattor i ditt raster. Tänk på att du i vissa fall kanske inte vill tillämpa alla begränsningar.

source: For example, if you plan to load more data into your raster table, you'll want to skip the extent constraint since that would require that all rasters are within the extent of the extent constraint.
es: Por ejemplo, si planeas cargar más datos en tu tabla raster, querrás omitir la restricción de extensión ya que eso requeriría que todos los raster estén dentro de la extensión de la restricción.
sv: Om du till exempel planerar att ladda mer data i din rastertabell vill du hoppa över extent-begränsningen eftersom det skulle kräva att alla raster ligger inom extent-begränsningens omfattning.

source: Raster overview columns appear both in the `raster_columns` meta catalog and another meta catalog called `raster_overviews`. Overviews are used mostly to speed up viewing at higher zoom levels. They can also be used for quick back of the envelop analysis, providing less accurate stats, but at a much faster speed than applying to the raw raster table.
es: Las columnas de raster overview aparecen tanto en el meta-catálogo `raster_columns` como en otro meta-catálogo llamado `raster_overviews`. Los overviews se usan principalmente para acelerar la visualización en niveles de zoom altos. También pueden usarse para análisis rápidos y aproximados, proporcionando estadísticas menos precisas, pero a una velocidad mucho mayor que al aplicar sobre la tabla raster original.
sv: Rasteröversiktskolumner visas både i metakatalogen `raster_columns` och i en annan metakatalog som heter `raster_overviews`. Översikter används främst för att snabba upp visningen vid högre zoomnivåer. De kan också användas för snabb analys av baksidan av kuvertet, vilket ger mindre exakt statistik, men med en mycket snabbare hastighet än att tillämpa på den råa rastertabellen.

source: To inspect the overviews, run:
es: Para inspeccionar los overviews, ejecuta:
sv: Kör för att inspektera översikterna:

source: and you'll see the output:
es: y verás la salida:
sv: och du kommer att se resultatet:

source: The `raster_overviews` table only provides you the overview_factor and the name of the parent table. All this information is something you could have figured out yourself by the `raster2pgsql` naming convention for overviews.
es: La tabla `raster_overviews` solo te proporciona el overview_factor y el nombre de la tabla padre. Toda esta información es algo que podrías haber deducido tú mismo por la convención de nombres de `raster2pgsql` para overviews.
sv: Tabellen `raster_overviews` ger dig bara overview_factor och namnet på den överordnade tabellen. All denna information är något som du själv kunde ha räknat ut med hjälp av `raster2pgsql` namnkonvention för översikter.
