Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/rasters.po
Languages: es, sv

source: The `overview_factor` tells you at what resolution the row is with respect to it's parent. An `overview_factor` of `2` means that 2x2 = 4 tiles can fit into one overview_2 tile. Similarly an overview_factor of `3` meants that 2x2x2 = 8 tiles of the original can be shoved into an overview_3 tile.
es: El `overview_factor` te dice en qué resolución está la fila con respecto a su padre. Un `overview_factor` de `2` significa que 2x2 = 4 tiles pueden caber en un tile overview_2. De manera similar, un overview_factor de `3` significa que 2x2x2 = 8 tiles del original pueden agruparse en un tile overview_3.
sv: Overview-faktorn anger vilken upplösning raden har i förhållande till sin överordnade enhet. En `overview_factor` på `2` innebär att 2x2 = 4 plattor får plats på en overview_2-platta. På samma sätt innebär en overview_factor på `3` att 2x2x2 = 8 plattor av originalet kan tryckas in i en overview_3-platta.

source: Common Raster Functions
es: Funciones raster comunes
sv: Vanliga rasterfunktioner

source: The :command:`postgis_raster` extension has over 100 functions to choose from. PostGIS raster functionality was patterned after the PostGIS geometry support. You'll find an overlap of functions between raster and geometry where it makes sense. Common ones you'll use that have equivalent in geometry world are :command:`ST_Intersects`, :command:`ST_SetSRID`, :command:`ST_SRID`, :command:`ST_Union`, :command:`ST_Intersection`, and :command:`ST_Transform`.
es: La extensión :command:`postgis_raster` tiene más de 100 funciones para elegir. La funcionalidad raster de PostGIS fue diseñada siguiendo el soporte de geometría de PostGIS. Encontrarás una superposición de funciones entre raster y geometría donde tiene sentido. Algunas comunes que usarás y que tienen equivalentes en el mundo de geometría son: :command:`ST_Intersects`, :command:`ST_SetSRID`, :command:`ST_SRID`, :command:`ST_Union`, :command:`ST_Intersection`, y :command:`ST_Transform`.
sv: Tillägget :command:`postgis_raster` har över 100 funktioner att välja mellan. PostGIS rasterfunktionalitet har utformats efter PostGIS geometristöd. Du kommer att hitta en överlappning av funktioner mellan raster och geometri där det är vettigt. Vanliga funktioner som du kommer att använda och som har motsvarigheter i geometrivärlden är :command:`ST_Intersects`, :command:`ST_SetSRID`, :command:`ST_SRID`, :command:`ST_Union`, :command:`ST_Intersection` och :command:`ST_Transform`.

source: In addition to those overlapping functions, it supports the `&&` overlap operator between rasters and between a raster and geometry. It also offers many functions that work in conjunction with geometry or are very specific to rasters.
es: Además de esas funciones superpuestas, soporta el operador `&&` de solapamiento entre rasters y entre un raster y una geometría. También ofrece muchas funciones que trabajan en conjunto con geometría o que son muy específicas de raster.
sv: Förutom dessa överlappande funktioner har programmet stöd för överlappningsoperatorn `&&` mellan raster och mellan ett raster och geometri. Det finns också många funktioner som fungerar tillsammans med geometri eller som är mycket specifika för raster.

source: You need a function like :command:`ST_Union` to reconstitute a region. Because performance gets slow, the more pixels a function needs to analyse, you need a fast acting function :command:`ST_Clip` to clip the rasters to just the portions of interest for your analysis.
es: Necesitas una función como :command:`ST_Union` para reconstituir una región. Debido a que el rendimiento se vuelve lento mientras más píxeles necesita analizar una función, necesitas una función de acción rápida :command:`ST_Clip` para recortar los raster solo a las porciones de interés para tu análisis.
sv: Du behöver en funktion som :command:`ST_Union` för att återskapa en region. Eftersom prestanda blir långsammare ju fler bildpunkter en funktion behöver analysera, behöver du en snabbverkande funktion :command:`ST_Clip` för att klippa rastren till bara de delar som är intressanta för din analys.

source: Finally you need :command:`ST_Intersects` or :command:`&&` to zoom in on the raster tiles that contain your areas of interest. The `&&` operator, is a faster process than the `ST_Intersects`. Both can take advantage of raster spatial indexes. We'll cover these bread and butter functions first before moving on to other sections where we will use them in concert with other raster and geometry functions.
es: Finalmente necesitas :command:`ST_Intersects` o :command:`&&` para acercarte a los tiles raster que contienen tus áreas de interés. El operador `&&` es un proceso más rápido que :command:`ST_Intersects`. Ambos pueden aprovechar los índices espaciales raster. Cubriremos estas funciones esenciales primero antes de pasar a otras secciones donde las usaremos en conjunto con otras funciones raster y de geometría.
sv: Slutligen behöver du :command:`ST_Intersects` eller :command:`&&` för att zooma in på de rasterplattor som innehåller dina intresseområden. Operatorn `&&` är en snabbare process än `ST_Intersects`. Båda kan dra nytta av spatiala index för raster. Vi går först igenom dessa grundläggande funktioner innan vi går vidare till andra avsnitt där vi använder dem tillsammans med andra raster- och geometrifunktioner.

source: Unioning Rasters with ST_Union
es: Uniendo rasters con ST_Union
sv: Sammanslagning av raster med ST_Union

source: The `ST_Union <https://postgis.net/docs/RT_ST_Union.html>`_ function for raster, just as the geometry equivalent :command:`ST_Union`, aggregates a set of rasters together into a single raster. However, just as with geometry, not all rasters can be combined together, but the rules for raster unioning are more complicated than geometry rules. In the case of geometries, all you need is to have the same spatial reference system, but for rasters that is not sufficient.
es: La función `ST_Union <https://postgis.net/docs/RT_ST_Union.html>`_ para raster, al igual que su equivalente en geometría :command:`ST_Union`, agrega un conjunto de raster en un solo raster. Sin embargo, al igual que con geometría, no todos los raster pueden combinarse, pero las reglas para unir raster son más complicadas que las reglas de geometría. En el caso de geometrías, todo lo que necesitas es tener el mismo sistema de referencia espacial, pero para raster eso no es suficiente.
sv: Funktionen `ST_Union <https://postgis.net/docs/RT_ST_Union.html>`_ för raster, precis som geometrins motsvarighet :command:`ST_Union`, sammanför en uppsättning raster till ett enda raster. Precis som med geometri kan dock inte alla raster kombineras, men reglerna för rasterunionering är mer komplicerade än geometrireglerna. När det gäller geometrier räcker det med att ha samma spatiala referenssystem, men för raster är det inte tillräckligt.

source: If you were to attempt, the following:
es: Si intentaras lo siguiente:
sv: Om du skulle försöka, följande:

source: You'd be summarily punished with an error:
es: Serías castigado inmediatamente con un error:
sv: Du skulle bli summariskt straffad med ett fel:

source: **ERROR: rt_raster_from_two_rasters: The two rasters provided do not have the same alignment SQL state: XX000**
sv: **ERROR: rt_raster_from_two_rasters: De två raster som tillhandahålls har inte samma inriktning SQL-status: XX000**

source: What is this same alignment thing, that is preventing you from unioning your precious rasters?
es: ¿Qué es esto del mismo alineamiento, que impide unir tus preciados raster?
sv: Vad är det för något med denna inriktning som hindrar dig från att sammanfoga dina värdefulla raster?

source: In order for rasters to be combined, they need to be on the same grid so to speak. Meaning they must have same pixel sizes, same orientation (the skew), same spatial reference system, and their pixels must not cut into each other, meaning they share the same worldly pixel grid.
es: Para que los raster se combinen, deben estar en la misma grilla por así decirlo. Esto significa que deben tener los mismos tamaños de píxel, la misma orientación (la inclinación), el mismo sistema de referencia espacial, y sus píxeles no deben cortarse entre sí, es decir, deben compartir la misma grilla de píxeles en el mundo.
sv: För att raster ska kunna kombineras måste de så att säga vara på samma rutnät. Det innebär att de måste ha samma pixelstorlekar, samma orientering (skevheten), samma spatiala referenssystem och att deras bildpunkter inte får korsa in i varandra, vilket innebär att de delar samma världsliga pixelnät.

source: If you try the same query, but just with words we carefully placed in New York.
es: Si intentas la misma consulta, pero solo con palabras que colocamos cuidadosamente en Nueva York.
sv: Om du försöker samma fråga, men bara med ord som vi noggrant placerat i New York.

source: Again, the same error. These are the same spatial ref system, the same pixel sizes, and yet it's still not good enough. Because their grids are off.
es: De nuevo, el mismo error. Estos son el mismo sistema de referencia espacial, los mismos tamaños de píxel, y aun así no es suficiente. Porque sus grillas no coinciden.
sv: Återigen, samma fel. Det är samma spatiala ref-system, samma pixelstorlekar, och ändå är det inte tillräckligt bra. För att deras rutnät är fel.

source: We can fix this by shifting the upper left y coordinates ever so slightly and then trying again. If our grids start at integer level since our pixel sizes are whole integer, then the pixels won't cut into each other.
es: Podemos arreglar esto ajustando ligeramente las coordenadas superiores izquierdas en y y luego probando de nuevo. Si nuestras grillas comienzan a nivel entero, ya que nuestros tamaños de píxel son enteros, entonces los píxeles no se cortarán entre sí.
sv: Vi kan åtgärda detta genom att flytta de övre vänstra y-koordinaterna en aning och sedan försöka igen. Om våra rutnät börjar på heltalsnivå eftersom våra pixelstorlekar är hela heltal, kommer bildpunkterna inte att korsa in i varandra.

source: Voila it worked, and if we were to view, we'd see something like this:
es: Voilà, funcionó, y si lo viéramos, veríamos algo como esto:
sv: Voila det fungerade, och om vi skulle visa, skulle vi se något liknande detta:

source: If ever you are unclear why your rasters don't have the same alignment, you can use the function `ST_SameAlignment <https://postgis.net/docs/RT_ST_SameAlignment.html>`_, which will compare 2 rasters or a set of rasters and tell you if they have the same alignment. If you have notices enabled, the NOTICE will tell you what is off with the rasters in question. The `ST_NotSameAlignmentReason <https://postgis.net/docs/RT_ST_NotSameAlignmentReason.html>`_, instead of just a notice will output the reason. It however only works with two rasters at a time.
es: Si alguna vez no tienes claro por qué tus raster no tienen el mismo alineamiento, puedes usar la función `ST_SameAlignment <https://postgis.net/docs/RT_ST_SameAlignment.html>`_, que comparará 2 raster o un conjunto de raster y te dirá si tienen el mismo alineamiento. Si tienes los avisos habilitados, el NOTICE te dirá qué está mal con los raster en cuestión. La función `ST_NotSameAlignmentReason <https://postgis.net/docs/RT_ST_NotSameAlignmentReason.html>`_, en lugar de solo un aviso, devolverá la razón. Sin embargo, solo funciona con dos raster a la vez.
sv: Om du någonsin är osäker på varför dina raster inte har samma inriktning kan du använda funktionen `ST_SameAlignment <https://postgis.net/docs/RT_ST_SameAlignment.html>`_, som jämför 2 raster eller en uppsättning raster och talar om för dig om de har samma inriktning. Om du har aktiverat notiser kommer NOTICE att berätta vad som är fel med rastrerna i fråga. Med `ST_NotSameAlignmentReason <https://postgis.net/docs/RT_ST_NotSameAlignmentReason.html>`_, istället för bara ett meddelande, kommer orsaken att matas ut. Det fungerar dock bara med två raster åt gången.

source: One major way in which the `ST_Union(raster) <https://postgis.net/docs/RT_ST_Union.html>`_ raster function deviates from the `ST_Union(geometry) <https://postgis.net/docs/ST_Union.html>`_ geometry function is that it allows for an argument called *uniontype*. This argument by default is set to `LAST` if you don't specify it, which means, take the **LAST** raster pixel values in occasions where the raster pixel values overlap. As a general rule, pixels in a band that are marked as no-data are ignored.
es: Una forma importante en que la función `ST_Union(raster) <https://postgis.net/docs/RT_ST_Union.html>`_ difiere de la función `ST_Union(geometry) <https://postgis.net/docs/ST_Union.html>`_ es que permite un argumento llamado *uniontype*. Este argumento por defecto se establece en `LAST` si no lo especificas, lo que significa tomar los valores de píxeles del **LAST** raster en las ocasiones donde los valores de píxeles raster se superponen. Como regla general, los píxeles en una banda que están marcados como no-data se ignoran.
sv: Ett viktigt sätt på vilket rasterfunktionen `ST_Union(raster) <https://postgis.net/docs/RT_ST_Union.html>`_ avviker från geometrifunktionen `ST_Union(geometry) <https://postgis.net/docs/ST_Union.html>`_ är att den tillåter ett argument som kallas *uniontype*. Detta argument är som standard inställt på `LAST` om du inte anger det, vilket innebär att du tar de **LAST** rasterpixelvärdena vid tillfällen där rasterpixelvärdena överlappar varandra. Som en allmän regel ignoreras bildpunkter i ett band som är markerade som no-data.

source: Just as with most aggregates in PostgreSQL, you can put a :command:`ORDER BY` clause as part of the function call as is done in the prior example. Specifying the order, allows you to control which raster takes priority. So in our prior example, *Raster* trumped *Hello* because *Raster* is alphabetically last.
es: Al igual que con la mayoría de los agregados en PostgreSQL, puedes poner una cláusula :command:`ORDER BY` como parte de la llamada a la función, como se hace en el ejemplo anterior. Especificar el orden te permite controlar qué raster tiene prioridad. Así que en nuestro ejemplo anterior, *Raster* venció a *Hello* porque *Raster* es alfabéticamente el último.
sv: Precis som med de flesta aggregat i PostgreSQL kan du lägga till en :command: `ORDER BY` -klausul som en del av funktionsanropet som görs i det tidigare exemplet. Genom att ange ordningen kan du styra vilken raster som prioriteras. Så i vårt tidigare exempel trumfade *Raster* *Hello* eftersom *Raster* är alfabetiskt sist.

source: Observe, if you switch the order:
es: Observa, si cambias el orden:
sv: Observera, om du byter ordning:

source: Then *Hello* trumps *Raster* because Hello is now the last overlaid.
es: Entonces *Hello* vence a *Raster* porque Hello ahora es el último superpuesto.
sv: Sedan övertrumfar *Hello* *Raster* eftersom Hello nu är den sista överlagrade.

source: The :command:`FIRST` union type is the reverse of :command:`LAST`.
es: El tipo de unión :command:`FIRST` es lo contrario de :command:`LAST`.
sv: Unionstypen :command:`FIRST` är motsatsen till :command:`LAST`.

source: But on occassion, **LAST** may not be the right operation. Let's suppose our rasters represented two different sets of observations from two different devices. These devices measure the same thing, and we aren't sure which is right when they cross paths, so we'd instead like to take the `MEAN` of the results. We'd do this:
es: Pero en ocasiones, **LAST** puede no ser la operación correcta. Supongamos que nuestros raster representan dos conjuntos diferentes de observaciones de dos dispositivos distintos. Estos dispositivos miden lo mismo, y no estamos seguros de cuál es correcto cuando se cruzan, por lo que en su lugar nos gustaría tomar el `MEAN` de los resultados. Haríamos esto:
sv: Men ibland kanske **LAST** inte är rätt operation. Låt oss anta att våra raster representerade två olika uppsättningar observationer från två olika enheter. Dessa enheter mäter samma sak, och vi är inte säkra på vilken som är rätt när de korsar vägar, så vi skulle istället vilja ta "medelvärdet" av resultaten. Vi skulle göra så här:

source: So instead of trumping, we have a blending of the two forces. In the case of :command:`MEAN` union type, there is no point in specifying order, because the result would be the average of overlapping pixel values.
es: Así que en lugar de imponerse, tenemos una mezcla de las dos fuerzas. En el caso del tipo de unión :command:`MEAN`, no tiene sentido especificar el orden, porque el resultado sería el promedio de los valores de píxeles superpuestos.
sv: Så istället för att trumfa, har vi en blandning av de två krafterna. När det gäller unionstypen :command:`MEAN` är det meningslöst att ange ordning, eftersom resultatet blir ett genomsnitt av överlappande pixelvärden.

source: Note that for geometries since geometries are vector and thus have no values besides there or not there, there really isn't any ambiguity on how to combine two vectors when they intersect.
es: Ten en cuenta que para geometrías, dado que las geometrías son vectores y, por lo tanto, no tienen valores aparte de estar o no estar, realmente no hay ambigüedad sobre cómo combinar dos vectores cuando se intersectan.
sv: Observera att för geometrier, eftersom geometrier är vektorer och därmed inte har några värden förutom där eller inte där, finns det egentligen ingen tvetydighet om hur man kombinerar två vektorer när de korsar varandra.

source: Another feature of the raster :command:`ST_Union` we glossed over, is this idea of if you should return all bands or just some bands. When you don't specify what bands to union, :command:`ST_Union` will combine same banded numbers and use the :command:`LAST` unioning strategy. If you have multiple bands, this may not be what you want to do. Perhaps you only want to union, the second band. In this case, the Green Band and you want the count of pixel values.
es: Otra característica del raster :command:`ST_Union` que pasamos por alto, es esta idea de si deberías devolver todas las bandas o solo algunas bandas. Cuando no especificas qué bandas unir, :command:`ST_Union` combinará los números de las mismas bandas y usará la estrategia de unión :command:`LAST`. Si tienes múltiples bandas, esto puede no ser lo que quieras hacer. Quizás solo quieras unir la segunda banda. En este caso, la banda verde, y quieres el conteo de valores de píxel.
sv: En annan egenskap hos raster :command:`ST_Union` som vi glömde bort är tanken på om du ska returnera alla band eller bara vissa band. När du inte anger vilka band som ska förenas kommer :command:`ST_Union` att kombinera samma bandnummer och använda :command:`LAST`-strategin för förening. Om du har flera band är detta kanske inte vad du vill göra. Du kanske bara vill förena det andra bandet. I det här fallet är det det gröna bandet och du vill ha antalet pixelvärden.

source: Note in the case of the **COUNT** union type, which counts the number of pixels filled in and returns that value, the result is always a **32BUI** similar to how when you do a :command:`COUNT` in sql, the result is always a bigint, to accommodate large counts.
es: Nota que en el caso del tipo de unión **COUNT**, que cuenta el número de píxeles rellenados y devuelve ese valor, el resultado es siempre un **32BUI** similar a cómo cuando haces un :command:`COUNT` en SQL, el resultado siempre es un bigint, para acomodar conteos grandes.
sv: Observera att när det gäller unionstypen **COUNT**, som räknar antalet bildpunkter som fyllts i och returnerar det värdet, är resultatet alltid ett **32BUI** på samma sätt som när du gör ett :command:`COUNT` i sql, är resultatet alltid ett bigint, för att tillgodose stora räkningar.

source: In other cases, the band pixel type does not change and is set to the max value or rounded if the amounts exceed the bounds of the type. Why would anyone ever want to count pixels that intersect at a location. Well suppose each of your rasters represent police squadrons and incidents of arrests in the areas. Each value, might represent a different kind of arrest reason. You are doing stats on how many arrests in each region, therefore you only care about the count of arrests.
es: En otros casos, el tipo de píxel de la banda no cambia y se establece en el valor máximo o se redondea si las cantidades exceden los límites del tipo. ¿Por qué alguien querría contar píxeles que se intersectan en una ubicación? Bueno, supongamos que cada uno de tus raster representa escuadrones de policía e incidentes de arrestos en las áreas. Cada valor podría representar una razón diferente de arresto. Estás haciendo estadísticas sobre cuántos arrestos en cada región, por lo tanto solo te importa el conteo de arrestos.
sv: I andra fall ändras inte bandpixeltypen och den ställs in på maxvärdet eller avrundas om beloppen överskrider gränserna för typen. Varför skulle någon någonsin vilja räkna bildpunkter som korsar varandra på en plats. Anta att alla dina raster representerar polisskvadroner och incidenter med arresteringar i områdena. Varje värde kan representera en annan typ av arresteringsorsak. Du gör statistik över hur många arresteringar i varje region, därför bryr du dig bara om antalet arresteringar.

source: Or perhaps, you want to do all bands, but you want different strategies.
es: O quizás quieras usar todas las bandas, pero quieres diferentes estrategias.
sv: Eller kanske vill du göra alla band, men du vill ha olika strategier.

source: Using the *unionarg[]* variant of the :command:`ST_Union` function, also allows you to shuffle the order of the bands.
es: Usar la variante *unionarg[]* de la función :command:`ST_Union`, también te permite reorganizar el orden de las bandas.
sv: Om du använder varianten *unionarg[]* av funktionen :command:`ST_Union` kan du också blanda om ordningen på banden.

source: Clipping Rasters with help of ST_Intersects
es: Recortando raster con ayuda de ST_Intersects
sv: Klippning av Rasters med hjälp av ST_Intersects

source: The `ST_Clip <https://postgis.net/docs/RT_ST_Clip.html>`_ function is one of the most widely used functions for PostGIS rasters. The main reason is the more pixels you need to inspect or do operations on, the slower your processing. **ST_Clip** clips your raster to just the area of interest, so you can isolate your operations to just that area.
es: La función `ST_Clip <https://postgis.net/docs/RT_ST_Clip.html>`_ es una de las funciones más utilizadas para raster en PostGIS. La razón principal es que mientras más píxeles necesites inspeccionar o realizar operaciones, más lento será tu procesamiento. **ST_Clip** recorta tu raster solo al área de interés, para que puedas aislar tus operaciones únicamente a esa área.
sv: Funktionen `ST_Clip <https://postgis.net/docs/RT_ST_Clip.html>`_ är en av de mest använda funktionerna för PostGIS-raster. Huvudskälet är att ju fler bildpunkter du behöver inspektera eller göra operationer på, desto långsammare blir din bearbetning. **ST_Clip** klipper ditt raster till bara det intressanta området, så att du kan isolera dina operationer till bara det området.
