Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/rasters.po
Languages: es, sv

source: Rasters
sv: Raster

source: PostGIS supports another kind of spatial data type called a *raster*. Raster data, much like geometry data, uses **Cartesian coordinates** and a spatial reference system. However instead of vector data, raster data is represented as an n-dimensional matrix consisting of pixels and bands. The bands defines the number of matrices you have. Each pixel stores a value corresponding to each band. So a 3-banded raster such as an RGB image, would have 3 values for each pixel corresponding to the Red-Green-Blue bands.
es: PostGIS soporta otro tipo de dato espacial llamado *raster*. Los datos raster, al igual que los datos de geometría, usan **coordenadas cartesianas** y un sistema de referencia espacial. Sin embargo, en lugar de datos vectoriales, los datos raster se representan como una matriz n-dimensional compuesta de píxeles y bandas. Las bandas definen el número de matrices que tienes. Cada píxel almacena un valor correspondiente a cada banda. Así, un raster de 3 bandas como una imagen RGB, tendría 3 valores para cada píxel correspondientes a las bandas Rojo-Verde-Azul.
sv: PostGIS stöder en annan typ av spatial datatyp som kallas *raster*. Rasterdata använder, precis som geometridata, **kartesiska koordinater** och ett spatialt referenssystem. Men istället för vektordata representeras rasterdata som en n-dimensionell matris som består av bildpunkter och band. Banden definierar antalet matriser du har. Varje pixel lagrar ett värde som motsvarar varje band. Så en 3-bandsraster, t.ex. en RGB-bild, skulle ha 3 värden för varje pixel som motsvarar banden rött-grönt-blått.

source: Although pretty pictures such as those you see on your TV screen are rasters, rasters may not be that exciting to look at. In a nutshell, a raster is a matrix, pinned on a coordinate system, that has values that can represent anything you want them to represent.
es: Aunque imágenes bonitas como las que ves en la pantalla de tu televisor son raster, los raster pueden no ser tan emocionantes de ver. En pocas palabras, un raster es una matriz, fijada en un sistema de coordenadas, que tiene valores que pueden representar lo que quieras que representen.
sv: Även om vackra bilder, som de du ser på din TV-skärm, är raster, är raster kanske inte så spännande att titta på. I ett nötskal är ett raster en matris, fäst i ett koordinatsystem, som har värden som kan representera vad du vill att de ska representera.

source: Since rasters live in cartesian space, rasters can interact with geometries. PostGIS offers many functions that take as input both rasters and geometries. Many operations applied to rasters will result in geometries. Common ones are the `ST_Polygon`, `ST_Envelope`, `ST_ConvexHull`, and `ST_MinConvexHull` as shown below. When you cast a raster to a geometry, what is output is the `ST_ConvexHull` of the raster.
es: Dado que los raster viven en el espacio cartesiano, los raster pueden interactuar con geometrías. PostGIS ofrece muchas funciones que toman como entrada tanto raster como geometrías. Muchas operaciones aplicadas a raster resultarán en geometrías. Algunas comunes son `ST_Polygon`, `ST_Envelope`, `ST_ConvexHull`, y `ST_MinConvexHull` como se muestra a continuación. Cuando conviertes un raster en una geometría, lo que se genera es el `ST_ConvexHull` del raster.
sv: Eftersom raster lever i kartesiskt rum kan raster interagera med geometrier. PostGIS erbjuder många funktioner som tar både raster och geometrier som indata. Många operationer som tillämpas på raster kommer att resultera i geometrier. Vanliga sådana är `ST_Polygon`, `ST_Envelope`, `ST_ConvevexHull` och `ST_MinConvexHull` enligt nedan. När du kastar ett raster till en geometri, är det som matas ut `ST_ConvevexHull` av rastret.

source: The raster format is commonly used to store elevation data, temperature data, satellite data, and thematic data representing things like environmental contamination, population density, and environmental hazard occurrences. You can use rasters to store any numeric data that has a meaningful coordinate location. The only restriction is that for all data in a specific band the numeric data types have to be the same.
es: El formato raster se usa comúnmente para almacenar datos de elevación, datos de temperatura, datos satelitales y datos temáticos que representan cosas como contaminación ambiental, densidad poblacional y ocurrencias de riesgos ambientales. Puedes usar raster para almacenar cualquier dato numérico que tenga una ubicación de coordenadas significativa. La única restricción es que para todos los datos en una banda específica los tipos de datos numéricos deben ser los mismos.
sv: Rasterformatet används ofta för att lagra höjddata, temperaturdata, satellitdata och tematiska data som representerar saker som miljöföroreningar, befolkningstäthet och förekomster av miljöfaror. Du kan använda raster för att lagra alla numeriska data som har en meningsfull koordinatplacering. Den enda begränsningen är att de numeriska datatyperna måste vara desamma för alla data i ett visst band.

source: Although raster data can be created from scratch in PostGIS, a more common approach is to load raster data from various formats using the :command:`raster2pgsql` command line tool packaged with PostGIS. Before all of that, you must enable raster support in your database by running the command:
es: Aunque los datos raster pueden crearse desde cero en PostGIS, un enfoque más común es cargar datos raster desde varios formatos usando la herramienta de línea de comandos :command:`raster2pgsql` incluida con PostGIS. Antes de todo eso, debes habilitar el soporte raster en tu base de datos ejecutando el comando:
sv: Även om rasterdata kan skapas från grunden i PostGIS är det vanligare att ladda rasterdata från olika format med hjälp av kommandot :command:`raster2pgsql` som medföljer PostGIS. Innan allt detta måste du aktivera rasterstöd i din databas genom att köra kommandot:

source: Creating Rasters From Geometries
es: Creando raster desde geometrías
sv: Skapa Raster från Geometrier

source: We'll start off by first creating raster data from vector data, and then move on to the more exciting approach of loading data from a raster source. You will find that raster data is available in abundance and often free from various government sites.
es: Comenzaremos creando datos raster a partir de datos vectoriales, y luego pasaremos al enfoque más interesante de cargar datos desde una fuente raster. Verás que los datos raster están disponibles en abundancia y, a menudo, de forma gratuita en varios sitios gubernamentales.
sv: Vi börjar med att skapa rasterdata från vektordata och går sedan vidare till den mer spännande metoden att ladda data från en rasterkälla. Du kommer att upptäcka att rasterdata finns tillgängliga i överflöd och ofta gratis från olika myndighetssidor.

source: We'll start by converting some geometries into rasters using `ST_AsRaster <https://postgis.net/docs/RT_ST_AsRaster.html>`_ function as follows.
es: Comenzaremos convirtiendo algunas geometrías en raster usando la función `ST_AsRaster <https://postgis.net/docs/RT_ST_AsRaster.html>`_ de la siguiente manera.
sv: Vi börjar med att konvertera några geometrier till raster med hjälp av funktionen `ST_AsRaster <https://postgis.net/docs/RT_ST_AsRaster.html>`_ på följande sätt.

source: The above example CREATEs a table (**rasters**) from geometries formed from letters using the PostGIS 3.2+ `ST_Letters <https://postgis.net/docs/ST_Letters.html>`_ function. Rasters similar to geometries, can take advantage of spatial indexes. The spatial index used for raster is a functional index that indexes the geometry convexhull of the raster.
es: El ejemplo anterior crea una tabla (**rasters**) a partir de geometrías formadas de letras usando la función `ST_Letters <https://postgis.net/docs/ST_Letters.html>`_ de PostGIS 3.2+. Los raster, al igual que las geometrías, pueden aprovechar los índices espaciales. El índice espacial usado para raster es un índice funcional que indexa el convexhull geométrico del raster.
sv: I exemplet ovan CREATEs en tabell (**rasters**) från geometrier som bildats av bokstäver med hjälp av PostGIS 3.2+ `ST_Letters <https://postgis.net/docs/ST_Letters.html>`_-funktionen. Raster kan på samma sätt som geometrier dra nytta av spatiala index. Det spatiala indexet som används för raster är ett funktionellt index som indexerar rastrets geometriska konvexskal.

source: You can see some useful metadata of your rasters with the following query which utilizes the postgis raster `ST_Count <https://postgis.net/docs/RT_ST_Count.html>`_ function to count the number of pixels that have data and the `ST_MetaData <https://postgis.net/docs/RT_ST_MetaData.html>`_ function to provide all sorts of useful background info for our rasters.
es: Puedes ver algunos metadatos útiles de tus raster con la siguiente consulta que utiliza la función raster de postgis `ST_Count <https://postgis.net/docs/RT_ST_Count.html>`_ para contar el número de píxeles que tienen datos y la función `ST_MetaData <https://postgis.net/docs/RT_ST_MetaData.html>`_ para proporcionar todo tipo de información de fondo útil para nuestros raster.
sv: Du kan se några användbara metadata för dina raster med följande fråga som använder postgis raster `ST_Count <https://postgis.net/docs/RT_ST_Count.html>`_-funktionen för att räkna antalet bildpunkter som har data och `ST_MetaData <https://postgis.net/docs/RT_ST_MetaData.html>`_-funktionen för att tillhandahålla alla typer av användbar bakgrundsinformation för våra raster.

source: There are two levels of raster functions. There are functions such as ST_MetaData that work at the raster level and there are functions such as :command:`ST_Count` function and `ST_BandMetaData <https://postgis.net/docs/RT_ST_BandMetaData.html>`_ function that work at the band level. Most functions in postgis raster that work at the band level, work with only one band at a time, and assume the band you want is `1`.
es: Hay dos niveles de funciones raster. Hay funciones como ST_MetaData que trabajan a nivel de raster y hay funciones como la función :command:`ST_Count` y la función `ST_BandMetaData <https://postgis.net/docs/RT_ST_BandMetaData.html>`_ que trabajan a nivel de banda. La mayoría de las funciones en postgis raster que trabajan a nivel de banda, funcionan con solo una banda a la vez, y asumen que la banda que quieres es la `1`.
sv: Det finns två nivåer av rasterfunktioner. Det finns funktioner som ST_MetaData som arbetar på rasternivå och det finns funktioner som :command:`ST_Count`-funktionen och `ST_BandMetaData <https://postgis.net/docs/RT_ST_BandMetaData.html>`_-funktionen som arbetar på bandnivå. De flesta funktioner i postgis raster som arbetar på bandnivå arbetar bara med ett band i taget och antar att det band du vill ha är `1`.

source: If you have a multi-band raster, and you need to count the pixel not no-data values in a band other than 1, you would explicitly specify the band number as follows `ST_Count(rast,2)`.
es: Si tienes un raster multibanda, y necesitas contar los valores de píxeles no nulos en una banda distinta de la 1, deberías especificar explícitamente el número de banda como sigue `ST_Count(rast,2)`.
sv: Om du har ett raster med flera band och du behöver räkna de bildpunkter som inte har några datavärden i ett annat band än 1, måste du uttryckligen ange bandnumret på följande sätt `ST_Count(rast,2)`.

source: Note how all the rasters have a 150x150 dimension. This is not ideal. This means that in order to force that, our rasters, are squished in all sorts of ways. If only we could see the ugliness of the rasters before us.
es: Observa cómo todos los raster tienen una dimensión de 150x150. Esto no es ideal. Esto significa que para forzarlo, nuestros raster están deformados de diversas formas. Si tan solo pudiéramos ver lo feo de los raster frente a nosotros.
sv: Observera att alla raster har en dimension på 150x150. Detta är inte idealiskt. Det innebär att våra raster, för att tvinga fram det, är klämda på alla möjliga sätt. Om vi bara kunde se hur fula rastren är framför oss.

source: Loading Rasters using raster2pgsql
es: Cargando raster usando raster2pgsql
sv: Läs in raster med hjälp av raster2pgsql

source: `raster2pgsql <https://postgis.net/docs/using_raster_dataman.html#RT_Raster_Loader>`_ is a command-line tool often packaged with PostGIS. If you are on windows and used application stackbuilder PostGIS Bundle, you'll find :command:`raster2pgsql.exe` in the folder ``C:\Program Files\PostgreSQL\15\bin`` where the *15* should be replaced with the version of PostgreSQL you are running.
es: `raster2pgsql <https://postgis.net/docs/using_raster_dataman.html#RT_Raster_Loader>`_ es una herramienta de línea de comandos que a menudo viene incluida con PostGIS. Si estás en Windows y usaste el instalador PostGIS Bundle con stackbuilder, encontrarás :command:`raster2pgsql.exe` en la carpeta ``C:\Program Files\PostgreSQL\15\bin`` donde el *15* debe ser reemplazado con la versión de PostgreSQL que estés usando.
sv: `raster2pgsql <https://postgis.net/docs/using_raster_dataman.html#RT_Raster_Loader>`_ är ett kommandoradsverktyg som ofta paketeras med PostGIS. Om du är på Windows och använde applikationsstackbuilder PostGIS Bundle, hittar du :command:`raster2pgsql.exe` i mappen ``C: \ Program Files \ PostgreSQL \ 15 \ bin`` där *15* ska ersättas med den version av PostgreSQL du kör.

source: If you are using Postgres.App, you'll find raster2pgsql among the other `Postgres.app CLI Tools <https://postgresapp.com/documentation/cli-tools.html>`_.
es: Si estás usando Postgres.App, encontrarás raster2pgsql entre las otras `Postgres.app CLI Tools <https://postgresapp.com/documentation/cli-tools.html>`_.
sv: Om du använder Postgres.app hittar du raster2pgsql bland de andra `Postgres.app CLI Tools <https://postgresapp.com/documentation/cli-tools.html>`_.

source: On Ubuntu and Debian, you will need
es: En Ubuntu y Debian, necesitarás
sv: På Ubuntu och Debian behöver du

source: to have the PostGIS commandline tools installed. This may install an additional version of PostgreSQL as well. You can see a list of clusters in Debian/Ubuntu using the :command:`pg_lsclusters` command and drop them using the :command:`pg_dropcluster` command.
es: tener instaladas las herramientas de línea de comandos de PostGIS. Esto también puede instalar una versión adicional de PostgreSQL. Puedes ver una lista de clusters en Debian/Ubuntu usando el comando :command:`pg_lsclusters` y eliminarlos usando el comando :command:`pg_dropcluster`.
sv: för att ha PostGIS kommandoradsverktyg installerade. Detta kan också installera en ytterligare version av PostgreSQL. Du kan se en lista över kluster i Debian/Ubuntu med hjälp av kommandot :command:`pg_lsclusters` och ta bort dem med kommandot :command:`pg_dropcluster`.

source: For this and later exercises, we'll be using `nyc_dem.tif` found in the file `PG Raster Workshop Dataset https://postgis.net/stuff/workshop-data/postgis_raster_workshop.zip <https://postgis.net/stuff/workshop-data/postgis_raster_workshop.zip>`_. For some geometry/raster examples, we will also be using NYC data loaded from prior chapters. In-lieu of loading the tif, you can restore the `nyc_dem.backup` included in the zip file in your database using the :command:`pg_restore` commandline tool or the pgAdmin **Restore** menu.
es: Para este y los siguientes ejercicios, usaremos `nyc_dem.tif` que se encuentra en el archivo `PG Raster Workshop Dataset https://postgis.net/stuff/workshop-data/postgis_raster_workshop.zip <https://postgis.net/stuff/workshop-data/postgis_raster_workshop.zip>`_. Para algunos ejemplos de geometría/raster, también usaremos datos de NYC cargados de capítulos anteriores. En lugar de cargar el tif, puedes restaurar el `nyc_dem.backup` incluido en el archivo zip en tu base de datos usando la herramienta de línea de comandos :command:`pg_restore` o el menú **Restore** de pgAdmin.
sv: För denna och senare övningar kommer vi att använda `nyc_dem.tif` som finns i filen `PG Raster Workshop Dataset https://postgis.net/stuff/workshop-data/postgis_raster_workshop.zip <https://postgis.net/stuff/workshop-data/postgis_raster_workshop.zip>`_. För vissa geometri/rasterexempel kommer vi också att använda NYC-data som laddats från tidigare kapitel. I stället för att ladda tif-filen kan du återställa `nyc_dem.backup` som ingår i zip-filen i din databas med hjälp av kommandoradsverktyget :command:`pg_restore` eller menyn pgAdmin **Restore**.

source: This raster data was sourced from `NYC DEM 1-foot Integer <https://data.cityofnewyork.us/City-Government/1-foot-Digital-Elevation-Model-DEM-/dpc8-z3jc>`_ which is a 3GB DEM tif representing elevation relative to sea level with buildings and overwater removed. We then created a lower res version of it.
es: Estos datos raster provienen de `NYC DEM 1-foot Integer <https://data.cityofnewyork.us/City-Government/1-foot-Digital-Elevation-Model-DEM-/dpc8-z3jc>`_ que es un tif DEM de 3GB que representa elevación relativa al nivel del mar con edificios y superficies de agua eliminados. Luego creamos una versión de menor resolución de este.
sv: Denna rasterdata hämtades från `NYC DEM 1-foot Integer <https://data.cityofnewyork.us/City-Government/1-foot-Digital-Elevation-Model-DEM-/dpc8-z3jc>`_ som är en 3GB DEM tif som representerar höjd i förhållande till havsnivån med byggnader och övervatten borttagna. Vi skapade sedan en lägre res-version av den.

source: The :command:`raster2pgsql` tool is similar to the :command:`shp2gpsql` except instead of loading ESRI shapefiles into PostGIS geometry/geography tables, it loads any GDAL supported raster format into raster tables. Just like :command:`shp2pgsql` you can pass it a spatial reference id (SRID) of the source. Unlike :command:`shp2pgsql` it can infer the spatial references system of the source data if your source data has suitable metadata.
es: La herramienta :command:`raster2pgsql` es similar a :command:`shp2gpsql` excepto que en lugar de cargar archivos shapefiles de ESRI en tablas de geometría/geografía de PostGIS, carga cualquier formato raster soportado por GDAL en tablas raster. Al igual que :command:`shp2pgsql` puedes pasarle un identificador de referencia espacial (SRID) de la fuente. A diferencia de :command:`shp2pgsql` puede inferir el sistema de referencia espacial de los datos de origen si tus datos contienen metadatos adecuados.
sv: Verktyget :command:`raster2pgsql` liknar :command:`shp2gpsql` förutom att istället för att ladda ESRI shapefiler till PostGIS geometri/geografitabeller, laddar det alla GDAL-stödda rasterformat till rastertabeller. Precis som i :command:`shp2pgsql` kan du skicka ett SRID (spatial reference id) för källan. Till skillnad från :command:`shp2pgsql` kan den härleda källdatans spatiala referenssystem om källdata har lämpliga metadata.

source: For a full exposure of all the possible switches offered refer to `raster2pgsql options <https://postgis.net/docs/using_raster_dataman.html#RT_Loading_Rasters>`_.
es: Para ver todas las posibles opciones ofrecidas consulta `raster2pgsql options <https://postgis.net/docs/using_raster_dataman.html#RT_Loading_Rasters>`_.
sv: För en fullständig beskrivning av alla möjliga alternativ, se `raster2pgsql options <https://postgis.net/docs/using_raster_dataman.html#RT_Loading_Rasters>`_.

source: Some other notable options :command:`raster2pgsql` offers which we will not cover are:
es: Algunas otras opciones notables que ofrece :command:`raster2pgsql` que no cubriremos son:
sv: Några andra anmärkningsvärda alternativ som :command:`raster2pgsql` erbjuder som vi inte kommer att täcka är:

source: Ability to denote the SRID of the source. Instead, we'll rely on raster2pgsql guessing skills.
es: Capacidad para indicar el SRID de la fuente. En su lugar, confiaremos en la capacidad de raster2pgsql para adivinar.
sv: Möjlighet att ange källans SRID. Istället förlitar vi oss på raster2pgsql gissningsförmåga.

source: Ability to set the `nodata` value, when not specified, raster2pgsql tries to infer from the file.
es: Capacidad para establecer el valor `nodata`, cuando no se especifica, raster2pgsql intenta inferirlo del archivo.
sv: Möjlighet att ställa in värdet `nodata`, om det inte anges försöker raster2pgsql härleda från filen.

source: Abiliity to load out-of-database rasters.
es: Capacidad para cargar rasters fuera de la base de datos.
sv: Möjlighet att ladda raster utanför databasen.

source: To load all the tif files in our folder and also create overviews, we would run the below.
es: Para cargar todos los archivos tif en nuestra carpeta y también crear vistas generales (overviews), ejecutaríamos lo siguiente.
sv: För att ladda alla tif-filer i vår mapp och även skapa översikter, skulle vi köra nedanstående.

source: -d to drop the tables if they already exist
es: -d para eliminar las tablas si ya existen
sv: -d för att ta bort tabellerna om de redan finns

source: The above command uses `-e` to do load immediately instead of committing in a transaction
es: El comando anterior usa `-e` para cargar inmediatamente en lugar de confirmar en una transacción
sv: Ovanstående kommando använder `-e` för att ladda omedelbart istället för att binda i en transaktion

source: `-C` set raster constraints, this is useful for `raster_columns` to show info. You may want to combine with `-x` to exclude the extent constraint, which is a slow constraint to check and also hampers future loads in the table.
es: `-C` establece restricciones raster, esto es útil para que `raster_columns` muestre información. Puedes querer combinarlo con `-x` para excluir la restricción de extensión, que es una restricción lenta de verificar y también dificulta futuras cargas en la tabla.
sv: `-C` ställer in rasterbegränsningar, detta är användbart för `raster_columns` för att visa information. Du kanske vill kombinera med `-x` för att utesluta extent-begränsningen, som är en långsam begränsning att kontrollera och som också hindrar framtida belastningar i tabellen.

source: `-M` to vacuum and analyze after load, to improve query planner statistics
es: `-M` para hacer vacuum y analyze después de cargar, para mejorar las estadísticas del planificador de consultas
sv: `-M` för att dammsuga och analysera efter laddning, för att förbättra statistiken i frågeplaneraren

source: `-Y` to use copy in batches of 50. If you are running PostGIS 3.3 or higher, you can use `-Y 1000` to have copy be in batches of 1000, or even higher number. This will run faster, but will use more memory.
es: `-Y` para usar copy en lotes de 50. Si estás ejecutando PostGIS 3.3 o superior, puedes usar `-Y 1000` para que copy se haga en lotes de 1000, o incluso un número mayor. Esto será más rápido, pero usará más memoria.
sv: `-Y` för att använda kopiering i omgångar om 50. Om du kör PostGIS 3.3 eller senare kan du använda `-Y 1000` för att kopiera i satser om 1000, eller ännu högre antal. Detta går snabbare, men använder mer minne.

source: `-l 2,3` to create over view tables: `o_2_ncy_dem` and `o_3_nyc_dem`. This is useful for viewing data.
es: `-l 2,3` para crear tablas de vista general: `o_2_ncy_dem` y `o_3_nyc_dem`. Esto es útil para visualizar datos.
sv: `-l 2,3` för att skapa överskådliga tabeller: `o_2_ncy_dem` och `o_3_nyc_dem`. Detta är användbart för visning av data.

source: -I to create a spatial index
es: -I para crear un índice espacial
sv: -I för att skapa ett spatialt index
