Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/rasters.po
Languages: es, sv

source: In order to create a new nyc dem dataset in NY State Plane meters, we'll do the following:
es: Para crear un nuevo conjunto de datos nyc dem en NY State Plane metros, haremos lo siguiente:
sv: För att skapa en ny nyc dem-datauppsättning i NY State Plane-mätare gör vi följande:

source: The above on my system took about 1.5 minutes. For a larger data set it would take much longer.
es: Lo anterior en mi sistema tardó alrededor de 1.5 minutos. Para un conjunto de datos más grande tardaría mucho más.
sv: Ovanstående på mitt system tog cirka 1,5 minuter. För en större datamängd skulle det ta mycket längre tid.

source: The aforementioned examples used two variants of the :command:`ST_Transform` raster function. The first was to get a reference raster that will be used to transform the other raster tiles to guarantee that all tiles have the same alignment. Note the second variant of :command:`ST_Transform` used doesn't even take an input SRID. This is because the SRID and all the pixel scale and block sizes are read from the reference raster. If you used `ST_Transform(rast, srid)` form, then all your rasters might come out with different alignment making it impossible to apply an operation such as :command:`ST_Union` on them.
es: Los ejemplos mencionados usaron dos variantes de la función raster :command:`ST_Transform`. La primera fue para obtener un raster de referencia que se usará para transformar los otros tiles raster para garantizar que todos los tiles tengan el mismo alineamiento. Observa que la segunda variante de :command:`ST_Transform` utilizada ni siquiera toma un SRID de entrada. Esto se debe a que el SRID y toda la escala de píxeles y tamaños de bloque se leen del raster de referencia. Si usaras la forma `ST_Transform(rast, srid)`, entonces todos tus raster podrían salir con diferentes alineamientos, haciendo imposible aplicar una operación como :command:`ST_Union` sobre ellos.
sv: I de tidigare nämnda exemplen användes två varianter av rasterfunktionen :command:`ST_Transform`. Den första var att få ett referensraster som kommer att användas för att omvandla de andra rasterplattorna för att garantera att alla plattor har samma inriktning. Observera att den andra varianten av :command:`ST_Transform` som används inte ens tar emot en SRID. Detta beror på att SRID och alla pixelskalor och blockstorlekar läses från referensrastret. Om du använde `ST_Transform(rast, srid)`-formuläret, skulle alla dina raster kunna komma ut med olika inriktning vilket gör det omöjligt att tillämpa en operation som :command:`ST_Union` på dem.

source: The only problem with the aforementioned :command:`ST_Transform` approach is that when you transform, the transformed often exists in other tiles. If you looked at the above output closely enough by outputting the convex hull of the rasters, in the next example you'd see annoying overlaps around the borders.
es: El único problema con el enfoque :command:`ST_Transform` mencionado es que cuando transformas, lo transformado a menudo existe en otros tiles. Si miraras la salida anterior con suficiente detalle sacando el convex hull de los raster, en el siguiente ejemplo verías solapamientos molestos alrededor de los bordes.
sv: Det enda problemet med den ovannämnda :command:`ST_Transform`-strategin är att när du transformerar, finns det transformerade ofta i andra rutor. Om du tittade tillräckligt noga på ovanstående utdata genom att mata ut rastrernas konvexa skrov, skulle du i nästa exempel se irriterande överlappningar runt gränserna.

source: viewed in pgAdmin would look something like:
es: visto en pgAdmin se vería algo como:
sv: som visas i pgAdmin skulle se ut ungefär som:

source: Using ST_MakeEmptyCoverage to create even tiled rasters
es: Usando ST_MakeEmptyCoverage para crear raster con tiles uniformes
sv: Använda ST_MakeEmptyCoverage för att skapa jämnt uppdelade raster

source: A better approach, albeit a bit slower, is to define your own coverage tile structure from scratch using `ST_MakeEmptyCoverage <https://postgis.net/docs/RT_ST_MakeEmptyCoverage.html>`_ and then find the intersecting tiles for each new tile, and ST_Union these and then use `ST_Transform(ref, ST_Union...)` to create each tile.
es: Un mejor enfoque, aunque un poco más lento, es definir tu propia estructura de tiles de cobertura desde cero usando `ST_MakeEmptyCoverage <https://postgis.net/docs/RT_ST_MakeEmptyCoverage.html>`_ y luego encontrar los tiles que se intersectan para cada nuevo tile, y hacer ST_Union de estos y luego usar `ST_Transform(ref, ST_Union...)` para crear cada tile.
sv: Ett bättre tillvägagångssätt, om än lite långsammare, är att definiera din egen täckningsstruktur från början med `ST_MakeEmptyCoverage <https://postgis.net/docs/RT_ST_MakeEmptyCoverage.html>`_ och sedan hitta de korsande plattorna för varje ny platta, och ST_Union dessa och sedan använda `ST_Transform(ref, ST_Union...)` för att skapa varje platta.

source: For this we'll be using quite a few functions, we learned about earlier.
es: Para esto estaremos usando varias funciones que aprendimos anteriormente.
sv: För detta kommer vi att använda en hel del funktioner, som vi lärt oss om tidigare.

source: Repeating the same exercise as earlier:
es: Repitiendo el ejercicio:
sv: Upprepa samma övning som tidigare:

source: viewed in pgAdmin we no longer have overlaps:
es: visto en pgAdmin ya no tenemos solapamientos:
sv: sett i pgAdmin har vi inte längre överlappningar:

source: On my system this took ~10 minutes and returned 3879 rows. After the creation of the table, we'll want to do the usual of adding a spatial index, primary key, and constraints as follows:
es: En mi sistema esto tomó ~10 minutos y devolvió 3879 filas. Después de la creación de la tabla, querrás hacer lo habitual de añadir un índice espacial, clave primaria y restricciones como sigue:
sv: På mitt system tog detta ~ 10 minuter och returnerade 3879 rader. Efter att tabellen har skapats vill vi göra det vanliga med att lägga till ett spatialt index, primärnyckel och begränsningar enligt följande:

source: Which should take under 2 minutes for this dataset.
es: Lo cual debería tomar menos de 2 minutos para este conjunto de datos.
sv: Vilket bör ta mindre än 2 minuter för detta dataset.

source: Creating overview tables with ST_CreateOverview
es: Creando tablas de overview con ST_CreateOverview
sv: Skapa översiktstabeller med ST_CreateOverview

source: Just as with our original dataset, it would be useful to have overview tables to speed up performance of some operations. `ST_CreateOverview <https://postgis.net/docs/RT_CreateOverview.html>`_ is a function fit for that purpose. You can use :command:`ST_CreateOverview` to create overviews also if you neglected to create one during the raster2pgsql load or you decided, you need more overviews.
es: Al igual que con nuestro conjunto de datos original, sería útil tener tablas de overview para acelerar el rendimiento de algunas operaciones. `ST_CreateOverview <https://postgis.net/docs/RT_CreateOverview.html>`_ es una función adecuada para ese propósito. Puedes usar :command:`ST_CreateOverview` para crear overviews también si olvidaste crear una durante la carga con raster2pgsql o decidiste que necesitas más overviews.
sv: Precis som med vårt ursprungliga dataset skulle det vara användbart att ha översiktstabeller för att påskynda vissa operationer. `ST_CreateOverview <https://postgis.net/docs/RT_CreateOverview.html>`_ är en funktion som passar för det ändamålet. Du kan använda :command:`ST_CreateOverview` för att skapa översikter även om du har glömt att skapa en under raster2pgsql-laddningen eller om du har bestämt dig för att du behöver fler översikter.

source: We'll create level 2 and 3 overviews as we had done with our original using this code.
es: Crearemos overviews de nivel 2 y 3 como habíamos hecho con nuestro original usando este código.
sv: Vi skapar översikter på nivå 2 och 3 som vi gjorde med vårt original med hjälp av den här koden.

source: This process sadly takes a while, and a longer while the more rows you have so be patient. For this dataset it took about 3-5 minutes for the overview factor `2` and 1 minute for the overview factor `3`.
es: Este proceso desafortunadamente toma tiempo, y más tiempo cuanto más filas tengas, así que sé paciente. Para este conjunto de datos tomó alrededor de 3-5 minutos para el overview factor `2` y 1 minuto para el overview factor `3`.
sv: Denna process tar tyvärr en stund, och en längre stund ju fler rader du har så ha tålamod. För det här datasetet tog det cirka 3-5 minuter för översiktsfaktor 2 och 1 minut för översiktsfaktor 3.

source: The :command:`ST_CreateOverView` function also adds in the needed constraints so the columns appear with full detail in the `raster_columns` and `raster_overviews` catalogs. It does not add indexes to them though and also does not add an rid column. The rid column is probably not necessary unless you need a primary key to edit with. You would probably want an index which you can create with the following:
es: La función :command:`ST_CreateOverview` también añade las restricciones necesarias para que las columnas aparezcan con todo detalle en los catálogos `raster_columns` y `raster_overviews`. Sin embargo, no añade índices ni tampoco una columna rid. La columna rid probablemente no es necesaria a menos que necesites una clave primaria para editar. Probablemente quieras un índice que puedes crear con lo siguiente:
sv: Funktionen :command:`ST_CreateOverView` lägger också till de nödvändiga begränsningarna så att kolumnerna visas med full detaljrikedom i katalogerna `raster_columns` och `raster_overviews`. Den lägger dock inte till index för dem och lägger inte heller till en rid-kolumn. Rid-kolumnen är förmodligen inte nödvändig om du inte behöver en primärnyckel för att redigera med. Du skulle förmodligen vilja ha ett index som du kan skapa med följande:

source: ST_CreateOverview has an optional argument for denoting the sampling method. If not specified it uses the default `NearestNeighbor` which is generally the fastest to compute but may not be ideal. Resampling methods is beyond the scope of this workshop.
es: ST_CreateOverview tiene un argumento opcional para indicar el método de muestreo. Si no se especifica, usa el valor por defecto `NearestNeighbor` que generalmente es el más rápido de calcular pero puede no ser el ideal. Los métodos de remuestreo están fuera del alcance de este taller.
sv: ST_CreateOverview har ett valfritt argument för att ange urvalsmetoden. Om inget anges används standardmetoden "NearestNeighbor", som i allmänhet är snabbast att beräkna men som kanske inte är idealisk. Att ändra samplingsmetoder ligger utanför ramen för denna workshop.

source: The intersection of rasters and geometries
es: La intersección de rasters y geometrías
sv: Skärningspunkten mellan raster och geometrier

source: There are a couple of functions commonly used to compute intersections of rasters and geometries. We've already seen :command:`ST_Clip` in action which returns the intersection of a raster and geometry as a raster, but there are others. For point data, the most commonly used is :command:`ST_Value` and then there is the :command:`ST_Intersection` which has several overloads some returning rasters and some returning a set of `geomval`.
es: Hay un par de funciones comúnmente usadas para calcular intersecciones de rasters y geometrías. Ya hemos visto :command:`ST_Clip` en acción que devuelve la intersección de un raster y una geometría como un raster, pero hay otras. Para datos puntuales, la más comúnmente usada es :command:`ST_Value` y luego está :command:`ST_Intersection` que tiene varias sobrecargas, algunas devolviendo rasters y otras devolviendo un conjunto de `geomval`.
sv: Det finns ett par funktioner som ofta används för att beräkna korsningspunkter mellan raster och geometrier. Vi har redan sett :command:`ST_Clip` i aktion, som returnerar korsningspunkten mellan ett raster och en geometri som ett raster, men det finns fler. För punktdata är det vanligaste :command:`ST_Value` och sedan finns :command:`ST_Intersection` som har flera överbelastningar, vissa returnerar raster och andra returnerar en uppsättning `geomval`.

source: Pixel values at a geometric Point
es: Valores de píxel en un Punto geométrico
sv: Pixelvärden vid en geometrisk punkt

source: If you need to return values from rasters based on intersection of several ad-hoc geometry points, you'll use `ST_Value <https://postgis.net/docs/RT_ST_Value.html>`_ or it's nearest relative `ST_NearestValue <https://postgis.net/docs/RT_ST_NearestValue.html>`_.
es: Si necesitas devolver valores de raster basados en la intersección de varios puntos geométricos ad-hoc, usarás `ST_Value <https://postgis.net/docs/RT_ST_Value.html>`_ o su pariente cercano `ST_NearestValue <https://postgis.net/docs/RT_ST_NearestValue.html>`_.
sv: Om du behöver returnera värden från raster baserat på korsningspunkten mellan flera ad hoc-geometripunkter använder du `ST_Value <https://postgis.net/docs/RT_ST_Value.html>`_ eller dess närmaste släkting `ST_NearestValue <https://postgis.net/docs/RT_ST_NearestValue.html>`_.

source: This example takes about 1 second to return 2444 rows. If you used :command:`ST_Intersects` instead of :command:`&&`, the process would take about 3 seconds. The reason `ST_Intersects` is slower is that it performs an additional recheck in some cases a pixel by pixel check. If you expect all your points to be represented with data in your raster set and your rasters represent a coverage (a continguous set non-overlapping raster tiles), then `&&` is generally a speedier option.
es: Este ejemplo tarda alrededor de 1 segundo en devolver 2444 filas. Si usaras :command:`ST_Intersects` en lugar de :command:`&&`, el proceso tomaría alrededor de 3 segundos. La razón por la que `ST_Intersects` es más lento es porque realiza una verificación adicional en algunos casos, una verificación píxel por píxel. Si esperas que todos tus puntos estén representados con datos en tu conjunto raster y tus raster representan una cobertura (un conjunto contiguo de tiles raster no superpuestos), entonces `&&` es generalmente una opción más rápida.
sv: Det här exemplet tar cirka 1 sekund att returnera 2444 rader. Om du använde :command:`ST_Intersects` i stället för :command:`&&` skulle processen ta cirka 3 sekunder. Anledningen till att `ST_Intersects` är långsammare är att den utför ytterligare en kontroll, i vissa fall en kontroll pixel för pixel. Om du förväntar dig att alla dina punkter ska representeras med data i din rasteruppsättning och dina raster representerar en täckning (en kontinuerlig uppsättning icke-överlappande rasterplattor), är `&&` i allmänhet ett snabbare alternativ.

source: If your raster data is not densely populated or you have overlapping rasters (e.g. they represent different observations in time), or they are skewed (not axis aligned) then there is an advantage to having ST_Intersects weed out the false positives.
es: Si tus datos raster no están densamente poblados o tienes rasters superpuestos (por ejemplo, representan diferentes observaciones en el tiempo), o están inclinados (no alineados a los ejes), entonces hay una ventaja en que ST_Intersects elimine los falsos positivos.
sv: Om dina rasterdata inte är tätbefolkade eller om du har överlappande raster (t.ex. de representerar olika observationer i tid), eller om de är skeva (inte axeljusterade), finns det en fördel med att ST_Intersects rensar ut de falska positiva.

source: ST_Intersection raster style
es: Estilo raster de ST_Intersection
sv: ST_Intersection rasterstil

source: Just as you can compute the intersection of two geometries using :command:`ST_Intersection`, you can compute intersection of two rasters or a raster and a geometry using `raster ST_Intersection <https://postgis.net/docs/RT_ST_Intersection.html>`_.
es: Así como puedes calcular la intersección de dos geometrías usando :command:`ST_Intersection`, puedes calcular la intersección de dos raster o un raster y una geometría usando `raster ST_Intersection <https://postgis.net/docs/RT_ST_Intersection.html>`_.
sv: Precis som du kan beräkna korsningspunkten mellan två geometrier med hjälp av :command:`ST_Intersection`, kan du beräkna korsningspunkten mellan två raster eller ett raster och en geometri med hjälp av `raster ST_Intersection <https://postgis.net/docs/RT_ST_Intersection.html>`_.

source: What you get out of this beast, are two different kinds of things:
es: Lo que obtienes de esta función son dos tipos diferentes de cosas:
sv: Vad du får ut av det här odjuret är två olika sorters saker:

source: Intersect a geometry with a raster, and you get a set of `geomval` offspring. Perhaps one, but most often many.
es: Intersecta una geometría con un raster, y obtienes un conjunto de descendientes `geomval`. Quizás uno, pero la mayoría de las veces muchos.
sv: Skär en geometri med ett raster och du får en uppsättning `geomval`-avkommor. Kanske en, men oftast många.

source: Intersect 2 rasters and you get a single `raster` back.
es: Intersecta 2 rasters y obtienes un único `raster` de vuelta.
sv: Korsa 2 raster och du får ett enda "raster" tillbaka.

source: The golden rule for both raster intersection and geometry intersection is that both parties involved must have the same spatial reference system. For raster/raster, they also have to have same alignment.
es: La regla de oro tanto para la intersección raster como para la intersección de geometrías es que ambas partes involucradas deben tener el mismo sistema de referencia espacial. Para raster/raster, también deben tener el mismo alineamiento.
sv: Den gyllene regeln för både rasterkorsning och geometrikorsning är att båda parter måste ha samma spatiala referenssystem. För raster/raster måste de också ha samma inriktning.

source: Here is an example which answers a question you may have been curious about. If we bucket our elevations into 5 buckets of elevation values, which elevation range results in the most gun fatalities? We know based on our earlier summary statistics that `0` is the lowest value and `411` is the highest value for elevation in our nyc dem dataset, so we use that as min and max value for our `width_bucket <https://www.postgresql.org/docs/current/functions-math.html>`_ call.
es: Aquí hay un ejemplo que responde a una pregunta que podrías haber tenido curiosidad. Si agrupamos nuestras elevaciones en 5 intervalos de valores de elevación, ¿qué rango de elevación resulta en la mayor cantidad de muertes por arma de fuego? Sabemos, basándonos en nuestras estadísticas resumidas anteriores, que `0` es el valor más bajo y `411` es el valor más alto de elevación en nuestro conjunto de datos nyc dem, así que usamos eso como valor mínimo y máximo para nuestra llamada a `width_bucket <https://www.postgresql.org/docs/current/functions-math.html>`_.
sv: Här är ett exempel som svarar på en fråga som du kanske har varit nyfiken på. Om vi skopar våra höjder i 5 hinkar med höjdvärden, vilket höjdintervall resulterar i flest dödsfall i vapen? Vi vet baserat på vår tidigare sammanfattande statistik att `0` är det lägsta värdet och `411` är det högsta värdet för höjd i vår nyc dem dataset, så vi använder det som min och max värde för vår `width_bucket <https://www.postgresql.org/docs/current/functions-math.html>`_ samtal.

source: Is there an important correlation between gun homicides and elevation? Probably not.
es: ¿Existe una correlación importante entre homicidios con armas de fuego y elevación? Probablemente no.
sv: Finns det ett viktigt samband mellan mord med skjutvapen och höjd över havet? Förmodligen inte.

source: Let's take a look at raster / raster intersection:
es: Veamos la intersección raster/raster:
sv: Låt oss ta en titt på raster / raster-korsning:

source: What we get are two rows with NULLLs, and if you have your PostgreSQL set to show notices, you'll see:
es: Lo que obtenemos son dos filas con NULLs, y si tienes PostgreSQL configurado para mostrar avisos, verás:
sv: Vad vi får är två rader med NULLLs, och om du har din PostgreSQL inställd på att visa meddelanden ser du det:

source: **NOTICE: The two rasters provided do not have the same alignment. Returning NULL**
sv: **OBS: De två rastrerna som tillhandahålls har inte samma inriktning. Återlämnar NULL**

source: In order to fix this, we can align one to the other as it's coming out of the gate using `ST_Resample <https://postgis.net/docs/RT_ST_Resample.html>`_.
es: Para solucionar esto, podemos alinear uno con el otro en el momento de la salida usando `ST_Resample <https://postgis.net/docs/RT_ST_Resample.html>`_.
sv: För att åtgärda detta kan vi anpassa den ena till den andra när den kommer ut ur porten med hjälp av `ST_Resample <https://postgis.net/docs/RT_ST_Resample.html>`_.

source: Let's also roll it up into a single stats record
es: Vamos también a resumirlo en un único registro estadístico
sv: Låt oss också sammanställa det till en enda statistikpost

source: which outputs:
es: lo cual produce:
sv: som matar ut:

source: Map Algebra Functions
es: Funciones de álgebra de mapas
sv: Kartlägga algebrafunktioner

source: Map algebra is the idea that you can do math on your pixel values. The :command:`ST_Union` and :command:`ST_Intersection` functions covered earlier are a special fast case of map algebra. Then there are the `ST_MapAlgebra <https://postgis.net/docs/RT_ST_MapAlgebra.html>`_ family of functions which allow you to define your own crazy math, but at cost of performance.
es: El álgebra de mapas es la idea de que puedes hacer matemáticas sobre tus valores de píxeles. Las funciones :command:`ST_Union` y :command:`ST_Intersection` cubiertas anteriormente son un caso especial rápido de álgebra de mapas. Luego está la familia de funciones `ST_MapAlgebra <https://postgis.net/docs/RT_ST_MapAlgebra.html>`_ que te permiten definir tus propias matemáticas locas, pero a costa del rendimiento.
sv: Map algebra är tanken att man kan göra matematik på sina pixelvärden. Funktionerna :command:`ST_Union` och :command:`ST_Intersection` som nämndes tidigare är ett snabbt specialfall av kartalgebra. Sedan finns det `ST_MapAlgebra <https://postgis.net/docs/RT_ST_MapAlgebra.html>`_ familjen av funktioner som gör att du kan definiera din egen galna matematik, men på bekostnad av prestanda.

source: People have the habit of jumping to :command:`ST_MapAlgebra`, probably because the name sounds so cool and sophisticated. Who wouldn't want to tell their friends? *I'm using a function called ST_MapAlgebra.* My advice, explore other functions before you pull out that shotgun. Your life will be simpler and your performance will be 100 times better, and your code will be shorter.
es: La gente tiene la costumbre de saltar a :command:`ST_MapAlgebra`, probablemente porque el nombre suena tan genial y sofisticado. ¿Quién no querría decirle a sus amigos? *Estoy usando una función llamada ST_MapAlgebra.* Mi consejo: explora otras funciones antes de sacar esa escopeta. Tu vida será más simple, tu rendimiento será 100 veces mejor y tu código será más corto.
sv: Folk har för vana att hoppa till :command:`ST_MapAlgebra`, förmodligen för att namnet låter så coolt och sofistikerat. Vem skulle inte vilja berätta det för sina vänner? *Jag använder en funktion som heter ST_MapAlgebra* Mitt råd är att utforska andra funktioner innan du drar fram hagelgeväret. Ditt liv kommer att bli enklare och din prestanda kommer att bli 100 gånger bättre, och din kod kommer att bli kortare.
