Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/rasters.po
Languages: es, sv

source: This function is also special in that it utilizes the power of geometry to help raster analysis. To reduce the number of pixels, :command:`ST_Union` has to handle, each raster is clipped first to the area we are interested in.
es: Esta función es también especial en que utiliza el poder de la geometría para ayudar al análisis raster. Para reducir el número de píxeles que :command:`ST_Union` tiene que manejar, cada raster se recorta primero al área de interés.
sv: Den här funktionen är också speciell eftersom den utnyttjar geometrins möjligheter för att underlätta rasteranalys. För att minska antalet bildpunkter som :command:`ST_Union` måste hantera, klipps varje raster först till det område som vi är intresserade av.

source: This example showcases several functions working in unison. The :command:`ST_Intersects` function employed is the one packaged with **postgis_raster** and can intersect 2 rasters or a raster and a geometry. Similar to the geometry :command:`ST_Intersects` the `raster ST_Intersects <https://postgis.net/docs/RT_ST_Intersects.html>`_ can take advantage of spatial indexes on the raster or geometry tables.
es: Este ejemplo muestra varias funciones trabajando en conjunto. La función :command:`ST_Intersects` empleada es la que viene con **postgis_raster** y puede intersectar 2 raster o un raster y una geometría. Similar a la función de geometría :command:`ST_Intersects`, el `raster ST_Intersects <https://postgis.net/docs/RT_ST_Intersects.html>`_ puede aprovechar los índices espaciales en las tablas raster o de geometría.
sv: Detta exempel visar flera funktioner som arbetar tillsammans. Funktionen :command:`ST_Intersects` som används är den som medföljer **postgis_raster** och kan korsa 2 raster eller ett raster och en geometri. I likhet med geometri :command:`ST_Intersects` kan `raster ST_Intersects <https://postgis.net/docs/RT_ST_Intersects.html>`_ dra nytta av spatiala index på raster- eller geometritabellerna.

source: By default ST_Clip will leave out pixels where the centroid of the pixel doesn't intersect the geometry. This can be annoying for big pixels and you may prefer to instead, include a pixel if any part of the pixel touches the geometry. Introduced in PostGIS 3.5, is the touched argument. Replace your `ST_Clip(r.rast, g.geom)` with `ST_Clip(r.rast, g.geom, touched => true)` and voila any pixels that intersect your geometry in any way will be included.
es: De manera predeterminada ST_Clip dejará fuera píxeles donde el centroide del píxel no intersecta la geometría. Esto puede ser molesto para píxeles grandes y puede que prefieras en su lugar incluir un píxel si cualquier parte del píxel toca la geometría. Introducido en PostGIS 3.5, está el argumento touched. Reemplaza tu `ST_Clip(r.rast, g.geom)` con `ST_Clip(r.rast, g.geom, touched => true)` y voilà, cualquier píxel que intersecte tu geometría de cualquier forma será incluido.
sv: Som standard kommer ST_Clip att utelämna bildpunkter där pixelns centroid inte skär geometrin. Detta kan vara irriterande för stora bildpunkter och du kanske föredrar att istället inkludera en pixel om någon del av pixeln vidrör geometrin. Argumentet touched introducerades i PostGIS 3.5. Ersätt din `ST_Clip(r.rast, g.geom)` med `ST_Clip(r.rast, g.geom, touched => true)` och voila alla bildpunkter som skär din geometri på något sätt kommer att inkluderas.

source: Converting Rasters to Geometries
es: Convirtiendo raster en geometrías
sv: Konvertera Raster till Geometrier

source: Rasters can just as easily be morphed into geometries.
es: Los raster pueden convertirse fácilmente en geometrías.
sv: Raster kan lika gärna omvandlas till geometrier.

source: The polygon of a raster with ST_Polygon
es: El polígono de un raster con ST_Polygon
sv: Polygonen i ett raster med ST_Polygon

source: Lets start with our prior example, but convert it to a polygon using `ST_Polygon <https://postgis.net/docs/RT_ST_Polygon.html>`_ function.
es: Comencemos con nuestro ejemplo anterior, pero convirtámoslo en un polígono usando la función `ST_Polygon <https://postgis.net/docs/RT_ST_Polygon.html>`_.
sv: Låt oss börja med vårt tidigare exempel, men konvertera det till en polygon med hjälp av funktionen `ST_Polygon <https://postgis.net/docs/RT_ST_Polygon.html>`_.

source: If you click on the geometry viewer in pgAdmin, you can see this in all it's glory without any hacks.
es: Si haces clic en el visor de geometría en pgAdmin, puedes ver esto en todo su esplendor sin ningún truco.
sv: Om du klickar på geometrivisaren i pgAdmin kan du se detta i all sin prakt utan några hack.

source: :command:`ST_Polygon` considers all the pixels that have values (not no-data) in a particular band, and converts them to geometry. Like many other functions in raster, :command:`ST_Polygon` only considers 1 band. If no band is specified, it will consider only the first band.
es: :command:`ST_Polygon` considera todos los píxeles que tienen valores (no no-data) en una banda particular, y los convierte en geometría. Al igual que muchas otras funciones en raster, :command:`ST_Polygon` solo considera una banda. Si no se especifica ninguna banda, considerará solo la primera banda.
sv: :command:`ST_Polygon` tar hänsyn till alla bildpunkter som har värden (inte inga data) i ett visst band och omvandlar dem till geometri. Liksom många andra funktioner i raster beaktar :command:`ST_Polygon` endast 1 band. Om inget band anges beaktas endast det första bandet.

source: The pixel rectangles of a raster with ST_PixelAsPolygons
es: Los rectángulos de píxel de un raster con ST_PixelAsPolygons
sv: Pixelrektanglarna i ett raster med ST_PixelAsPolygons

source: Another popularly used function is the `ST_PixelAsPolygons <https://postgis.net/docs/RT_ST_PixelAsPolygons.html>`_ function. You should rarely use :command:`ST_PixelAsPolygons` on a large raster without first clipping because you will end up with millions of rows, one for each pixel.
es: Otra función popularmente utilizada es la función `ST_PixelAsPolygons <https://postgis.net/docs/RT_ST_PixelAsPolygons.html>`_. Rara vez deberías usar :command:`ST_PixelAsPolygons` en un raster grande sin antes recortarlo porque terminarás con millones de filas, una por cada píxel.
sv: En annan ofta använd funktion är funktionen `ST_PixelAsPolygons <https://postgis.net/docs/RT_ST_PixelAsPolygons.html>`_. Du bör sällan använda :command:`ST_PixelAsPolygons` på ett stort raster utan att först klippa eftersom du kommer att få miljontals rader, en för varje pixel.

source: :command:`ST_PixelAsPolygons` returns a table consisting of geom, val, x, and y. Where x is the column number, and y is the row number in the raster.
es: :command:`ST_PixelAsPolygons` devuelve una tabla que consiste en geom, val, x y y. Donde x es el número de columna, e y es el número de fila en el raster.
sv: :command:`ST_PixelAsPolygons` returnerar en tabell som består av geom, val, x och y. Där x är kolumnnumret och y är radnumret i rastret.

source: :command:`ST_PixelAsPolygons` similar to other raster functions works on one band at a time and works on band 1 if no band is specified. It also by default returns only pixels that have values.
es: :command:`ST_PixelAsPolygons`, similar a otras funciones raster, trabaja en una banda a la vez y trabaja sobre la banda 1 si no se especifica ninguna banda. También, por defecto, devuelve solo los píxeles que tienen valores.
sv: :command:`ST_PixelAsPolygons` i likhet med andra rasterfunktioner arbetar med ett band i taget och arbetar med band 1 om inget band anges. Den returnerar också som standard endast bildpunkter som har värden.

source: Which outputs:
es: Cuya salida es:
sv: Vilket matar ut:

source: and if we inspect using the geometry viewer, we'd see:
es: y si inspeccionamos usando el visor de geometría, veríamos:
sv: och om vi inspekterar med geometrivisaren, ser vi:

source: If we want all pixels of all our bands, we'd need to do something like below. Note the differences in this example from previous.
es: Si queremos todos los píxeles de todas nuestras bandas, necesitaríamos hacer algo como lo siguiente. Nota las diferencias en este ejemplo con respecto al anterior.
sv: Om vi vill ha alla bildpunkter i alla våra band måste vi göra något liknande nedan. Notera skillnaderna i detta exempel från tidigare.

source: 1. Setting :command:`exclude_nodata_value` to make sure all pixels are returned so that our sets of calls return the same number of rows. The rows out of the function will be naturally in the same order.
es: 1. Configurar :command:`exclude_nodata_value` para asegurarnos de que todos los píxeles sean devueltos de modo que nuestros conjuntos de llamadas devuelvan el mismo número de filas. Las filas de la función estarán naturalmente en el mismo orden.
sv: 1. Ställ in :command:`exclude_nodata_value` för att se till att alla bildpunkter returneras så att våra uppsättningar av anrop returnerar samma antal rader. De rader som kommer ut ur funktionen kommer naturligtvis att vara i samma ordning.

source: 2. Using the `PostgreSQL ROWS FROM constructor <https://www.postgresql.org/docs/current/queries-table-expressions.html#QUERIES-TABLEFUNCTIONS>`_ , and aliasing each set of columns from our function output with names. So for example the band 1 columns (geom, val, x, y) are renamed to g1, v1, x1, x2
es: 2. Usar el `PostgreSQL ROWS FROM constructor <https://www.postgresql.org/docs/current/queries-table-expressions.html#QUERIES-TABLEFUNCTIONS>`_, y asignar alias a cada conjunto de columnas de la salida de nuestra función con nombres. Así, por ejemplo, las columnas de la banda 1 (geom, val, x, y) son renombradas a g1, v1, x1, x2
sv: 2. Använda `PostgreSQL ROWS FROM-konstruktören <https://www.postgresql.org/docs/current/queries-table-expressions.html#QUERIES-TABLEFUNCTIONS>`_ och aliasera varje uppsättning kolumner från vår funktionsutdata med namn. Så till exempel byter band 1-kolumnerna (geom, val, x, y) namn till g1, v1, x1, x2

source: We used CROSS JOIN LATERAL in these examples because we wanted to be explicit what we are doing. Since these are all set returning functions, you can replace CROSS JOIN LATERAL with , for short-hand. We'll use a , in the next set of examples
es: Usamos CROSS JOIN LATERAL en estos ejemplos porque queríamos ser explícitos en lo que estamos haciendo. Como estas son todas funciones que devuelven conjuntos, puedes reemplazar CROSS JOIN LATERAL con , como abreviatura. Usaremos , en el siguiente conjunto de ejemplos
sv: Vi använde CROSS JOIN LATERAL i de här exemplen eftersom vi ville vara tydliga med vad vi gör. Eftersom alla dessa exempel är returnerande funktioner kan du ersätta CROSS JOIN LATERAL med , som en förkortning. Vi kommer att använda ett , i nästa uppsättning exempel

source: Dumping polygons with ST_DumpAsPolygons
es: Guardando polígonos con ST_DumpAsPolygons
sv: Dumpning av polygoner med ST_DumpAsPolygons

source: Raster also introduces an additional composite type called a :command:`geomval`. Consider a :command:`geomval` as the offspring of a geometry and raster. It contains a geometry and it contains a pixel value.
es: Raster también introduce un tipo compuesto adicional llamado :command:`geomval`. Considera un :command:`geomval` como la descendencia de una geometría y un raster. Contiene una geometría y contiene un valor de píxel.
sv: Raster introducerar också en ytterligare sammansatt typ som kallas :command:`geomval`. Tänk på en :command:`geomval` som en avkomma till en geometri och en raster. Den innehåller en geometri och den innehåller ett pixelvärde.

source: You will find several raster functions that return geomvals.
es: Encontrarás varias funciones raster que devuelven geomvals.
sv: Du kommer att hitta flera rasterfunktioner som returnerar geomval.

source: A commonly used function that outputs geomvals is `ST_DumpAsPolygons <https://postgis.net/docs/RT_ST_DumpAsPolygons.html>`_, which returns a set of contiguous pixels with the same value as a polygon. Again this by default will only check band 1 and exclude no data values unless you override. This example selects only polygons from band 2. You can also apply filters to the values. For most use cases, :command:`ST_DumpAsPolygons` is a better option than :command:`ST_PixelAsPolygons` as it will return far fewer rows.
es: Una función comúnmente usada que produce geomvals es `ST_DumpAsPolygons <https://postgis.net/docs/RT_ST_DumpAsPolygons.html>`_, que devuelve un conjunto de píxeles contiguos con el mismo valor como un polígono. Nuevamente, por defecto, solo revisará la banda 1 y excluirá los valores no-data a menos que los sobrescribas. Este ejemplo selecciona solo polígonos de la banda 2. También puedes aplicar filtros a los valores. Para la mayoría de los casos de uso, :command:`ST_DumpAsPolygons` es una mejor opción que :command:`ST_PixelAsPolygons`, ya que devolverá muchas menos filas.
sv: En vanligt förekommande funktion som ger ut geomval är `ST_DumpAsPolygons <https://postgis.net/docs/RT_ST_DumpAsPolygons.html>`_, som returnerar en uppsättning sammanhängande bildpunkter med samma värde som en polygon. Återigen kommer detta som standard endast att kontrollera band 1 och utesluta inga datavärden om du inte åsidosätter. I det här exemplet väljs endast polygoner från band 2. Du kan också tillämpa filter på värdena. För de flesta användningsfall är :command:`ST_DumpAsPolygons` ett bättre alternativ än :command:`ST_PixelAsPolygons` eftersom det kommer att returnera mycket färre rader.

source: This will output 6 rows, and return polygons corresponding to the letters in "Raster".
es: Esto producirá 6 filas, y devolverá polígonos correspondientes a las letras en "Raster".
sv: Detta ger 6 rader och returnerar polygoner som motsvarar bokstäverna i "Raster".

source: Note that it doesn't return a single geometry, because it finds continguous set of pixels with the same value that form a polygon. Even though all these values are the same, they are not continguous.
es: Observa que no devuelve una geometría única, porque encuentra conjuntos contiguos de píxeles con el mismo valor que forman un polígono. Aunque todos estos valores son iguales, no son contiguos.
sv: Observera att den inte returnerar en enda geometri, eftersom den hittar en kontinuerlig uppsättning bildpunkter med samma värde som bildar en polygon. Även om alla dessa värden är desamma är de inte kontinuerliga.

source: A common approach to produce more complex geometries is to group by the values and union.
es: Un enfoque común para producir geometrías más complejas es agrupar por los valores y unir.
sv: Ett vanligt tillvägagångssätt för att producera mer komplexa geometrier är att gruppera efter värdena och slå ihop dem.

source: This will give you 2 rows back corresponding to the words "Raster" and "Hello".
es: Esto te devolverá 2 filas correspondientes a las palabras "Raster" y "Hello".
sv: Detta ger dig 2 rader tillbaka som motsvarar orden "Raster" och "Hello".

source: Statistics
es: Estadísticas
sv: Statistik

source: The most important thing to understand about rasters is that they are statistical tools for storing data in arrays, that you may happen to be able to make look pretty on a screen.
es: Lo más importante que debes entender sobre los raster es que son herramientas estadísticas para almacenar datos en matrices, que puede que logres hacer ver bonitos en una pantalla.
sv: Det viktigaste att förstå om raster är att de är statistiska verktyg för att lagra data i matriser, som du kanske råkar kunna få att se snygga ut på en skärm.

source: You can find a menu of these statistical functions in `Raster Band Statistics <https://postgis.net/docs/RT_reference.html#RasterBand_Stats>`_.
es: Puedes encontrar un menú de estas funciones estadísticas en `Raster Band Statistics <https://postgis.net/docs/RT_reference.html#RasterBand_Stats>`_.
sv: Du kan hitta en meny med dessa statistiska funktioner i `Raster Band Statistics <https://postgis.net/docs/RT_reference.html#RasterBand_Stats>`_.

source: ST_SummaryStatsAgg and ST_SummaryStats
es: ST_SummaryStatsAgg y ST_SummaryStats
sv: ST_SummaryStatsAgg och ST_SummaryStats

source: Want all stats for a set or rasters, reach for the function `ST_SummaryStatsAgg <https://postgis.net/docs/RT_ST_SummaryStatsAgg.html>`_.
es: ¿Quieres todas las estadísticas para un conjunto de raster? Usa la función `ST_SummaryStatsAgg <https://postgis.net/docs/RT_ST_SummaryStatsAgg.html>`_.
sv: Om du vill ha all statistik för en uppsättning eller raster kan du använda funktionen `ST_SummaryStatsAgg <https://postgis.net/docs/RT_ST_SummaryStatsAgg.html>`_.

source: This query takes about 10 seconds and gives you a summary of the whole table:
es: Esta consulta toma unos 10 segundos y te da un resumen de toda la tabla:
sv: Denna fråga tar cirka 10 sekunder och ger dig en sammanfattning av hela tabellen:

source: Outputs:
es: Salidas:
sv: Utmatning:

source: Which tells we have a lot of pixels and our max elevation is 411 ft.
es: Lo cual nos dice que tenemos muchos píxeles y nuestra elevación máxima es de 411 pies.
sv: Det betyder att vi har många bildpunkter och att vår maxhöjd är 411 fot.

source: If you have built overviews, and just need a rough estimate of your mins, maxs, and means use one of your overviews. This next query returns roughly the same values for mins, maxs, and means as the prior but in about 1 second instead of 10.
es: Si has construido overviews y solo necesitas una estimación aproximada de tus mínimos, máximos y medias usa uno de tus overviews. Esta siguiente consulta devuelve aproximadamente los mismos valores de mínimos, máximos y medias que la anterior, pero en alrededor de 1 segundo en lugar de 10.
sv: Om du har byggt översikter och bara behöver en grov uppskattning av dina mins, maxs och medelvärden använder du en av dina översikter. Nästa fråga returnerar ungefär samma värden för min, max och medel som den tidigare men på cirka 1 sekund istället för 10.

source: Now armed with this bit of information, we can ask more questions.
es: Ahora, con esta información, podemos hacer más preguntas.
sv: Med den här informationen kan vi nu ställa fler frågor.

source: Generally you won't want stats for your whole table, but instead just stats for a particular area, in that case, you'll want to also employ our old friends :command:`ST_Intersects` and :command:`ST_Clip`. If you are also in need of a raster statistics function that doesn't have an aggregate version, you'll want to carry :command:`ST_Union` along for the ride.
es: Generalmente no querrás estadísticas para toda tu tabla, sino solo estadísticas para un área en particular, en ese caso, también querrás emplear a nuestros viejos amigos :command:`ST_Intersects` y :command:`ST_Clip`. Si también necesitas una función estadística raster que no tenga una versión agregada, deberás llevar :command:`ST_Union` contigo.
sv: I allmänhet vill du inte ha statistik för hela tabellen, utan istället bara statistik för ett visst område, och i så fall vill du också använda våra gamla vänner :command:`ST_Intersects` och :command:`ST_Clip`. Om du också är i behov av en rasterstatistikfunktion som inte har en aggregerad version, vill du ha med dig :command:`ST_Union` för resan.

source: For this next example we'll use a different stats function `ST_Histogram <https://postgis.net/docs/RT_ST_Histogram.html>`_ which has no aggregate equivalent, and for this particular variant, is a set returning function. We are using the same area of interest as some prior examples, but we also need to employ geometry :command:`ST_Transform` to transform our NY state plane meters geometry to our NYC State Plane feet rasters. It is almost always more performant to transform the geometry instead of raster and definitely if your geometry is just a single one.
es: Para el siguiente ejemplo usaremos una función de estadísticas diferente `ST_Histogram <https://postgis.net/docs/RT_ST_Histogram.html>`_ que no tiene equivalente agregado, y para esta variante en particular, es una función que devuelve un conjunto. Estamos usando la misma área de interés que en algunos ejemplos anteriores, pero también necesitamos emplear la geometría :command:`ST_Transform` para transformar nuestra geometría en metros state plane de NY a nuestros raster en pies state plane de NYC. Casi siempre es más eficiente transformar la geometría en lugar del raster, y definitivamente si tu geometría es solo una.
sv: För nästa exempel använder vi en annan statistikfunktion `ST_Histogram <https://postgis.net/docs/RT_ST_Histogram.html>`_ som inte har någon aggregerad motsvarighet, och för denna speciella variant är det en funktion som returnerar en uppsättning. Vi använder samma intresseområde som i några tidigare exempel, men vi måste också använda geometri :command:`ST_Transform` för att omvandla vår NY State Plane meter geometri till våra NYC State Plane feet rasters. Det är nästan alltid mer performant att transformera geometrin istället för raster och definitivt om din geometri bara är en enda.

source: the above query completes in under 60ms and outputs:
es: la consulta anterior se completa en menos de 60ms y produce:
sv: ovanstående fråga slutförs på mindre än 60 ms och matas ut:

source: Creating Derivative Rasters
es: Creando raster derivados
sv: Skapa derivativa raster

source: PostGIS raster comes packaged with a number of functions for editing rasters. These functions are both used for editing as well as creating derivative raster data sets. You will find these listed in `Raster Editors <https://postgis.net/docs/RT_reference.html#Raster_Editors>`_ and `Raster Management <https://postgis.net/docs/RT_reference.html#Raster_Management_Functions>`_.
es: PostGIS raster viene con varias funciones para editar raster. Estas funciones se usan tanto para editar como para crear conjuntos de datos raster derivados. Encontrarás estas listadas en `Raster Editors <https://postgis.net/docs/RT_reference.html#Raster_Editors>`_ y `Raster Management <https://postgis.net/docs/RT_reference.html#Raster_Management_Functions>`_.
sv: PostGIS raster levereras med ett antal funktioner för att redigera raster. Dessa funktioner används både för att redigera och för att skapa derivata rasterdatauppsättningar. Du hittar dessa listade i `Raster-redigerare <https://postgis.net/docs/RT_reference.html#Raster_Editors>`_ och `Raster Management <https://postgis.net/docs/RT_reference.html#Raster_Management_Functions>`_.

source: Transforming rasters with ST_Transform
es: Transformando raster con ST_Transform
sv: Transformera raster med ST_Transform

source: Most of our data is in NY State Plane meters (SRID: 26918), however our DEM raster dataset is in NY State Plane feet (SRID: 2263). For the least cumbersome workflow, we need our core datasets to be in the same spatial reference system.
es: La mayoría de nuestros datos están en NY State Plane metros (SRID: 26918), sin embargo nuestro conjunto de datos DEM raster está en NY State Plane pies (SRID: 2263). Para un flujo de trabajo menos engorroso, necesitamos que nuestros conjuntos de datos principales estén en el mismo sistema de referencia espacial.
sv: De flesta av våra data är i NY State Plane meter (SRID: 26918), men vår DEM-rasterdatauppsättning är i NY State Plane feet (SRID: 2263). För att få ett så smidigt arbetsflöde som möjligt måste våra centrala dataset vara i samma spatiala referenssystem.

source: The `raster ST_Transform <https://postgis.net/docs/RT_ST_Transform.html>`_ is the function most suited for this job.
es: La función `raster ST_Transform <https://postgis.net/docs/RT_ST_Transform.html>`_ es la más adecuada para este trabajo.
sv: Funktionen `raster ST_Transform <https://postgis.net/docs/RT_ST_Transform.html>`_ är den funktion som är bäst lämpad för detta jobb.
