Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/rasters.po
Languages: es, sv

source: Before we showcase `ST_MapAlgebra`, we'll explore other functions that fit under the `Map Algebra` family of functions and generally have better performance than `ST_MapAlgebra`.
es: Antes de mostrar `ST_MapAlgebra`, exploraremos otras funciones que encajan en la familia de funciones de `Map Algebra` y que generalmente tienen mejor rendimiento que `ST_MapAlgebra`.
sv: Innan vi visar `ST_MapAlgebra`, utforskar vi andra funktioner som passar in under `Map Algebra`-familjen av funktioner och har i allmänhet bättre prestanda än `ST_MapAlgebra`.

source: Reclassify your raster using ST_Reclass
es: Reclasificar tu raster usando ST_Reclass
sv: Omklassificera ditt raster med hjälp av ST_Reclass

source: An often overlooked map-algebraish function is the `ST_Reclass <https://postgis.net/docs/RT_ST_Reclass.html>`_ function, who sits in the background waiting for someone to discover the power and speed it can offer.
es: Una función de álgebra de mapas a menudo pasada por alto es la función `ST_Reclass <https://postgis.net/docs/RT_ST_Reclass.html>`_, que espera en segundo plano a que alguien descubra el poder y la velocidad que puede ofrecer.
sv: En ofta förbisedd map-algebraisk funktion är funktionen `ST_Reclass <https://postgis.net/docs/RT_ST_Reclass.html>`_, som sitter i bakgrunden och väntar på att någon ska upptäcka den kraft och snabbhet som den kan erbjuda.

source: What does **ST_Reclass** do? It as the name implies, reclassifies your pixel values based on minimalist range algebra.
es: ¿Qué hace **ST_Reclass**? Como su nombre lo indica, reclasifica tus valores de píxeles basándose en un álgebra de rangos minimalista.
sv: Vad gör **ST_Reclass**? Som namnet antyder omklassificerar den dina pixelvärden baserat på minimalistisk intervallalgebra.

source: Lets revisit our NYC Dems. Perhaps we only care about classifying our elevations as 1) low, 2) medium, 3) high , and 4) really high. We don't need 411 values, we just need 4. With that said lets do some reclassifying.
es: Revisitemos nuestros NYC Dems. Tal vez solo nos importe clasificar nuestras elevaciones como 1) baja, 2) media, 3) alta, y 4) muy alta. No necesitamos 411 valores, solo necesitamos 4. Dicho esto, hagamos algo de reclasificación.
sv: Låt oss återgå till våra NYC Dems. Kanske bryr vi oss bara om att klassificera våra höjder som 1) låg, 2) medium, 3) hög och 4) riktigt hög. Vi behöver inte 411 värden, vi behöver bara 4. Med det sagt låt oss göra lite omklassificering.

source: The classification scheme is governed by the `reclass expression <https://postgis.net/docs/reclassarg.html>`_.
es: El esquema de clasificación está gobernado por la `reclass expression <https://postgis.net/docs/reclassarg.html>`_.
sv: Klassificeringssystemet styrs av `reclass-uttrycket <https://postgis.net/docs/reclassarg.html>`_.

source: Which would output:
es: Lo cual produciría:
sv: Vilket skulle ge utdata:

source: If this were a classification scheme we preferred, we could create a new table using the ST_Reclass to recompute each tile.
es: Si este fuera un esquema de clasificación que prefiriéramos, podríamos crear una nueva tabla usando ST_Reclass para recalcular cada tile.
sv: Om det här var ett klassificeringssystem som vi föredrog skulle vi kunna skapa en ny tabell med ST_Reclass för att räkna om varje platta.

source: Coloring your rasters with ST_ColorMap
es: Coloreando tus rasters con ST_ColorMap
sv: Färglägga dina raster med ST_ColorMap

source: The `ST_ColorMap <https://postgis.net/docs/RT_ST_ColorMap.html>`_ function is another mapalgebraish function that reclassifies your pixel values. Except it is band creating. It converts a single band raster such as our Dems into a visually presentable 3 or 4 banded raster.
es: La función `ST_ColorMap <https://postgis.net/docs/RT_ST_ColorMap.html>`_ es otra función de tipo mapalgebra que reclasifica tus valores de píxeles. Excepto que es creadora de bandas. Convierte un raster de una sola banda, como nuestros Dems, en un raster de 3 o 4 bandas visualmente presentable.
sv: Funktionen `ST_ColorMap <https://postgis.net/docs/RT_ST_ColorMap.html>`_ är en annan mapalgebraisk funktion som omklassificerar dina pixelvärden. Förutom att det är bandskapande. Det omvandlar ett enda bandraster som våra Dems till ett visuellt presentabelt 3- eller 4-bandat raster.

source: You could use one of the built-in colormaps as below if you don't want to fuss with creating one.
es: Podrías usar uno de los colormaps incorporados como se muestra a continuación si no quieres complicarte creando uno.
sv: Du kan använda en av de inbyggda färgkartorna enligt nedan om du inte vill krångla med att skapa en.

source: Which looks like:
es: Lo cual se vería así:
sv: Vilket ser ut som:

source: The bluer the color the lower the elevation and the redder the color the higher the elevation.
es: Cuanto más azul es el color, menor es la elevación, y cuanto más rojo es el color, mayor es la elevación.
sv: Ju blåare färg desto lägre höjd och ju rödare färg desto högre höjd.
