Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/schemas.po
Languages: es, sv

source: PostgreSQL Schemas
es: Esquemas en Postgresql
sv: PostgreSQL-scheman

source: Production databases inevitably have a large number of tables and views, and managing them all in one schema can become unwieldy quickly. Fortunately, PostgreSQL_ includes the concept of a "_Schema".
es: Las bases de datos de producción inevitablemente tienen un gran número de tablas y vistas, y administrarlas puede volverse difícil. Afortunadamente, PostgreSQL_ incluye el concepto de "_Schema".
sv: Produktionsdatabaser har oundvikligen ett stort antal tabeller och vyer, och att hantera dem alla i ett schema kan snabbt bli obehagligt. Lyckligtvis innehåller PostgreSQL_ konceptet "_Schema".

source: Schemas are like folders, and can hold tables, views, functions, sequences and other relations. Every database starts out with one schema, the ``public`` schema.
es: Los esquemas son como carpetas y pueden contener tablas, vistas, funciones, secuencias y otras relaciones. Toda base de datos comienza con un esquema, el esquema ``público``.
sv: Scheman är som mappar och kan innehålla tabeller, vyer, funktioner, sekvenser och andra relationer. Varje databas börjar med ett schema, det "offentliga" schemat.

source: Inside that schema, the default install of PostGIS creates the ``geometry_columns``, ``geography_columns`` and ``spatial_ref_sys`` metadata relations, as well as all the types and functions used by PostGIS. So users of PostGIS always need access to the public schema.
es: Dentro de ese esquema, la instalación predeterminada de PostGIS crea las relaciones de metadatos ``geometry_columns``, ``geography_columns`` y ``spatial_ref_sys``, así como todos los tipos y funciones utilizados por PostGIS. Así que los usuarios de PostGIS siempre necesitan acceder al esquema público.
sv: I det schemat skapar standardinstallationen av PostGIS metadatarelationerna ``geometry_columns``, ``geography_columns`` och ``spatial_ref_sys``, samt alla typer och funktioner som används av PostGIS. Så användare av PostGIS behöver alltid tillgång till det offentliga schemat.

source: In the public schema you can also see all the tables we have created so far in the workshop.
es: En el esquema público también puedes ver todas las tablas que hemos creado hasta ahora en el taller.
sv: I det publika schemat kan du också se alla de tabeller som vi har skapat hittills i workshopen.

source: Why use Schemas?
es: ¿Por qué usar esquemas?
sv: Varför använda Schemas?

source: There are two very good reasons for using schemas:
es: Hay dos buenas razones para utilizar esquemas:
sv: Det finns två mycket goda skäl till att använda scheman:

source: Data that is managed in a schema is easier to apply bulk actions to.
es: A los datos que se gestionan en un esquema se puede aplicar acciones masivas con facilidad.
sv: Data som hanteras i ett schema är lättare att använda bulkåtgärder på.

source: It's easier to back-up data that's in a separate schema: so volatile data can have a different back-up schedule from non-volatile data.
es: Es más fácil hacer copias de seguridad de datos que están en un esquema separado: así, los datos volátiles pueden tener un programa de copias de seguridad diferente del de los datos no volátiles.
sv: Det är lättare att säkerhetskopiera data som finns i ett separat schema: så flyktiga data kan ha ett annat säkerhetskopieringsschema än icke-flyktiga data.

source: It's easier to restore data that's in a separate schema: so application-oriented schemas can be separately restored and backed up for time travel and recovery.
es: Es más fácil restaurar datos que están en un esquema separado: así, los esquemas orientados a aplicaciones pueden restaurarse por separado y se puede hacer una copia de seguridad de ellos para recuperarlos.
sv: Det är lättare att återställa data som finns i ett separat schema: så applikationsorienterade scheman kan återställas separat och säkerhetskopieras för tidsresor och återställning.

source: It's easier to manage application differences when the application data is in a schema: so a new version of software can work off a table structure in a new schema, and cut-over involves a simple change to the schema name.
es: Es más fácil gestionar los cambios en la aplicación cuando los datos de la aplicación están en un esquema: así, una nueva versión del software puede funcionar con una estructura de tablas en un nuevo esquema, y la transición implica un simple cambio en el nombre del esquema.
sv: Det är lättare att hantera programskillnader när programdata finns i ett schema: så en ny version av programvaran kan arbeta med en tabellstruktur i ett nytt schema, och övergången innebär en enkel ändring av schemanamnet.

source: Users can be restricted in their work to single schemas to allow isolation of analytical and test tables from production tables.
es: El trabajo de los usuarios puede limitarse a esquemas únicos para aislar las tablas analíticas y de prueba de las tablas de producción.
sv: Användare kan begränsas i sitt arbete till enstaka scheman för att möjliggöra isolering av analys- och testtabeller från produktionstabeller.

source: So for production purposes, keeping your application data separate in schemas improves management; and for user purposes, keeping your users in separate schemas keeps them from treading on each other.
es: Así pues, a efectos de producción, mantener los datos de la aplicación separados en esquemas mejora la gestión; y a efectos de usuario, mantener a los usuarios en esquemas separados evita que la colisión no deseada de actividades entre ellos.
sv: Så för produktionsändamål förbättras hanteringen om du håller dina applikationsdata åtskilda i scheman; och för användarändamål förhindrar du att dina användare trampar på varandra genom att hålla dem i separata scheman.

source: Creating a Data Schema
es: Creando un Esquema de Datos
sv: Skapa ett dataschema

source: Let's create a new schema and move a table into it. First, create a new schema in the database:
es: Vamos a crear un nuevo esquema y mover una tabla dentro de él. Primero, crea un nuevo esquema en la base de datos:
sv: Låt oss skapa ett nytt schema och flytta en tabell till det. Skapa först ett nytt schema i databasen:

source: Next, we will move the ``nyc_census_blocks`` table to the ``census`` schema:
es: A continuación, moveremos la tabla ``nyc_census_blocks`` al esquema ``census``:
sv: Därefter flyttar vi tabellen ``nyc_census_blocks`` till schemat ``census``:

source: If you're using the :command:`psql` command-line program, you'll notice that ``nyc_census_blocks`` has disappeared from your table listing now! If you're using PgAdmin, you might have to refresh your view to see the new schema and the table inside it.
es: Si estás usando el programa de línea de comandos :command:`psql`, notarás que ``nyc_census_blocks`` ha desaparecido de tu lista de tablas ahora! Si estás usando PgAdmin, puede que tengas que refrescar tu vista para ver el nuevo esquema y la tabla dentro de él.
sv: Om du använder kommandoradsprogrammet :command:`psql` kommer du att märka att ``nyc_census_blocks`` har försvunnit från din tabellista nu! Om du använder PgAdmin kan du behöva uppdatera din vy för att se det nya schemat och tabellen i det.

source: You can access tables inside schemas in two ways:
es: Puedes acceder a las tablas dentro de los esquemas de dos maneras:
sv: Du kan komma åt tabeller i scheman på två sätt:

source: by referencing them using ``schema.table`` notation
es: haciendo referencia a ellas usando la notación ``schema.table``
sv: genom att referera till dem med hjälp av ``schema.table``-notation

source: by adding the schema to your ``search_path``
es: añadiendo el esquema a tu ``search_path``
sv: genom att lägga till schemat i din ``search_path``

source: Explicit referencing is easy, but it gets tiring to type after a while:
es: La referencia explícita es fácil, pero con el tiempo se vuelve tediosa de escribir:
sv: Explicit hänvisning är enkelt, men det blir tröttsamt att skriva efter ett tag:

source: Manipulating the ``search_path`` is a nice way to provide access to tables in multiple schemas without lots of extra typing.
es: Manipular el ``search_path`` es una buena manera de proporcionar acceso a tablas en múltiples esquemas sin mucho tipeo adicional.
sv: Manipulering av ``search_path`` är ett bra sätt att ge åtkomst till tabeller i flera scheman utan en massa extra typning.

source: You can set the ``search_path`` at run time using the ``SET`` command:
es: Puedes establecer el ``search_path`` en tiempo de ejecución usando el comando ``SET``:
sv: Du kan ställa in ``search_path`` vid körning med kommandot ``SET``:

source: This ensures that all references to relations and functions are searched in both the ``census`` and the ``public`` schemas. Remember that all the PostGIS functions and types are in ``public`` so we don't want to drop that from the search path.
es: Esto asegura que todas las referencias a relaciones y funciones sean buscadas tanto en los esquemas ``census`` como ``public``. Recuerda que todas las funciones y tipos de PostGIS están en ``public`` así que no queremos quitarlo del search path.
sv: Detta säkerställer att alla referenser till relationer och funktioner söks i både ``census`` och ``public`` schemat. Kom ihåg att alla PostGIS-funktioner och -typer finns i ``public`` så vi vill inte ta bort dem från sökvägen.

source: Setting the search path every time you connect can get tiring too, but fortunately it's possible to permanently set the search path for a user:
es: Configurar el search path cada vez que te conectas también puede ser cansado, pero afortunadamente es posible establecerlo de forma permanente para un usuario:
sv: Att ställa in sökvägen varje gång du ansluter kan också bli tröttsamt, men lyckligtvis är det möjligt att permanent ställa in sökvägen för en användare:

source: Now the postgres user will always have the ``census`` schema in their search path.
es: Ahora el usuario postgres siempre tendrá el esquema ``census`` en su search path.
sv: Nu kommer postgres-användaren alltid att ha schemat ``census`` i sin sökväg.

source: Creating a User Schema
es: Creación de un esquema de usuario
sv: Skapa ett användarschema

source: Users like to create tables, and PostGIS users do so particularly: analysis operations with SQL demand temporary tables for visualization or interim results, so spatial SQL tends to require that users have CREATE privileges more than ordinary database workloads.
es: A los usuarios les gusta crear tablas, y los usuarios de PostGIS en particular: las operaciones de análisis con SQL requieren tablas temporales para visualización o resultados intermedios, así que el SQL espacial tiende a requerir que los usuarios tengan privilegios de CREATE más que las cargas de trabajo ordinarias de bases de datos.
sv: Användare gillar att skapa tabeller, och PostGIS-användare gör det särskilt: analysoperationer med SQL kräver temporära tabeller för visualisering eller tillfälliga resultat, så spatial SQL tenderar att kräva att användare har CREATE-rättigheter mer än vanliga databasarbetsbelastningar.

source: By default, every role in Oracle is given a personal schema. This is a nice practice to use for PostgreSQL users too, and is easy to replicate using PostgreSQL roles, schemas, and search paths.
es: De manera predeterminada, cada rol en Oracle recibe un esquema personal. Esta es una buena práctica para usar también con los usuarios de PostgreSQL, y es fácil de replicar usando roles, esquemas y search paths de PostgreSQL.
sv: Som standard får varje roll i Oracle ett personligt schema. Detta är en trevlig praxis att använda för PostgreSQL-användare också, och det är lätt att replikera med PostgreSQL-roller, scheman och sökvägar.

source: Create a new user with table creation privileges (see :ref:`security` for information about the ``postgis_writer`` role), then create a schema with that user as the authorization:
es: Crea un nuevo usuario con privilegios de creación de tablas (ver :ref:`security` para información sobre el rol ``postgis_writer``), luego crea un esquema con ese usuario como autorización:
sv: Skapa en ny användare med behörighet att skapa tabeller (se :ref:`security` för information om rollen ``postgis_writer``) och skapa sedan ett schema med den användaren som behörig:

source: If you log in as that user, you'll find the default ``search_path`` for PostgreSQL is actually this:
es: Si inicias sesión como ese usuario, encontrarás que el ``search_path`` predeterminado para PostgreSQL es en realidad este:
sv: Om du loggar in som den användaren kommer du att upptäcka att standard ``search_path`` för PostgreSQL faktiskt är detta:

source: The first schema on the search path us the user's named schema! So now the following conditions exist:
es: ¡El primer esquema en el search path es el esquema con el nombre del usuario! Así que ahora existen las siguientes condiciones:
sv: Det första schemat på sökvägen är användarens namngivna schema! Så nu finns följande villkor:

source: The user exists, with the ability to create spatial tables.
es: El usuario existe, con la capacidad de crear tablas espaciales.
sv: Användaren finns, med möjlighet att skapa spatiala tabeller.

source: The user's named schema exists, and the user owns it.
es: El esquema con el nombre del usuario existe, y el usuario es su propietario.
sv: Användarens namngivna schema finns och användaren äger det.

source: The user's search path has the user schema first, so new tables are automatically created there, and queries automatically search there first.
es: El search path del usuario tiene primero el esquema del usuario, por lo que las nuevas tablas se crean automáticamente allí, y las consultas buscan automáticamente allí primero.
sv: Användarens sökväg har användarens schema först, så nya tabeller skapas automatiskt där och frågor söker automatiskt där först.

source: That's all there is to it, the user's default work area is now nicely separated from any tables in other schemas.
es: Eso es todo, el área de trabajo predeterminada del usuario ahora está bien separada de cualquier tabla en otros esquemas.
sv: Det är allt som behövs, användarens standardarbetsområde är nu snyggt separerat från alla tabeller i andra scheman.
