Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/security.po
Languages: es, sv

source: PostgreSQL Security
es: Seguridad en PostgreSQL
sv: PostgreSQL säkerhet

source: PostgreSQL has a rich and flexible permissions system, with the ability to parcel out particular privileges to particular roles_, and provide users with the powers of one or more of those roles_.
es: PostgreSQL tiene un sistema de permisos rico y flexible, con la capacidad de asignar privilegios particulares a roles_ específicos, y otorgar a los usuarios los poderes de uno o más de esos roles_.
sv: PostgreSQL har ett rikt och flexibelt behörighetssystem med förmågan att dela ut särskilda privilegier till särskilda roles_, och ge användare befogenheterna för en eller flera av dessa roles_.

source: In addition, the PostgreSQL server can use multiple different systems to authenticate users. This means that the database can use the same authentication infrastructure as other architecture components, simplifying password management.
es: Además, el servidor de PostgreSQL puede usar múltiples sistemas diferentes para autenticar usuarios. Esto significa que la base de datos puede utilizar la misma infraestructura de autenticación que otros componentes de la arquitectura, simplificando la gestión de contraseñas.
sv: Dessutom kan PostgreSQL-servern använda flera olika system för att autentisera användare. Detta innebär att databasen kan använda samma autentiseringsinfrastruktur som andra arkitekturkomponenter, vilket förenklar lösenordshanteringen.

source: Users and Roles
es: Usuarios y Roles
sv: Användare och roller

source: In this chapter we will create two useful production users:
es: En este capítulo crearemos dos usuarios de producción útiles:
sv: I det här kapitlet kommer vi att skapa två användbara produktionsanvändare:

source: A read-only user for use in a publishing application.
es: Un usuario de solo lectura para usar en una aplicación de publicación.
sv: En skrivskyddad användare för användning i en publiceringsapplikation.

source: A read/write user for use by a developer in building a software or analyzing data.
es: Un usuario de lectura/escritura para usar por un desarrollador en la construcción de un software o análisis de datos.
sv: En läs/skriv-användare som används av en utvecklare för att bygga en programvara eller analysera data.

source: Rather than creating users and granting them the necessary powers, we will create two roles with the right powers and then create two users and add them to the appropriate roles. That way we can easily reuse the roles when we create further users.
es: En lugar de crear usuarios y otorgarles los poderes necesarios, crearemos dos roles con los privilegios adecuados y luego crearemos dos usuarios y los agregaremos a los roles apropiados. De esa manera podremos reutilizar fácilmente los roles cuando creemos más usuarios.
sv: I stället för att skapa användare och ge dem de nödvändiga befogenheterna skapar vi två roller med rätt befogenheter och skapar sedan två användare och lägger till dem i lämpliga roller. På så sätt kan vi enkelt återanvända rollerna när vi skapar ytterligare användare.

source: Creating Roles
es: Creación de Roles
sv: Skapa roller

source: A role is a user and a user is a role. The only difference is that a "user" can be said to be a role with the "login" privilege.
es: Un rol es un usuario y un usuario es un rol. La única diferencia es que un "usuario" puede considerarse un rol con el privilegio de "login".
sv: En roll är en användare och en användare är en roll. Den enda skillnaden är att en "user" kan sägas vara en roll med "login"-rättigheter.

source: So functionally, the two SQL statements below are the same, they both create a "role with the login privilege", which is to say, a "user".
es: Así que, funcionalmente, las dos sentencias SQL siguientes son iguales: ambas crean un "rol con el privilegio de login", es decir, un "usuario".
sv: Så funktionellt sett är de två SQL-satserna nedan desamma, de skapar båda en "roll med inloggningsbehörighet", det vill säga en "användare".

source: Read-only Users
es: Usuarios de Solo Lectura
sv: Skrivskyddade användare

source: Our read-only user will be for a web application to use to query the ``nyc_streets`` table.
es: Nuestro usuario de solo lectura será para que una aplicación web consulte la tabla ``nyc_streets``.
sv: Vår skrivskyddade användare kommer att användas av en webbapplikation för att söka i tabellen ``nyc_streets``.

source: The application will have specific access to the ``nyc_streets`` table, but will inherit the necessary system access for PostGIS operations from the ``postgis_reader`` role.
es: La aplicación tendrá acceso específico a la tabla ``nyc_streets``, pero heredará el acceso necesario al sistema para operaciones PostGIS desde el rol ``postgis_reader``.
sv: Programmet kommer att ha specifik åtkomst till tabellen ``nyc_streets``, men kommer att ärva den nödvändiga systemåtkomsten för PostGIS-operationer från rollen ``postgis_reader``.

source: Now, when we login as app1, we can select rows from the ``nyc_streets`` table. However, we cannot run an :command:`ST_Transform` call! Why not?
es: Ahora, cuando iniciamos sesión como app1, podemos seleccionar filas de la tabla ``nyc_streets``. Sin embargo, ¡no podemos ejecutar una llamada a :command:`ST_Transform`! ¿Por qué no?
sv: Nu, när vi loggar in som app1, kan vi välja rader från tabellen ``nyc_streets``. Vi kan dock inte köra ett :command:`ST_Transform`-anrop! Varför kan vi inte det?

source: The answer is contained in the error statement. Though our ``app1`` user can view the contents of the ``nyc_streets`` table fine, it cannot view the contents of ``spatial_ref_sys``, so the call to :command:`ST_Transform` fails.
es: La respuesta está en la declaración de error. Aunque nuestro usuario ``app1`` puede ver el contenido de la tabla ``nyc_streets`` sin problemas, no puede ver el contenido de ``spatial_ref_sys``, por lo que la llamada a :command:`ST_Transform` falla.
sv: Svaret finns i felmeddelandet. Även om vår ``app1`` användare kan se innehållet i ``nyc_streets`` tabellen bra, kan den inte se innehållet i ``spatial_ref_sys``, så anropet till :command:`ST_Transform` misslyckas.

source: So, we need to also grant the ``postgis_reader`` role read access to all the PostGIS metadata tables:
es: Por lo tanto, también necesitamos otorgar al rol ``postgis_reader`` acceso de lectura a todas las tablas de metadatos de PostGIS:
sv: Därför måste vi också ge rollen ``postgis_reader`` läsåtkomst till alla PostGIS-metadatatabeller:

source: Now we have a nice generic ``postgis_reader`` role we can apply to any user that need to read from PostGIS tables.
es: Ahora tenemos un rol genérico ``postgis_reader`` que podemos aplicar a cualquier usuario que necesite leer tablas PostGIS.
sv: Nu har vi en generisk roll, ``postgis_reader``, som vi kan använda för alla användare som behöver läsa från PostGIS-tabeller.

source: Read/write Users
es: Usuarios de Lectura/Escritura
sv: Läsa/skriva Användare

source: There are two kinds of read/write scenarios we need to consider:
es: Existen dos tipos de escenarios de lectura/escritura que debemos considerar:
sv: Det finns två typer av läs/skriv-scenarier som vi måste ta hänsyn till:

source: Web applications and others that need to write to existing data tables.
es: Aplicaciones web y otras que necesitan escribir en tablas de datos existentes.
sv: Webbapplikationer och andra som behöver skriva till befintliga datatabeller.

source: Developers or analysts that need to create new tables and geometry columns as part of their work.
es: Desarrolladores o analistas que necesitan crear nuevas tablas y columnas de geometría como parte de su trabajo.
sv: Utvecklare eller analytiker som behöver skapa nya tabeller och geometrikolumner som en del av sitt arbete.

source: For web applications that require write access to data tables, we just need to grant extra permissions to the tables themselves, and we can continue to use the ``postgis_reader`` role.
es: Para aplicaciones web que requieren acceso de escritura a tablas de datos, solo necesitamos otorgar permisos adicionales a las propias tablas, y podemos seguir utilizando el rol ``postgis_reader``.
sv: För webbapplikationer som kräver skrivåtkomst till datatabeller behöver vi bara ge extra behörigheter till själva tabellerna, och vi kan fortsätta att använda rollen ``postgis_reader``.

source: These kinds of permissions would be required for a read/write WFS service, for example.
es: Este tipo de permisos serían necesarios, por ejemplo, para un servicio WFS de lectura/escritura.
sv: Den här typen av behörigheter krävs t.ex. för en WFS-tjänst för läsning/skrivning.

source: For developers and analysts, a little more access is needed to the main PostGIS metadata tables. We will need a ``postgis_writer`` role that can edit the PostGIS metadata tables!
es: Para desarrolladores y analistas, se necesita un poco más de acceso a las tablas principales de metadatos de PostGIS. Necesitaremos un rol ``postgis_writer`` que pueda editar las tablas de metadatos de PostGIS!
sv: För utvecklare och analytiker behövs lite mer tillgång till de viktigaste PostGIS-metadatatabellerna. Vi kommer att behöva en ``postgis_writer`` roll som kan redigera PostGIS metadatatabeller!

source: Now try the table creation SQL above as the app1 user and see how it goes!
es: Ahora intenta la creación de tablas en SQL anterior con el usuario app1 y observa qué sucede!
sv: Prova nu att skapa tabellen SQL ovan som app1-användare och se hur det går!

source: Encryption
es: Cifrado
sv: Kryptering

source: PostgreSQL provides a lot of `encryption facilities <http://www.postgresql.org/docs/current/static/encryption-options.html>`_, many of them optional, some of them on by default.
es: PostgreSQL proporciona muchas `facilidades de cifrado <http://www.postgresql.org/docs/current/static/encryption-options.html>`_, muchas de ellas opcionales, algunas activadas de manera predeterminada.
sv: PostgreSQL tillhandahåller många `krypteringsfaciliteter <http://www.postgresql.org/docs/current/static/encryption-options.html>`_, många av dem valfria, några av dem är på som standard.

source: By default, all passwords are MD5 encrypted. The client/server handshake double encrypts the MD5 password to prevent re-use of the hash by anyone who intercepts the password.
es: De manera predeterminada, todas las contraseñas están cifradas con MD5. El intercambio cliente/servidor cifra doblemente la contraseña MD5 para evitar la reutilización del hash por cualquiera que intercepte la contraseña.
sv: Som standard är alla lösenord MD5-krypterade. Handskakningen mellan klient och server dubbelkrypterar MD5-lösenordet för att förhindra att hashen återanvänds av någon som snappar upp lösenordet.

source: `SSL connections <http://www.postgresql.org/docs/current/static/libpq-ssl.html>`_ are optionally available between the client and server, to encrypt all data and login information. SSL certificate authentication is also available when SSL connections are used.
es: Las `conexiones SSL <http://www.postgresql.org/docs/current/static/libpq-ssl.html>`_ están disponibles opcionalmente entre el cliente y el servidor, para cifrar todos los datos e información de inicio de sesión. La autenticación con certificados SSL también está disponible cuando se usan conexiones SSL.
sv: `SSL-anslutningar <http://www.postgresql.org/docs/current/static/libpq-ssl.html>`_ är valfritt tillgängliga mellan klienten och servern för att kryptera all data och inloggningsinformation. Autentisering med SSL-certifikat är också tillgänglig när SSL-anslutningar används.

source: Columns inside the database can be encrypted using the pgcrypto_ module, which includes hashing algorithms, direct ciphers (blowfish, aes) and both public key and symmetric PGP encryption.
es: Dentro de la base de datos, las columnas pueden cifrarse utilizando el módulo pgcrypto_, que incluye algoritmos de hash, cifrados directos (blowfish, aes) y cifrado PGP tanto de clave pública como simétrica.
sv: Kolumner i databasen kan krypteras med hjälp av modulen pgcrypto_, som innehåller hash-algoritmer, direkta chiffer (blowfish, aes) och både PGP-kryptering med offentlig nyckel och symmetrisk kryptering.

source: SSL Connections
es: Conexiones SSL
sv: SSL-anslutningar

source: In order to use SSL connections, both your client and server must support SSL.
es: Para usar conexiones SSL, tanto el cliente como el servidor deben soportar SSL.
sv: För att kunna använda SSL-anslutningar måste både klienten och servern ha stöd för SSL.

source: First, turn off PostgreSQL, since activating SSL will require a restart.
es: Primero, apaga PostgreSQL, ya que activar SSL requerirá un reinicio.
sv: Stäng först av PostgreSQL, eftersom aktivering av SSL kommer att kräva en omstart.

source: Next, we acquire or generate an SSL certificate and key. The certificate will need to have no passphrase on it, or the database server won't be able to start up. You can generate a self-signed key as follows:
es: Luego, adquirimos o generamos un certificado y una clave SSL. El certificado no debe tener frase de paso, o el servidor de base de datos no podrá arrancar. Puedes generar una clave autofirmada de la siguiente forma:
sv: Därefter skaffar eller genererar vi ett SSL-certifikat och en nyckel. Certifikatet får inte innehålla någon lösenfras, annars kommer databasservern inte att kunna startas. Du kan generera en självsignerad nyckel enligt följande:

source: Copy the ``server.crt`` and ``server.key`` into the PostgreSQL data directory.
es: Copia los archivos ``server.crt`` y ``server.key`` en el directorio de datos de PostgreSQL.
sv: Kopiera ``server.crt`` och ``server.key`` till PostgreSQL-datakatalogen.

source: Enable SSL support in the ``postgresql.conf`` file by turning the "ssl" parameter to "on".
es: Habilita el soporte SSL en el archivo ``postgresql.conf`` cambiando el parámetro "ssl" a "on".
sv: Aktivera SSL-stöd i filen ``postgresql.conf`` genom att ändra parametern "ssl" till "on".

source: Now re-start PostgreSQL; the server is ready for SSL operation.
es: Ahora reinicia PostgreSQL; el servidor está listo para operar con SSL.
sv: Starta nu PostgreSQL igen; servern är redo för SSL-drift.

source: With the server enabled for SSL, creating an encrypted connection is easy. In PgAdmin, create a new server connection (File > Add Server...), and set the SSL parameter to “require”.
es: Con el servidor habilitado para SSL, crear una conexión cifrada es fácil. En PgAdmin, crea una nueva conexión de servidor (File > Add Server...), y establece el parámetro SSL en “require”.
sv: När servern är aktiverad för SSL är det enkelt att skapa en krypterad anslutning. I PgAdmin skapar du en ny serveranslutning (Arkiv > Lägg till server...) och ställer in SSL-parametern på "require".

source: Once you connect with the new connection, you can see in its properties that it is using an SSL connection.
es: Una vez que te conectes, podrás ver en sus propiedades que está usando una conexión SSL.
sv: När du ansluter till den nya anslutningen kan du se i dess egenskaper att den använder en SSL-anslutning.

source: Since the default SSL connection mode is "prefer", you don't even need to specify an SSL preference when connecting. A connection with the command line ``psql`` terminal will pick up the SSL option and use it by default:
es: Dado que el modo de conexión SSL predeterminado es "prefer", ni siquiera necesitas especificar una preferencia SSL al conectarte. Una conexión con la terminal de línea de comandos ``psql`` tomará la opción SSL y la usará de manera predeterminada:
sv: Eftersom standardläget för SSL-anslutning är "prefer" behöver du inte ens ange en SSL-preferens när du ansluter. En anslutning med kommandoraden ``psql`` terminal kommer att plocka upp SSL-alternativet och använda det som standard:

source: Note how the terminal reports the SSL status of the connection.
es: Observa cómo la terminal informa el estado SSL de la conexión.
sv: Observera hur terminalen rapporterar SSL-statusen för anslutningen.

source: Data Encryption
es: Cifrado de Datos
sv: Kryptering av data

source: The pgcrypto_ module has a huge range of encryption options, so we will only demonstrate the simplest use case: encrypting a column of data using a symmetric cipher.
es: El módulo pgcrypto_ tiene una enorme variedad de opciones de cifrado, por lo que solo demostraremos el caso de uso más simple: cifrar una columna de datos usando un cifrado simétrico.
sv: Modulen pgcrypto_ har ett stort utbud av krypteringsalternativ, så vi kommer bara att demonstrera det enklaste användningsfallet: kryptering av en datakolumn med hjälp av ett symmetriskt chiffer.

source: First, enable pgcrypto by loading the contrib SQL file, either in PgAdmin or psql.
es: Primero, habilita pgcrypto cargando el archivo SQL de contrib, ya sea en PgAdmin o en psql.
sv: Först aktiverar du pgcrypto genom att ladda Contrib SQL-filen, antingen i PgAdmin eller psql.

source: Then, test the encryption function.
es: Luego, prueba la función de cifrado.
sv: Testa sedan krypteringsfunktionen.

source: And make sure it's reversible too!
es: Y asegúrate de que también sea reversible!
sv: Och se till att den är vändbar också!

source: Authentication
es: Identificación
sv: Autentisering

source: PostgreSQL supports many different `authentication methods <http://www.postgresql.org/docs/current/static/auth-methods.html>`_, to allow easy integration into existing enterprise architectures. For production purposes, the following methods are commonly used:
es: PostgreSQL soporta muchos `métodos de autenticación <http://www.postgresql.org/docs/current/static/auth-methods.html>`_ diferentes, para permitir una fácil integración en arquitecturas empresariales existentes. Para fines de producción, los siguientes métodos son comúnmente usados:
sv: PostgreSQL stöder många olika `autentiseringsmetoder <http://www.postgresql.org/docs/current/static/auth-methods.html>`_, för att möjliggöra enkel integration i befintliga företagsarkitekturer. För produktionsändamål används följande metoder vanligtvis:

source: **Password** is the basic system where the passwords are stored by the database, with MD5 encryption.
es: **Password** es el sistema básico donde las contraseñas son almacenadas por la base de datos, con cifrado MD5.
sv: **Password** är ett grundläggande system där lösenorden lagras i databasen med MD5-kryptering.

source: Kerberos_ is a standard enterprise authentication method, which is used by both the GSSAPI_ and SSPI_ schemes in PostgreSQL. Using SSPI_, PostgreSQL can authenticate against Windows servers.
es: Kerberos_ es un método estándar de autenticación empresarial, utilizado tanto por los esquemas GSSAPI_ como SSPI_ en PostgreSQL. Usando SSPI_, PostgreSQL puede autenticarse contra servidores Windows.
sv: Kerberos_ är en standard autentiseringsmetod för företag som används av både GSSAPI_ och SSPI_-scheman i PostgreSQL. Med hjälp av SSPI_ kan PostgreSQL autentisera mot Windows-servrar.

source: LDAP_ is another common enterprise authentication method. The `OpenLDAP <http://www.openldap.org/>`_ server bundled with most Linux distributions provides an open source implementation of LDAP_.
es: LDAP_ es otro método común de autenticación empresarial. El servidor `OpenLDAP <http://www.openldap.org/>`_ incluido en la mayoría de las distribuciones Linux proporciona una implementación de código abierto de LDAP_.
sv: LDAP_ är en annan vanlig autentiseringsmetod för företag. Servern `OpenLDAP <http://www.openldap.org/>`_ som levereras med de flesta Linux-distributioner tillhandahåller en implementering av LDAP_ med öppen källkod.

source: **Certificate** authentication is an option if you expect all client connections to be via SSL and are able to manage the distribution of keys.
es: La autenticación por **certificado** es una opción si esperas que todas las conexiones de cliente sean vía SSL y puedes gestionar la distribución de las claves.
sv: **Certificate**-autentisering är ett alternativ om du förväntar dig att alla klientanslutningar ska ske via SSL och om du kan hantera distributionen av nycklar.

source: PAM_ authentication is an option if you are on Linux or Solaris and use the PAM_ scheme for transparent authentication provision.
es: La autenticación PAM_ es una opción si estás en Linux o Solaris y usas el esquema PAM_ para provisión de autenticación transparente.
sv: PAM_-autentisering är ett alternativ om du använder Linux eller Solaris och använder PAM_-schemat för transparent autentisering.

source: Authentication methods are controlled by the ``pg_hba.conf`` file. The "HBA" in the file name stands for "host based access", because in addition to allowing you to specify the authentication method to use for each database, it allows you to limit host access using network addresses.
es: Los métodos de autenticación se controlan con el archivo ``pg_hba.conf``. El "HBA" en el nombre del archivo significa "host based access", porque además de permitir especificar el método de autenticación para cada base de datos, también permite limitar el acceso por host utilizando direcciones de red.
sv: Autentiseringsmetoderna styrs av filen ``pg_hba.conf``. "HBA" i filnamnet står för "host based access", eftersom du inte bara kan ange vilken autentiseringsmetod som ska användas för varje databas, utan även kan begränsa värdåtkomsten med hjälp av nätverksadresser.

source: Here is an example ``pg_hba.conf`` file:
es: Aquí un ejemplo de archivo ``pg_hba.conf``:
sv: Här är ett exempel på filen ``pg_hba.conf``:

source: The file consists of five columns
es: El archivo consta de cinco columnas
sv: Filen består av fem kolumner

source: **TYPE** determines the kind of access, either "local" for connections from the same server or "host" for remote connections.
es: **TYPE** determina el tipo de acceso, ya sea "local" para conexiones desde el mismo servidor o "host" para conexiones remotas.
sv: **TYPE** avgör vilken typ av åtkomst som avses, antingen "local" för anslutningar från samma server eller "host" för fjärranslutningar.

source: **DATABASE** specifies what database the configuration line refers to or "all" for all databases
es: **DATABASE** especifica a qué base de datos se refiere la línea de configuración o "all" para todas las bases de datos
sv: **DATABASE** anger vilken databas som konfigurationsraden hänvisar till eller "all" för alla databaser

source: **USER** specifies what users the line refers to or "all" for all users
es: **USER** especifica a qué usuarios se refiere la línea o "all" para todos los usuarios
sv: **USER** anger vilka användare raden avser eller "all" för alla användare

source: **CIDR-ADDRESS** specifies the network limitations for remote connections, using network/netmask syntax
es: **CIDR-ADDRESS** especifica las limitaciones de red para conexiones remotas, usando la sintaxis network/netmask
sv: **CIDR-ADDRESS** anger nätverksbegränsningarna för fjärranslutningar, med syntaxen network/netmask

source: **METHOD** specifies the authentication protocol to use. "trust" skips authentication entirely and simply accepts any valid username without challenge.
es: **METHOD** especifica el protocolo de autenticación a usar. "trust" omite completamente la autenticación y simplemente acepta cualquier nombre de usuario válido sin verificación.
sv: **METHOD** anger vilket autentiseringsprotokoll som ska användas. "trust" hoppar helt över autentisering och accepterar helt enkelt alla giltiga användarnamn utan utmaning.
