Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/security.po
Languages: es, sv

source: It's common for local connections to be trusted, since access to the server itself is usually privileged. Remote connections are disabled by default when PostgreSQL is installed: if you want to connect from remote machines, you'll have to add an entry.
es: Es común que se confíe de las conexiones locales, ya que el acceso al propio servidor suele ser privilegiado. Las conexiones remotas están deshabilitadas de manera predeterminada cuando se instala PostgreSQL: si deseas conectarte desde máquinas remotas, tendrás que añadir una entrada.
sv: Det är vanligt att lokala anslutningar är betrodda, eftersom åtkomst till själva servern vanligtvis är privilegierad. Fjärranslutningar är inaktiverade som standard när PostgreSQL installeras: om du vill ansluta från fjärrmaskiner måste du lägga till en post.

source: The line for ``nyc`` in the example above is an example of a remote access entry. The ``nyc`` example allows LDAP authenticated access only to machines on the local network (in this case the 192.168.1. network) and only to the nyc database. Depending on the security of your network, you will use more or less strict versions of these rules in your production set-up.
es: La línea para ``nyc`` en el ejemplo anterior es un ejemplo de entrada de acceso remoto. El ejemplo ``nyc`` permite acceso autenticado vía LDAP solo a máquinas en la red local (en este caso la red 192.168.1.) y solo a la base de datos nyc. Dependiendo de la seguridad de tu red, usarás versiones más o menos estrictas de estas reglas en tu configuración de producción.
sv: Raden för ``nyc`` i exemplet ovan är ett exempel på en fjärråtkomstpost. Exemplet ``nyc`` tillåter LDAP-autentiserad åtkomst endast till maskiner i det lokala nätverket (i det här fallet 192.168.1.-nätverket) och endast till nyc-databasen. Beroende på säkerheten i ditt nätverk kommer du att använda mer eller mindre strikta versioner av dessa regler i din produktionskonfiguration.

source: Links
es: Enlaces
sv: Länkar

source: `PostgreSQL Authentication <http://www.postgresql.org/docs/current/static/auth-methods.html>`_
es: `Autenticación en PostgreSQL <http://www.postgresql.org/docs/current/static/auth-methods.html>`_
sv: `PostgreSQL-autentisering <http://www.postgresql.org/docs/current/static/auth-methods.html>`_

source: `PostgreSQL Encrpyption <http://www.postgresql.org/docs/current/static/encryption-options.html>`_
es: `Encriptación en PostgreSQL <http://www.postgresql.org/docs/current/static/encryption-options.html>`_

source: `PostgreSQL SSL Support <http://www.postgresql.org/docs/current/static/libpq-ssl.html>`_
es: `Soporte a SSL en PostgreSQL<http://www.postgresql.org/docs/current/static/libpq-ssl.html>`_
sv: `PostgreSQL SSL-stöd <http://www.postgresql.org/docs/current/static/libpq-ssl.html>`_
