Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/simple_sql_exercises.po
Languages: es, sv

source: Simple SQL Exercises
es: Ejercicios Básicos de SQL
sv: Enkla SQL-övningar

source: Using the ``nyc_census_blocks`` table, answer the following questions (don't peek at the answers!).
es: Utilizando la tabla ``nyc_census_blocks``, responde a las siguientes preguntas (¡no mires las respuestas!).
sv: Använd tabellen ``nyc_census_blocks`` för att besvara följande frågor (titta inte på svaren!).

source: Here is some helpful information to get started. Recall from the :ref:`About Our Data <about_data>` section our ``nyc_census_blocks`` table definition.
es: Aquí tiene información útil para empezar. Recuerda la definición de la tabla ``nyc_census_blocks`` de la sección :ref:`Acerca de nuestros datos<about_data>`.
sv: Här är lite användbar information för att komma igång. Minns från avsnittet :ref:`Om våra data <about_data>` vår tabelldefinition ``nyc_census_blocks``.

source: A 15-digit code that uniquely identifies every census **block**. ("360050001009000")
es: Un código de 15 dígitos que identifica de forma única cada **bloque** del censo. Ej: 360050001009000
sv: En 15-siffrig kod som unikt identifierar varje **block** i en folkräkning. ("360050001009000")

source: Total number of people in the census block
es: Número total de personas en el bloque del censo
sv: Totalt antal personer i folkbokföringsblocket

source: Number of people self-identifying as "white" in the block
es: Número de personas que se auto-identifican como "Blanco/a"
sv: Antal personer som identifierar sig som "vita" i kvarteret

source: Number of people self-identifying as "black" in the block
es: Número de personas que se auto-identifican con "Negro/a"
sv: Antal personer som identifierar sig som "svarta" i kvarteret

source: Number of people self-identifying as "native american" in the block
es: Número de personas que se auto-identifican como "Nativo/a Americano/a"
sv: Antal personer som identifierar sig som "native american" i kvarteret

source: Number of people self-identifying as "asias" in the block
es: Número de personas que se auto-identifican como "Asiático/a"
sv: Antal personer som identifierar sig som "asiater" i blocket

source: Number of people self-identifying with other categories in the block
es: Número de personas que se auto-identifican como otras categorías
sv: Antal personer som identifierar sig med andra kategorier i blocket

source: Number of housing units in the block
es: Número de viviendas en el bloque
sv: Antal bostadsenheter i kvarteret

source: Number of owner-occupied housing units in the block
es: Número de viviendas ocupadas por sus propietarios en el bloque
sv: Antal ägarbebodda bostadsenheter i kvarteret

source: Number of renter-occupied housing units in the block
es: Número de viviendas ocupadas por inquilinos en el bloque
sv: Antal hyresgäster som bor i bostadshus i kvarteret

source: Name of the New York borough. Manhattan, The Bronx, Brooklyn, Staten Island, Queens
es: Nombre del distrito de Nueva York, Manhattan, el Bronx, Brooklyn, Staten Island, Queens
sv: Namn på stadsdel i New York. Manhattan, Bronx, Brooklyn, Staten Island, Queens

source: Polygon boundary of the block
es: Límite del bloque
sv: Polygongräns för blocket

source: And, here are some common SQL aggregation functions you might find useful:
es: Además, aquí tienes algunas funciones de agregación SQL comunes que pueden resultarte útiles:
sv: Och här är några vanliga SQL-aggregeringsfunktioner som du kan ha nytta av:

source: avg() - the average (mean) of the values in a set of records
es: avg() - la media de los valores de un conjunto de registros
sv: avg() - genomsnittet (medelvärdet) av värdena i en uppsättning poster

source: sum() - the sum of the values in a set of records
es: sum() - suma de los valores de un conjunto de registros
sv: sum() - summan av värdena i en uppsättning poster

source: count() - the number of records in a set of records
es: count() - el número de registros de un conjunto de registros
sv: count() - antalet poster i en uppsättning poster

source: Now the questions:
es: Ahora las preguntas:
sv: Nu kommer frågorna:

source: **How many records are in the nyc_streets table?**
es: **¿Cuántos registros hay en la tabla nyc_streets?**
sv: **Hur många poster finns i tabellen nyc_streets?**

source: **How many streets in NYC start with ‘B’?**
es: **¿Cuántas calles de Nueva York empiezan por "B"?**
sv: **Hur många gator i NYC börjar med "B"?**

source: **What is the population of the City of New York?**
es: **¿Cuál es la población de la ciudad de Nueva York?**
sv: **Vad är befolkningen i staden New York?**

source: What is this ``AS``? You can give a table or a column another name by using an alias. Aliases can make queries easier to both write and to read. So instead of our outputted column name as ``sum`` we write it **AS** the more readable ``population``.
es: ¿Qué es eso de ``AS``? Puedes dar otro nombre a una tabla o columna utilizando un alias. Los alias facilitan la escritura y la lectura de las consultas. Así, en lugar de escribir el nombre de nuestra columna como ``suma``, escribiremos ``AS``, más legible ``población``.
sv: Vad är detta "alias"? Du kan ge en tabell eller en kolumn ett annat namn genom att använda ett alias. Alias kan göra frågor enklare att både skriva och läsa. Så istället för att skriva ut kolumnnamnet ``sum`` skriver vi det **AS** som det mer läsbara ``population``.

source: **What is the population of the Bronx?**
es: **¿Cuál es la población del Bronx?**
sv: **Vad är befolkningen i Bronx?**

source: **How many "neighborhoods" are in each borough?**
es: **¿Cuántos barrios hay en cada distrito?**
sv: **Hur många "neighborhoods" finns det i varje stadsdel?**

source: **For each borough, what percentage of the population is white?**
es: **¿Qué porcentaje de población negra hay en cada distrito?**
sv: **För varje stadsdel, hur stor andel av befolkningen är vit?**

source: Function List
es: Lista de funciones
sv: Funktionslista

source: `avg(expression) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL aggregate function that returns the average value of a numeric column.
es: `avg(expresión) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: Función de agregación de PostgreSQL que devuelve la media de una columna numérica.
sv: `avg (uttryck) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL-aggregatfunktion som returnerar medelvärdet för en numerisk kolumn.

source: `count(expression) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL aggregate function that returns the number of records in a set of records.
es: `count(expresión) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: Función de PostgreSQL que devuelve el número de registros en un conjunto de registros.
sv: `räkna(uttryck) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL-aggregeringsfunktion som returnerar antalet poster i en uppsättning poster.

source: `sum(expression) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL aggregate function that returns the sum of records in a set of records.
es: `sum(expresión) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: Función de PostgreSQL que devuelve la suma de los valores de un conjunto de registros.
sv: `sum(uttryck) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL-aggregeringsfunktion som returnerar summan av poster i en uppsättning poster.
