Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/simple_sql.po
Languages: es, sv

source: Simple SQL
es: SQL Básico
sv: Enkel SQL

source: :term:`SQL`, or "Structured Query Language", is a means of asking questions of, and updating data in, relational databases. You have already seen SQL when we created our first database. Recall:
es: :term:`SQL`, o "Lenguaje de consulta estructurado", es un medio para formular preguntas y actualizar datos en bases de datos relacionales. Ya has visto SQL cuando creamos nuestra primera base de datos. Recuerde:
sv: :term:`SQL`, eller "Structured Query Language", är ett sätt att ställa frågor till och uppdatera data i relationsdatabaser. Du har redan sett SQL när vi skapade vår första databas. Kom ihåg det:

source: But that was a question about the database. Now that we've loaded data into our database, let's use SQL to ask questions of the data! For example,
es: Pero ésa era una pregunta sobre la base de datos. Ahora que hemos cargado datos en nuestra base de datos, vamos a utilizar SQL para hacer preguntas a los datos. Por ejemplo,
sv: Men det var en fråga om databasen. Nu när vi har laddat in data i vår databas kan vi använda SQL för att ställa frågor om data! Ett exempel,

source: "What are the names of all the neighborhoods in New York City?"
es: "¿Cómo se llaman los barrios de Nueva York?"
sv: "Vad heter alla stadsdelar i New York City?"

source: Open up the SQL query window in pgAdmin by clicking the "Query Tool" button.
es: Abra la ventana de consulta SQL en pgAdmin haciendo clic en el botón "Herramienta de consulta".
sv: Öppna SQL-frågefönstret i pgAdmin genom att klicka på knappen "Query Tool".

source: then enter the following query in to the query window
es: Luego, introduzca la siguiente consulta en la ventana de consulta
sv: ange sedan följande fråga i frågefönstret

source: and click the **Execute Query** button (the green triangle).
es: y haga clic en el botón **Ejecutar consulta** (el botón Play).
sv: och klicka på knappen **Execute Query** (den gröna triangeln).

source: The query will run for a few (milli)seconds and return the 129 results.
es: La consulta se ejecutará durante unos (mili)segundos y devolverá los 129 resultados.
sv: Frågan körs i några (milli)sekunder och returnerar de 129 resultaten.

source: But what exactly happened here? To understand, let's begin with the four "verbs" of SQL,
es: Pero, ¿qué ha ocurrido exactamente? Para entenderlo, empecemos por los cuatro "verbos" de SQL,
sv: Men vad var det egentligen som hände här? För att förstå det måste vi börja med de fyra "verben" i SQL,

source: ``SELECT``, returns rows in response to a query
es: ``SELECT``, devuelve las filas que cumplen los criterios de una consulta
sv: ``SELECT``, returnerar rader som svar på en fråga

source: ``INSERT``, adds new rows to a table
es: ``INSERT``, añade nuevas filas a una tabla
sv: ``INSERT``, lägger till nya rader i en tabell

source: ``UPDATE``, alters existing rows in a table
es: ``UPDATE``, modifica las filas existentes en una tabla
sv: ``UPDATE``, ändrar befintliga rader i en tabell

source: ``DELETE``, removes rows from a table
es: ``DELETE``, elimina filas de una tabla
sv: ``DELETE``, tar bort rader från en tabell

source: We will be working almost exclusively with ``SELECT`` in order to ask questions of tables using spatial functions.
es: Trabajaremos casi exclusivamente con ``SELECT`` para hacer preguntas a tablas utilizando funciones espaciales.
sv: Vi kommer nästan uteslutande att arbeta med ``SELECT`` för att ställa frågor om tabeller med hjälp av spatiala funktioner.

source: SELECT queries
es: Consultas SELECT
sv: SELECT-frågor

source: A select query is generally of the form::
es: Una consulta SELECT suele tener la forma::
sv: En select-fråga är i allmänhet av formen::

source: For a synopsis of all ``SELECT`` parameters, see the `PostgresSQL documentation <http://www.postgresql.org/docs/current/interactive/sql-select.html>`_.
es: Para una sinopsis de todos los parámetros ``SELECT``, véase la documentación `PostgresSQL <http://www.postgresql.org/docs/current/interactive/sql-select.html>`_.
sv: För en sammanfattning av alla ``SELECT`` parametrar, se `PostgresSQL-dokumentationen <http://www.postgresql.org/docs/current/interactive/sql-select.html>`_.

source: The ``some_columns`` are either column names or functions of column values. The ``some_data_source`` is either a single table, or a composite table created by joining two tables on a key or condition. The ``some_condition`` is a filter that restricts the number of rows to be returned.
es: ``some_columns`` puede ser nombres de columnas o funciones que se aplican a los valores de las columnas . ``some_data_source`` puede ser una tabla o una tabla compuesta a partir de "juntar" dos tablas usando una llave o una condición. ``some_condition`` es un filtro que restringe el número de filas retornadas.
sv: ``some_columns`` är antingen kolumnnamn eller funktioner av kolumnvärden. ``some_data_source`` är antingen en enskild tabell eller en sammansatt tabell som skapats genom att två tabeller sammanfogats med en nyckel eller ett villkor. ``some_condition`` är ett filter som begränsar antalet rader som ska returneras.

source: "What are the names of all the neighborhoods in Brooklyn?"
es: "¿Cuál es el nombre de los barrios de Brooklyn?".
sv: "Vad heter alla stadsdelar i Brooklyn?"

source: We return to our ``nyc_neighborhoods`` table with a filter in hand. The table contains all the neighborhoods in New York, but we only want the ones in Brooklyn.
es: Volvemos a nuestra tabla ``nyc_neighborhoods`` pero utilizando un filtro. La tabla contiene todos los barrios de Nueva York, pero sólo queremos los de Brooklyn.
sv: Vi återvänder till vår tabell ``nyc_neighborhoods`` med ett filter i handen. Tabellen innehåller alla stadsdelar i New York, men vi vill bara ha dem i Brooklyn.

source: The query will run for even fewer (milli)seconds and return the 23 results.
es: La consulta durará aún menos (mili)segundos y devolverá los 23 resultados.
sv: Frågan kommer att köras under ännu färre (milli)sekunder och ge 23 resultat.

source: Sometimes we will need to apply a function to the results of our query. For example,
es: A veces necesitaremos aplicar una función a los resultados de nuestra consulta. Por ejemplo,
sv: Ibland behöver vi tillämpa en funktion på resultatet av vår fråga. Det kan till exempel vara

source: "What is the number of letters in the names of all the neighborhoods in Brooklyn?"
es: "¿Cuántas letras tienen los nombres de cada uno de los barrios de Brooklyn?".
sv: "Vad är antalet bokstäver i namnen på alla stadsdelar i Brooklyn?"

source: Fortunately, PostgreSQL has a string length function, :command:`char_length(string)`.
es: Afortunadamente, PostgreSQL tiene una función que calcula la longitud de una cadena de texto, :command:`char_length(string)`.
sv: Lyckligtvis har PostgreSQL en stränglängdsfunktion, :command:`char_length(string)`.

source: Often, we are less interested in the individual rows than in a statistic that applies to all of them. So knowing the lengths of the neighborhood names might be less interesting than knowing the average length of the names. Functions that take in multiple rows and return a single result are called "aggregate" functions.
es: A menudo, no nos interesan las filas individuales sino una estadística que se aplique a todas ellas. Así, conocer la longitud de los nombres de los barrios puede ser menos interesante que conocer la longitud media de los nombres. Las funciones que toman varias filas y devuelven un único resultado se denominan funciones "agregadas" o de "agregación".
sv: Ofta är vi mindre intresserade av de enskilda raderna än av en statistik som gäller för dem alla. Att veta längden på grannskapsnamnen kan alltså vara mindre intressant än att veta den genomsnittliga längden på namnen. Funktioner som tar in flera rader och returnerar ett enda resultat kallas "aggregerade" funktioner.

source: PostgreSQL has a series of built-in aggregate functions, including the general purpose :command:`avg()` for average values and :command:`stddev()` for standard deviations.
es: PostgreSQL dispone de una serie de funciones de agregación integradas, entre las que se incluyen :command:`avg()` para valores medios y :command:`stddev()` para desviaciones estándar.
sv: PostgreSQL har en serie inbyggda aggregerade funktioner, inklusive det allmänna syftet :command:`avg()` för medelvärden och :command:`stddev()` för standardavvikelser.

source: "What is the average number of letters and standard deviation of number of letters in the names of all the neighborhoods in Brooklyn?"
es: "¿Cuál es la media estándar de la longitud de letras en los nombres de todos los barrios de Brooklyn?".
sv: "Vad är det genomsnittliga antalet bokstäver och standardavvikelsen för antalet bokstäver i namnen på alla stadsdelar i Brooklyn?"

source: The aggregate functions in our last example were applied to every row in the result set. What if we want the summaries to be carried out over smaller groups within the overall result set? For that we add a ``GROUP BY`` clause. Aggregate functions often need an added ``GROUP BY`` statement to group the result-set by one or more columns.
es: Las funciones de agregación de nuestro último ejemplo se aplicaron a todas las filas del conjunto de resultados. ¿Qué ocurre si queremos que los resúmenes se realicen sobre grupos más pequeños dentro del conjunto de resultados global? Para ello añadimos una cláusula ``GROUP BY``. Las funciones agregadas a menudo necesitan una sentencia ``GROUP BY`` añadida para agrupar el conjunto de resultados por una o más columnas.
sv: De aggregerade funktionerna i vårt förra exempel tillämpades på varje rad i resultatuppsättningen. Vad händer om vi vill att sammanfattningarna ska utföras över mindre grupper inom den totala resultatuppsättningen? För det lägger vi till en ``GROUP BY``-klausul. Aggregerade funktioner behöver ofta en extra ``GROUP BY``-sats för att gruppera resultatuppsättningen efter en eller flera kolumner.

source: "What is the average number of letters in the names of all the neighborhoods in New York City, reported by borough?"
es: "¿Cuál es la media de la cantidad de letras en los nombres de todos los barrios de Nueva York, desglosado por distritos?"
sv: "Vad är det genomsnittliga antalet bokstäver i namnen på alla stadsdelar i New York City, redovisat per stadsdel?"

source: We include the ``boroname`` column in the output result so we can determine which statistic applies to which borough. In an aggregate query, you can only output columns that are either (a) members of the grouping clause or (b) aggregate functions.
es: Incluimos la columna ``boroname`` en el resultado de salida para poder determinar qué estadística se aplica a qué distrito. En una consulta agregada, sólo se pueden mostrar columnas que sean (a) miembros de la cláusula de agrupación o (b) funciones agregadas.
sv: Vi inkluderar kolumnen ``boroname`` i utdataresultatet så att vi kan avgöra vilken statistik som gäller för vilken stadsdel. I en aggregerad fråga kan du bara mata ut kolumner som antingen är (a) medlemmar i grupperingsklausulen eller (b) aggregerade funktioner.

source: Function List
es: Lista de funciones
sv: Funktionslista

source: `avg(expression) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL aggregate function that returns the average value of a numeric column.
es: `avg(expresión) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: Función de agregación de PostgreSQL que devuelve la media de una columna numérica.
sv: `avg (uttryck) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-TABLE>`_: PostgreSQL-aggregatfunktion som returnerar medelvärdet för en numerisk kolumn.

source: `char_length(string) <http://www.postgresql.org/docs/current/static/functions-string.html>`_: PostgreSQL string function that returns the number of character in a string.
es: `char_length(cadena) <http://www.postgresql.org/docs/current/static/functions-string.html>`_: Función de PostgreSQL que devuelve el número de caracteres de una cadena.
sv: `char_length (sträng) <http://www.postgresql.org/docs/current/static/functions-string.html>`_: PostgreSQL-strängfunktion som returnerar antalet tecken i en sträng.

source: `stddev(expression) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-STATISTICS-TABLE>`_: PostgreSQL aggregate function that returns the standard deviation of input values.
es: `stddev(expresión) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-STATISTICS-TABLE>`_: Función de agregación de PostgreSQL que devuelve la desviación estándar de los valores de entrada.
sv: `stddev(uttryck) <http://www.postgresql.org/docs/current/static/functions-aggregate.html#FUNCTIONS-AGGREGATE-STATISTICS-TABLE>`_: PostgreSQL-aggregatfunktion som returnerar standardavvikelsen för ingångsvärden.
