Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/spatial_relationships_exercises.po
Languages: sv

source: Spatial Relationships Exercises
sv: Övningar för spatiala relationer

source: Here's a reminder of the functions we saw in the last section. They should be useful for the exercises!
sv: Här kommer en påminnelse om de funktioner som vi såg i förra avsnittet. De bör vara användbara för övningarna!

source: :command:`sum(expression)` aggregate to return a sum for a set of records
sv: :command:`sum(uttryck)` aggregat för att returnera en summa för en uppsättning poster

source: :command:`count(expression)` aggregate to return the size of a set of records
sv: :command:`count(uttryck)` aggregat för att returnera storleken på en uppsättning poster

source: :command:`ST_Contains(geometry A, geometry B)` returns true if geometry A contains geometry B
sv: :command:`ST_Contains(geometry A, geometry B)` returnerar sant om geometri A innehåller geometri B

source: :command:`ST_Crosses(geometry A, geometry B)` returns true if geometry A crosses geometry B
sv: :command:`ST_Crosses(geometry A, geometry B)` returnerar sant om geometri A korsar geometri B

source: :command:`ST_Disjoint(geometry A , geometry B)` returns true if the geometries do not "spatially intersect"
sv: :command:`ST_Disjoint(geometri A , geometri B)` returnerar sant om geometrierna inte "korsar varandra spatialt"

source: :command:`ST_Distance(geometry A, geometry B)` returns the minimum distance between geometry A and geometry B
sv: :command:`ST_Distance(geometry A, geometry B)` returnerar det minsta avståndet mellan geometri A och geometri B

source: :command:`ST_DWithin(geometry A, geometry B, radius)` returns true if geometry A is radius distance or less from geometry B
sv: :command:`ST_DWithin(geometry A, geometry B, radius)` returnerar true om geometri A ligger på radieavstånd eller mindre från geometri B

source: :command:`ST_Equals(geometry A, geometry B)` returns true if geometry A is the same as geometry B
sv: :command:`ST_Equals(geometri A, geometri B)` returnerar sant om geometri A är samma sak som geometri B

source: :command:`ST_Intersects(geometry A, geometry B)` returns true if geometry A intersects geometry B
sv: :command:`ST_Intersects(geometry A, geometry B)` returnerar sant om geometri A skär geometri B

source: :command:`ST_Overlaps(geometry A, geometry B)` returns true if geometry A and geometry B share space, but are not completely contained by each other.
sv: :command:`ST_Overlaps(geometry A, geometry B)` returnerar true om geometri A och geometri B delar utrymme, men inte är helt inneslutna av varandra.

source: :command:`ST_Touches(geometry A, geometry B)` returns true if the boundary of geometry A touches geometry B
sv: :command:`ST_Touches(geometry A, geometry B)` returnerar sant om gränsen för geometri A berör geometri B

source: :command:`ST_Within(geometry A, geometry B)` returns true if geometry A is within geometry B
sv: :command:`ST_Within(geometri A, geometri B)` returnerar sant om geometri A ligger inom geometri B

source: Also remember the tables we have available:
sv: Tänk också på de tabeller vi har tillgängliga:

source: Exercises
sv: Övningar

source: **What is the geometry value for the street named 'Atlantic Commons'?**
sv: **Vad är geometrivärdet för gatan med namnet "Atlantic Commons"?**

source: **What neighborhood and borough is Atlantic Commons in?**
sv: **Vilket område och vilken stadsdel ligger Atlantic Commons i?**

source: "Hey, why did you change from a 'MULTILINESTRING' to a 'LINESTRING'?" Spatially they describe the same shape, so going from a single-item multi-geometry to a singleton saves a few keystrokes.
sv: "Varför bytte du från en 'MULTILINESTRING' till en 'LINESTRING'?" Spatialt beskriver de samma form, så att gå från en multi-geometri med ett objekt till en singleton sparar några tangenttryckningar.

source: More importantly, we also rounded the coordinates to make them easier to read, which does actually change results: we couldn't use the ST_Touches() predicate to find out which roads join Atlantic Commons, because the coordinates are not exactly the same anymore.
sv: Ännu viktigare är att vi också avrundade koordinaterna för att göra dem mer lättlästa, vilket faktiskt förändrar resultaten: vi kunde inte använda ST_Touches()-predikatet för att ta reda på vilka vägar som ansluter till Atlantic Commons, eftersom koordinaterna inte är exakt desamma längre.

source: **What streets does Atlantic Commons join with?**
sv: **Vilka gator ansluter Atlantic Commons till?**

source: **Approximately how many people live on (within 50 meters of) Atlantic Commons?**
sv: **Ungefär hur många människor bor på (inom 50 meter från) Atlantic Commons?**
