Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/spatial_relationships.po
Languages: es, sv, uk, zh_hans

source: `ST_Disjoint(geometry A , geometry B) <http://postgis.net/docs/ST_Disjoint.html>`_: Returns TRUE if the Geometries do not "spatially intersect" - if they do not share any space together.
es: `ST_Disjoint(geometry A , geometry B) <http://postgis.net/docs/ST_Disjoint.html>`_: Devuelve TRUE si las geometrías no "intersectan espacialmente", es decir, si no comparten ningún espacio.
sv: `ST_Disjoint(geometri A , geometri B) <http://postgis.net/docs/ST_Disjoint.html>`_: Returnerar SANT om geometrierna inte "korsar varandra spatialt" - om de inte delar något utrymme tillsammans.
uk: `ST_Disjoint(geometry A , geometry B) <http://postgis.net/docs/ST_Disjoint.html>`_: Повертає TRUE, якщо геометрії не «перетинаються в просторі» — якщо вони не мають спільного простору.
zh_hans: `ST_Disjoint(geometry A , geometry B) <http://postgis.net/docs/ST_Disjoint.html>`_: 若两个几何图形不存在任何空间交集（即完全不共享任何空间区域），则返回 TRUE。

source: `ST_Distance(geometry A, geometry B) <http://postgis.net/docs/ST_Distance.html>`_: Returns the 2-dimensional cartesian minimum distance (based on spatial ref) between two geometries in projected units.
es: `ST_Distance(geometry A, geometry B) <http://postgis.net/docs/ST_Distance.html>`_: Devuelve la distancia cartesiana bidimensional mínima (basada en la referencia espacial) entre dos geometrías en unidades proyectadas.
sv: `ST_Distance(geometri A, geometri B) <http://postgis.net/docs/ST_Distance.html>`_: Returnerar det 2-dimensionella cartesiska minimiavståndet (baserat på spatial ref) mellan två geometrier i projicerade enheter.
uk: `ST_Distance(geometry A, geometry B) <http://postgis.net/docs/ST_Distance.html>`_: Повертає двовимірну декартову мінімальну відстань (на основі просторової референції) між двома геометріями в проекційних одиницях.
zh_hans: `ST_Distance(geometry A, geometry B) <http://postgis.net/docs/ST_Distance.html>`_：返回两个几何图形在二维笛卡尔坐标系下的最小投影距离（基于空间参考系统），单位为投影坐标单位。

source: `ST_DWithin(geometry A, geometry B, radius) <http://postgis.net/docs/ST_DWithin.html>`_: Returns true if the geometries are within the specified distance (radius) of one another.
es: `ST_DWithin(geometry A, geometry B, radius) <http://postgis.net/docs/ST_DWithin.html>`_: Devuelve true si las geometrías están dentro de la distancia especificada (radio) una de la otra.
sv: `ST_DWithin(geometri A, geometri B, radie) <http://postgis.net/docs/ST_DWithin.html>`_: Returnerar sant om geometrierna ligger inom det angivna avståndet (radien) från varandra.
uk: `ST_DWithin(geometry A, geometry B, radius) <http://postgis.net/docs/ST_DWithin.html>`_: Повертає true, якщо геометрії знаходяться на відстані (радіусі) одна від одної, що не перевищує задане значення.
zh_hans: `ST_DWithin(geometry A, geometry B, radius) <http://postgis.net/docs/ST_DWithin.html>`_：若两几何图形之间的最短距离小于等于指定半径值，则返回 true，否则返回 false。

source: `ST_Equals(geometry A, geometry B) <http://postgis.net/docs/ST_Equals.html>`_: Returns true if the given geometries represent the same geometry. Directionality is ignored.
es: `ST_Equals(geometry A, geometry B) <http://postgis.net/docs/ST_Equals.html>`_: Devuelve true si las geometrías dadas representan la misma geometría. Se ignora la direccionalidad.
sv: `ST_Equals(geometri A, geometri B) <http://postgis.net/docs/ST_Equals.html>`_: Returnerar sant om de givna geometrierna representerar samma geometri. Riktning ignoreras.
uk: `ST_Equals(geometry A, geometry B) <http://postgis.net/docs/ST_Equals.html>`_: Повертає true, якщо задані геометрії представляють одну і ту ж геометрію. Напрямок ігнорується.
zh_hans: `ST_Equals(geometry A, geometry B) <http://postgis.net/docs/ST_Equals.html>`_：当两个几何图形几何等价时返回 true（忽略顶点顺序和方向）。

source: `ST_Intersects(geometry A, geometry B) <http://postgis.net/docs/ST_Intersects.html>`_: Returns TRUE if the Geometries/Geography "spatially intersect" - (share any portion of space) and FALSE if they don't (they are Disjoint).
es: `ST_Intersects(geometry A, geometry B) <http://postgis.net/docs/ST_Intersects.html>`_: Devuelve TRUE si las geometrías/geografías "intersectan espacialmente" (comparten alguna porción del espacio) y FALSE si no lo hacen (son disjuntas).
sv: `ST_Intersects(geometri A, geometri B) <http://postgis.net/docs/ST_Intersects.html>`_: Returnerar TRUE om geometrierna/geografin "spatialt korsar varandra" - (delar någon del av utrymmet) och FALSE om de inte gör det (de är disjunkta).
uk: `ST_Intersects(geometry A, geometry B) <http://postgis.net/docs/ST_Intersects.html>`_: Повертає TRUE, якщо геометрії/географія «просторово перетинаються» (мають спільну частину простору), і FALSE, якщо вони не перетинаються (вони роз'єднані).
zh_hans: `ST_Intersects(geometry A, geometry B) <http://postgis.net/docs/ST_Intersects.html>`_：当几何图形/地理要素"存在空间交集"（即共享任意空间区域）时返回 TRUE，否则（两者相离时）返回 FALSE。

source: `ST_Overlaps(geometry A, geometry B) <http://postgis.net/docs/ST_Overlaps.html>`_: Returns TRUE if the Geometries share space, are of the same dimension, but are not completely contained by each other.
es: `ST_Overlaps(geometry A, geometry B) <http://postgis.net/docs/ST_Overlaps.html>`_: Devuelve TRUE si las geometrías comparten espacio, son de la misma dimensión, pero no están completamente contenidas una por la otra.
sv: `ST_Overlaps(geometri A, geometri B) <http://postgis.net/docs/ST_Overlaps.html>`_: Returnerar SANT om geometrierna delar utrymme, har samma dimension, men inte är helt inneslutna av varandra.
uk: `ST_Overlaps(geometry A, geometry B) <http://postgis.net/docs/ST_Overlaps.html>`_: Повертає TRUE, якщо геометрії мають спільний простір, мають однаковий розмір, але не повністю містяться одна в одній.
zh_hans: `ST_Overlaps(geometry A, geometry B) <http://postgis.net/docs/ST_Overlaps.html>`_：当两个几何图形空间重叠（具有相同维度且互不完全包含）时返回 TRUE。

source: `ST_Touches(geometry A, geometry B) <http://postgis.net/docs/ST_Touches.html>`_: Returns TRUE if the geometries have at least one point in common, but their interiors do not intersect.
es: `ST_Touches(geometry A, geometry B) <http://postgis.net/docs/ST_Touches.html>`_: Devuelve TRUE si las geometrías tienen al menos un punto en común, pero sus interiores no se intersectan.
sv: `ST_Touches(geometri A, geometri B) <http://postgis.net/docs/ST_Touches.html>`_: Returnerar SANT om geometrierna har minst en punkt gemensamt, men deras interiörer inte korsar varandra.
uk: `ST_Touches(geometry A, geometry B) <http://postgis.net/docs/ST_Touches.html>`_: Повертає TRUE, якщо геометрії мають принаймні одну спільну точку, але їхні внутрішні частини не перетинаються.
zh_hans: `ST_Touches(geometry A, geometry B) <http://postgis.net/docs/ST_Touches.html>`_：如果两个geometry 至少有一个公共点，但它们的内部不相交，则返回 TRUE。

source: `ST_Within(geometry A , geometry B) <http://postgis.net/docs/ST_Within.html>`_: Returns true if the geometry A is completely inside geometry B
es: `ST_Within(geometry A , geometry B) <http://postgis.net/docs/ST_Within.html>`_: Devuelve true si la geometría A está completamente dentro de la geometría B
sv: `ST_Within(geometri A , geometri B) <http://postgis.net/docs/ST_Within.html>`_: Returnerar sant om geometrin A är helt inuti geometrin B
uk: `ST_Within(geometry A , geometry B) <http://postgis.net/docs/ST_Within.html>`_: Повертає true, якщо геометрія A повністю знаходиться всередині геометрії B
zh_hans: `ST_Within(geometry A , geometry B) <http://postgis.net/docs/ST_Within.html>`_：如果geometry A 完全位于 geometry B 内部，则返回 TRUE
