Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/spatial_relationships.po
Languages: es, sv, uk, zh_hans

source: Spatial Relationships
es: Relaciones Espaciales
sv: Spatiala relationer
uk: Просторові відносини
zh_hans: 空间关系

source: So far we have only used spatial functions that measure (:command:`ST_Area`, :command:`ST_Length`), serialize (:command:`ST_GeomFromText`) or deserialize (:command:`ST_AsGML`) geometries. What these functions have in common is that they only work on one geometry at a time.
es: Hasta ahora solo hemos usado funciones espaciales que miden (:command:`ST_Area`, :command:`ST_Length`), serializan (:command:`ST_GeomFromText`) o deserializan (:command:`ST_AsGML`) geometrías. Lo que estas funciones tienen en común es que solo trabajan con una geometría a la vez.
sv: Hittills har vi bara använt spatiala funktioner som mäter (:command:`ST_Area`, :command:`ST_Length`), serialiserar (:command:`ST_GeomFromText`) eller deserialiserar (:command:`ST_AsGML`) geometrier. Gemensamt för dessa funktioner är att de bara fungerar på en geometri i taget.
uk: До цього часу ми використовували лише просторові функції, які вимірюють (:command:`ST_Area`, :command:`ST_Length`), серіалізують (:command:`ST_GeomFromText`) або десеріалізують (:command:`ST_AsGML`) геометрії. Спільним для цих функцій є те, що вони працюють лише з однією геометрією за раз.
zh_hans: 目前我们仅使用了针对单一几何体的空间函数，包括测量类（如 :command:ST_Area、:command:ST_Length）、序列化（:command:ST_GeomFromText）及反序列化（:command:ST_AsGML）函数。这些函数的共同特点是每次仅能处理单个几何对象。

source: Spatial databases are powerful because they not only store geometry, they also have the ability to compare *relationships between geometries*.
es: Las bases de datos espaciales son potentes porque no solo almacenan geometrías, también tienen la capacidad de comparar *relaciones entre geometrías*.
sv: Spatiala databaser är kraftfulla eftersom de inte bara lagrar geometri, utan också har möjlighet att jämföra *relationer mellan geometrier*.
uk: Просторові бази даних є потужними, оскільки вони не тільки зберігають геометрію, але й мають можливість порівнювати *відносини між геометріями*.
zh_hans: 空间数据库的强大之处不仅在于存储几何数据，更在于其能够分析 *几何体之间的空间关系*。

source: Questions like "Which are the closest bike racks to a park?" or "Where are the intersections of subway lines and streets?" can only be answered by comparing geometries representing the bike racks, streets, and subway lines.
es: Preguntas como "¿Cuáles son los parqueaderos de bicicletas más cercanos a un parque?" o "¿Dónde están las intersecciones de líneas de metro y calles?" solo pueden responderse comparando geometrías que representan los parqueaderos de bicicletas, las calles y las líneas de metro.
sv: Frågor som "Vilka är de närmaste cykelställen till en park?" eller "Var är korsningarna mellan tunnelbanelinjer och gator?" kan bara besvaras genom att jämföra geometrier som representerar cykelställen, gator och tunnelbanelinjer.
uk: На такі питання, як «Де найближчі велосипедні стоянки до парку?» або «Де перетинаються лінії метро та вулиці?», можна відповісти лише порівнявши геометрію велосипедних стійок, вулиць та ліній метро.
zh_hans: 诸如"距离公园最近的自行车架在哪里？"或"地铁线路与街道的交叉点有哪些？"等问题，必须通过比对代表自行车架、街道和地铁线路的几何图形才能得出答案。

source: The OGC standard defines the following set of methods to compare geometries.
es: El estándar OGC define el siguiente conjunto de métodos para comparar geometrías.
sv: OGC-standarden definierar följande uppsättning metoder för att jämföra geometrier.
uk: Стандарт OGC визначає наступний набір методів для порівняння геометрій.
zh_hans: OGC 标准定义了下述几何图形比对方法集。

source: :command:`ST_Equals(geometry A, geometry B)` tests the spatial equality of two geometries.
sv: :command:`ST_Equals(geometry A, geometry B)` testar den spatiala likheten mellan två geometrier.
uk: :command:`ST_Equals(geometry A, geometry B)`перевіряє просторову рівність двох геометрій.
zh_hans: :command:`ST_Equals(geometry A, geometry B)` 用于检测两个几何图形的拓扑相等性。

source: ST_Equals returns TRUE if two geometries of the same type have identical x,y coordinate values, i.e. if the second shape is equal (identical) to the first shape.
es: ST_Equals devuelve TRUE si dos geometrías del mismo tipo tienen valores de coordenadas x,y idénticos, es decir, si la segunda forma es igual (idéntica) a la primera.
sv: ST_Equals returnerar TRUE om två geometrier av samma typ har identiska x,y-koordinatvärden, dvs. om den andra formen är lika (identisk) med den första formen.
uk: ST_Equals повертає TRUE, якщо дві геометрії одного типу мають однакові значення координат x, y, тобто якщо друга фігура дорівнює (ідентична) першій фігурі.
zh_hans: 当两个同类型几何图形的(x,y)坐标值完全一致时，:command:ST_Equals 将返回 TRUE，即判定两个图形拓扑相等（空间位置与形状完全重合）。

source: First, let's retrieve a representation of a point from our ``nyc_subway_stations`` table. We'll take just the entry for 'Broad St'.
es: Primero, recuperemos una representación de un punto de nuestra tabla ``nyc_subway_stations``. Tomaremos solo la entrada de 'Broad St'.
sv: Låt oss först hämta en representation av en punkt från vår tabell ``nyc_subway_stations``. Vi tar bara posten för "Broad St".
uk: Спочатку витягнемо представлення точки з таблиці ``nyc_subway_stations``. Візьмемо тільки запис для “Broad St”.
zh_hans: 首先，我们从``nyc_subway_stations`` 表中提取 'Broad St' 站点的几何图形表示。

source: Then, plug the geometry representation back into an :command:`ST_Equals` test:
es: Luego, volvemos a usar la representación de la geometría en una prueba :command:`ST_Equals`:
sv: Sedan kopplar du tillbaka geometrirepresentationen till ett :command:`ST_Equals`-test:
uk: Потім додайте геометричне представлення назад у :command:`ST_Equals`:
zh_hans: 随后，将几何图形表示重新代入 :command:`ST_Equals` 函数进行测试：

source: The representation of the point was not very human readable (``0101000020266900000EEBD4CF27CF2141BC17D69516315141``) but it was an exact representation of the coordinate values. For a test like equality, using the exact coordinates is necessary.
es: La representación del punto no era muy legible para humanos (``0101000020266900000EEBD4CF27CF2141BC17D69516315141``) pero era una representación exacta de los valores de coordenadas. Para una prueba como la de igualdad, usar las coordenadas exactas es necesario.
sv: Representationen av punkten var inte särskilt läsbar för människor (``0101000020266900000EEBD4CF27CF2141BC17D69516315141``) men det var en exakt representation av koordinatvärdena. För ett test som jämlikhet är det nödvändigt att använda de exakta koordinaterna.
uk: Представлення точки не було дуже зрозумілим для людини (``0101000020266900000EEBD4CF27CF2141BC17D69516315141``), але це було точне представлення значень координат. Для тесту на рівність необхідно використовувати точні координати.
zh_hans: 该点的几何表示（``0101000020266900000EEBD4CF27CF2141BC17D69516315141``）虽不易人工解读，但完整精确地记录了坐标值。在进行相等性测试时，必须使用此类精确坐标表示。

source: ST_Intersects, ST_Disjoint, ST_Crosses and ST_Overlaps
es: ST_Intersects, ST_Disjoint, ST_Crosses y ST_Overlaps
sv: ST_Intersects, ST_Disjoint, ST_Crosses och ST_Overlaps

source: :command:`ST_Intersects`, :command:`ST_Crosses`, and :command:`ST_Overlaps` test whether the interiors of the geometries intersect.
es: :command:`ST_Intersects`, :command:`ST_Crosses` y :command:`ST_Overlaps` prueban si los interiores de las geometrías se intersectan.
sv: :command:`ST_Intersects`, :command:`ST_Crosses` och :command:`ST_Overlaps` testar om geometriernas inre delar skär varandra.
uk: :command:`ST_Intersects`, :command:`ST_Crosses`, та :command:`ST_Overlaps` перевірити, чи перетинаються внутрішні частини геометрій.
zh_hans: :command:`ST_Intersects`、:command:`ST_Crosses`和 :command:`ST_Overlaps` 用于检测几何图形内部区域是否发生相交。

source: :command:`ST_Intersects(geometry A, geometry B)` returns t (TRUE) if the two shapes have any space in common, i.e., if their boundaries or interiors intersect.
es: :command:`ST_Intersects(geometry A, geometry B)` devuelve t (TRUE) si las dos formas tienen algún espacio en común, es decir, si sus límites o interiores se intersectan.
sv: :command:`ST_Intersects(geometry A, geometry B)` returnerar t (TRUE) om de två formerna har något gemensamt utrymme, dvs. om deras gränser eller inre skär varandra.
uk: :command:`ST_Intersects(geometry A, geometry B)` повертає t (TRUE), якщо дві фігури мають спільний простір, тобто якщо їхні межі або внутрішні частини перетинаються.
zh_hans: :command:`ST_Intersects(geometry A, geometry B)` 当两个图形存在任意空间交集时返回 t（TRUE），即边界或内部发生相交即视为满足条件。

source: The opposite of ST_Intersects is :command:`ST_Disjoint(geometry A , geometry B)`. If two geometries are disjoint, they do not intersect, and vice-versa. In fact, it is often more efficient to test "not intersects" than to test "disjoint" because the intersects tests can be spatially indexed, while the disjoint test cannot.
es: El opuesto de ST_Intersects es :command:`ST_Disjoint(geometry A , geometry B)`. Si dos geometrías son disjuntas, no se intersectan, y viceversa. De hecho, a menudo es más eficiente probar "no intersecta" que probar "disjunta" porque las pruebas de intersección pueden estar indexadas espacialmente, mientras que la prueba de disjunción no.
sv: Motsatsen till ST_Intersects är :command:`ST_Disjoint(geometry A , geometry B)`. Om två geometrier är disjunkta skär de inte varandra, och vice versa. I själva verket är det ofta effektivare att testa "not intersects" än att testa "disjoint" eftersom intersects-testerna kan indexeras spatialt, medan disjoint-testet inte kan det.
uk: Протилежністю ST_Intersects є :command:`ST_Disjoint(geometry A , geometry B)`. Якщо дві геометрії є роз'єднаними, вони не перетинаються, і навпаки. Насправді, часто ефективніше перевіряти «не перетинається», ніж «роз'єднане», оскільки перевірки перетину можуть бути індексовані просторово, а перевірки роз'єднання — ні.
zh_hans: 与 :command:ST_Intersects 相对的是 :command:`ST_Disjoint(geometry A , geometry B)`。若两个几何图形互不相交(disjoint)，则它们不存在任何空间交集，反之亦然。实际上，测试"不相交"(not intersects)通常比直接测试"相离"(disjoint)更高效——因为相交测试可利用空间索引优化，而相离测试则无法利用索引。

source: For multipoint/polygon, multipoint/linestring, linestring/linestring, linestring/polygon, and linestring/multipolygon comparisons, :command:`ST_Crosses(geometry A, geometry B)` returns t (TRUE) if the intersection results in a geometry whose dimension is one less than the maximum dimension of the two source geometries and the intersection set is interior to both source geometries.
es: Para comparaciones multipunto/polígono, multipunto/linestring, linestring/linestring, linestring/polígono y linestring/multipolígono, :command:`ST_Crosses(geometry A, geometry B)` devuelve t (TRUE) si la intersección da como resultado una geometría cuya dimensión es una menos que la dimensión máxima de las dos geometrías de origen y el conjunto de intersección está en el interior de ambas geometrías de origen.
sv: För jämförelser av multipunkt/polygon, multipunkt/linjestring, linjestring/linjestring, linjestring/polygon och linjestring/multipolygon returnerar :command:`ST_Crosses(geometry A, geometry B)` t (TRUE) om skärningen resulterar i en geometri vars dimension är ett mindre än den maximala dimensionen för de två källgeometrierna och skärningsmängden är inre i båda källgeometrierna.
uk: Для порівняння багатоточкового/багатокутного, багатоточкового/лінійного, лінійного/лінійного, лінійного/багатокутного та лінійного/багатокутного: :command:`ST_Crosses(geometry A, geometry B)` повертає t (TRUE), якщо перетин дає геометрію, розмір якої на один менше, ніж максимальний розмір двох вихідних геометрій, а множина перетину знаходиться всередині обох вихідних геометрій.
zh_hans: :command:`ST_Crosses(geometry A, geometry B)` 用于以下几何类型组合的比对：多点/多边形、多点/线串、线串/线串、线串/多边形、线串/多多边形。当同时满足：(1) 交集结果的几何维度比两个源几何的最大维度小1；(2) 该交集同时位于两个源几何内部时，函数返回 TRUE。

source: :command:`ST_Overlaps(geometry A, geometry B)` compares two geometries of the same dimension and returns TRUE if their intersection set results in a geometry different from both but of the same dimension.
es: :command:`ST_Overlaps(geometry A, geometry B)` compara dos geometrías de la misma dimensión y devuelve TRUE si su conjunto de intersección da como resultado una geometría diferente de ambas pero de la misma dimensión.
sv: :command:`ST_Overlaps(geometry A, geometry B)` jämför två geometrier med samma dimension och returnerar TRUE om deras korsningspunkt resulterar i en geometri som skiljer sig från båda men som har samma dimension.
uk: :команда:`ST_Overlaps(geometry A, geometry B)` порівнює дві геометрії однакового розміру і повертає TRUE, якщо їх перетин дає геометрію, відмінну від обох, але однакового розміру.
zh_hans: :command:`ST_Overlaps(geometry A, geometry B)` 用于比对两个同维度几何图形，当满足以下条件时返回 TRUE。

source: Let's take our Broad Street subway station and determine its neighborhood using the :command:`ST_Intersects` function:
es: Tomemos nuestra estación de metro Broad Street y determinemos su vecindario usando la función :command:`ST_Intersects`:
sv: Låt oss ta vår tunnelbanestation på Broad Street och bestämma dess grannskap med hjälp av funktionen :command:`ST_Intersects`:
uk: Візьмемо станцію метро Broad Street і визначимо її околиці за допомогою функції :command:`ST_Intersects`:
zh_hans: 以下是通过 :command:`ST_Intersects`函数确定「Broad Street」地铁站所属行政辖区的示例：

source: :command:`ST_Touches` tests whether two geometries touch at their boundaries, but do not intersect in their interiors
es: :command:`ST_Touches` prueba si dos geometrías se tocan en sus límites, pero no se intersectan en sus interiores
sv: :command:`ST_Touches` testar om två geometrier rör vid varandra vid sina gränser, men inte skär varandra i sina inre delar
uk: :command:`ST_Touches` перевіряє, чи дві геометрії стикаються на своїх межах, але не перетинаються всередині
zh_hans: :command:`ST_Touches`用于检测两个几何图形是否边界接触但内部无交集

source: :command:`ST_Touches(geometry A, geometry B)` returns TRUE if either of the geometries' boundaries intersect or if only one of the geometry's interiors intersects the other's boundary.
es: :command:`ST_Touches(geometry A, geometry B)` devuelve TRUE si los límites de cualquiera de las geometrías se intersectan o si solo el interior de una de las geometrías intersecta el límite de la otra.
sv: :command:`ST_Touches(geometry A, geometry B)` returnerar TRUE om någon av geometriernas gränser skär varandra eller om endast en av geometriernas inre delar skär den andras gräns.
uk: :команда:`ST_Touches(geometry A, geometry B)` повертає TRUE, якщо межі будь-якої з геометрій перетинаються або якщо тільки одна з внутрішніх частин геометрії перетинається з межею іншої.
zh_hans: :command:`ST_Touches(geometry A, geometry B)` 当满足以下任一条件时返回 TRUE：两个几何图形的边界存在交集；仅其中一个几何图形的内部与另一个图形的边界相交。

source: ST_Within and ST_Contains
es: ST_Within y ST_Contains
sv: ST_Within och ST_Contains
uk: ST_Within та ST_Contains
zh_hans: ST_Within 和 ST_Contains

source: :command:`ST_Within` and :command:`ST_Contains` test whether one geometry is fully within the other.
es: :command:`ST_Within` y :command:`ST_Contains` prueban si una geometría está completamente dentro de la otra.
sv: :command:`ST_Within` och :command:`ST_Contains` testar om en geometri är helt inom den andra.
uk: :command:`ST_Within` та :command:`ST_Contains` перевіряють, чи одна геометрія повністю знаходиться всередині іншої.
zh_hans: :command:`ST_Within` 与 :command:`ST_Contains` 用于检测两个几何图形之间的完全包含关系。

source: :command:`ST_Within(geometry A , geometry B)` returns TRUE if the first geometry is completely within the second geometry. ST_Within tests for the exact opposite result of ST_Contains.
es: :command:`ST_Within(geometry A , geometry B)` devuelve TRUE si la primera geometría está completamente dentro de la segunda geometría. ST_Within prueba exactamente el resultado opuesto de ST_Contains.
sv: :command:`ST_Within(geometry A , geometry B)` returnerar TRUE om den första geometrin är helt inom den andra geometrin. ST_Within testar för det exakt motsatta resultatet av ST_Contains.
uk: :команда:`ST_Within(геометрія A , геометрія B)` повертає TRUE, якщо перша геометрія повністю знаходиться всередині другої геометрії. ST_Within перевіряє результат, який є точно протилежним до ST_Contains.
zh_hans: :command:`ST_Within(geometry A , geometry B)` 当第一个几何图形完全包含于第二个几何图形时返回 TRUE。该函数与 :command:ST_Contains 的检测结果互为逆反关系。

source: :command:`ST_Contains(geometry A, geometry B)` returns TRUE if the second geometry is completely contained by the first geometry.
es: :command:`ST_Contains(geometry A, geometry B)` devuelve TRUE si la segunda geometría está completamente contenida por la primera geometría.
sv: :command:`ST_Contains(geometry A, geometry B)` returnerar TRUE om den andra geometrin är helt innesluten av den första geometrin.
uk: :команда:`ST_Contains(geometry A, geometry B)` повертає TRUE, якщо друга геометрія повністю міститься в першій геометрії.
zh_hans: :command:`ST_Contains(geometry A, geometry B)`当第二个几何图形完全被包含于第一个几何图形内部时返回 TRUE。

source: ST_Distance and ST_DWithin
es: ST_Distance y ST_DWithin
sv: ST_Distance och ST_DWithin
uk: ST_Distance та ST_DWithin
zh_hans: ST_Distance 和 ST_DWithin

source: An extremely common GIS question is "find all the stuff within distance X of this other stuff".
es: Una pregunta de SIG extremadamente común es "encontrar todas las cosas dentro de la distancia X de esta otra cosa".
sv: En mycket vanlig GIS-fråga är "hitta alla saker inom avstånd X från de här andra sakerna".
uk: Дуже поширеним питанням у сфері ГІС є «знайти всі об'єкти, що знаходяться на відстані X від цього об'єкта».
zh_hans: GIS 领域中一个极其常见的问题是："找出与指定对象距离在 X 范围内的所有要素"。

source: The :command:`ST_Distance(geometry A, geometry B)` calculates the *shortest* distance between two geometries and returns it as a float. This is useful for actually reporting back the distance between objects.
es: La función :command:`ST_Distance(geometry A, geometry B)` calcula la distancia *más corta* entre dos geometrías y la devuelve como un número de punto flotante. Esto es útil para informar realmente la distancia entre objetos.
sv: :command:`ST_Distance(geometry A, geometry B)` beräknar det *kortaste* avståndet mellan två geometrier och returnerar det som en float. Detta är användbart för att faktiskt rapportera tillbaka avståndet mellan objekt.
uk: Команда :command:`ST_Distance(geometry A, geometry B)` обчислює *найкоротшу* відстань між двома геометріями та повертає її у вигляді числа з плаваючою комою. Це корисно для фактичного повідомлення про відстань між об'єктами.
zh_hans: :command:`ST_Distance(geometry A, geometry B)` 用于计算两个几何图形之间的最短距离，并以浮点数形式返回结果。该函数特别适用于需要精确报告对象间距离的场景。

source: For testing whether two objects are within a distance of one another, the :command:`ST_DWithin` function provides an index-accelerated true/false test. This is useful for questions like "how many trees are within a 500 meter buffer of the road?". You don't have to calculate an actual buffer, you just have to test the distance relationship.
es: Para probar si dos objetos están dentro de una distancia entre sí, la función :command:`ST_DWithin` proporciona una prueba de verdadero/falso acelerada por índice. Esto es útil para preguntas como "¿cuántos árboles están dentro de un buffer de 500 metros de la carretera?". No tienes que calcular un buffer real, solo tienes que probar la relación de distancia.
sv: För att testa om två objekt befinner sig inom ett visst avstånd från varandra ger funktionen :command:`ST_DWithin` ett indexaccelererat sant/falskt-test. Detta är användbart för frågor som "hur många träd finns det inom en buffert på 500 meter från vägen?". Du behöver inte beräkna en faktisk buffert, du behöver bara testa avståndsrelationen.
uk: Для перевірки, чи два об'єкти знаходяться на відстані один від одного, функція :command:`ST_DWithin` надає індексоване прискорення перевірки true/false. Це корисно для таких питань, як «скільки дерев знаходиться в межах 500 метрів від дороги?». Вам не потрібно обчислювати фактичний буфер, достатньо перевірити відношення відстаней.
zh_hans: :command:`ST_DWithin` 函数提供基于索引加速的布尔距离检测，用于判断两个对象是否处于指定距离范围内。该函数特别适用于诸如"道路500米范围内有多少树木"这类空间分析场景——无需实际生成缓冲区，仅需测试距离关系即可获得结果。

source: Using our Broad Street subway station again, we can find the streets nearby (within 10 meters of) the subway stop:
es: Usando nuevamente nuestra estación de metro Broad Street, podemos encontrar las calles cercanas (a menos de 10 metros) de la parada de metro:
sv: Med hjälp av vår Broad Street tunnelbanestation igen kan vi hitta gatorna i närheten (inom 10 meter från) tunnelbanestationen:
uk: Знову скориставшись станцією метро Broad Street, ми можемо знайти вулиці поблизу (в радіусі 10 метрів) від станції метро:
zh_hans: 以下是通过空间查询查找Broad Street地铁站周边10米范围内街道的SQL示例：

source: And we can verify the answer on a map. The Broad St station is actually at the intersection of Wall, Broad and Nassau Streets.
es: Y podemos verificar la respuesta en un mapa. La estación Broad St está realmente en la intersección de Wall, Broad y Nassau Streets.
sv: Och vi kan verifiera svaret på en karta. Broad St-stationen ligger faktiskt i korsningen mellan Wall, Broad och Nassau Streets.
uk: І ми можемо перевірити відповідь на карті. Станція Broad St насправді знаходиться на перетині вулиць Wall, Broad і Nassau.
zh_hans: 我们可通过地图验证该结论：Broad St 地铁站实际位于 Wall Street、Broad Street 和 Nassau Street 三条道路的交汇处。

source: Function List
es: Lista de funciones
sv: Funktionslista
uk: Список функцій
zh_hans: 函数列表

source: `ST_Contains(geometry A, geometry B) <http://postgis.net/docs/ST_Contains.html>`_: Returns true if and only if no points of B lie in the exterior of A, and at least one point of the interior of B lies in the interior of A.
es: `ST_Contains(geometry A, geometry B) <http://postgis.net/docs/ST_Contains.html>`_: Devuelve true si y solo si ningún punto de B se encuentra en el exterior de A, y al menos un punto del interior de B se encuentra en el interior de A.
sv: `ST_Contains(geometri A, geometri B) <http://postgis.net/docs/ST_Contains.html>`_: Returnerar sant om och endast om inga punkter i B ligger i utsidan av A, och minst en punkt i insidan av B ligger i insidan av A.
uk: `ST_Contains(geometry A, geometry B) <http://postgis.net/docs/ST_Contains.html>`_: Повертає true, якщо і тільки якщо жодна точка B не лежить зовні A, і принаймні одна точка всередині B лежить всередині A.
zh_hans: `ST_Contains(geometry A, geometry B) <http://postgis.net/docs/ST_Contains.html>`_:当且仅当B的任何点都不位于A的外部，并且B的内部至少有一个点位于A的内部时，返回true。

source: `ST_Crosses(geometry A, geometry B) <http://postgis.net/docs/ST_Crosses.html>`_: Returns TRUE if the supplied geometries have some, but not all, interior points in common.
es: `ST_Crosses(geometry A, geometry B) <http://postgis.net/docs/ST_Crosses.html>`_: Devuelve TRUE si las geometrías suministradas tienen algunos, pero no todos, los puntos interiores en común.
sv: `ST_Crosses(geometri A, geometri B) <http://postgis.net/docs/ST_Crosses.html>`_: Returnerar TRUE om de angivna geometrierna har vissa, men inte alla, inre punkter gemensamt.
uk: `ST_Crosses(geometry A, geometry B) <http://postgis.net/docs/ST_Crosses.html>`_: Повертає TRUE, якщо надані геометрії мають деякі, але не всі внутрішні точки спільні.
zh_hans: `ST_Crosses(geometry A, geometry B) <http://postgis.net/docs/ST_Crosses.html>`_: 当两个几何图形存在部分（非全部）内部点重合时返回 TRUE。
