Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/topology.po
Languages: es, sv

source: If you are thinking, what a total mess, yes it is a total mess. This is what happens after numerous cycles of simplification and other geometry processes where each geometry is treated as a separate unit. You get gaps, you get dangling islands, and neighborhoods encroaching on each other's territory.
es: Si piensas, “qué desastre total”, sí, es un desastre total. Esto es lo que ocurre después de numerosos ciclos de simplificación y otros procesos de geometría donde cada geometría se trata como una unidad separada. Obtienes huecos, islas colgantes y barrios invadiendo el territorio de otros.
sv: Om du tänker att det är en enda röra, så är det en enda röra. Detta är vad som händer efter många cykler av förenkling och andra geometriska processer där varje geometri behandlas som en separat enhet. Du får luckor, du får dinglande öar och stadsdelar som inkräktar på varandras territorium.

source: Luckily we can use topology to clean up this mess and to help us maintain good clean connected data.
es: Afortunadamente, podemos usar topología para limpiar este desastre y ayudarnos a mantener datos limpios y conectados.
sv: Som tur är kan vi använda topologi för att städa upp i den här röran och hjälpa oss att behålla bra, rena och sammanhängande data.

source: Let's put our land surveyor hat on and ask the question, if we are dividing our plots of land into districts (boros or neighborhoods) such that each district may border other districts but should not share any area in common, does it make sense for districts to have areas in common? No it does not make sense. And here we are with our data pointing out some areas belong to more than one neighborhood or more than one borough.
es: Pongámonos el sombrero de catastral y hagámonos la pregunta: si estamos dividiendo nuestras parcelas en distritos (boroughs o barrios) de modo que cada distrito pueda bordear otros distritos pero no compartir área en común, ¿tiene sentido que compartan áreas? No, no tiene sentido. Y aquí estamos con nuestros datos mostrando que algunas áreas pertenecen a más de un barrio o más de un borough.
sv: Låt oss ta på oss lantmäterihatten och ställa frågan: om vi delar in våra tomter i distrikt (boros eller stadsdelar) så att varje distrikt kan gränsa till andra distrikt men inte ska ha något gemensamt område, är det då rimligt att distrikten har gemensamma områden? Nej, det är inte vettigt. Och här är vi med våra data som pekar på att vissa områden tillhör mer än ett grannskap eller mer än en stadsdel.

source: Lets first look at boros and look for neighborhoods that share elements in common:
es: Veamos primero los boroughs y busquemos barrios que compartan elementos en común:
sv: Låt oss först titta på Boros och leta efter stadsdelar som delar element gemensamt:

source: The output is:
es: La salida es:
sv: Utgången är:

source: Which tells us that Queens and Brooklyn are in the middle of border wars. In this query we use the `GetTopoGeomElements <https://postgis.net/docs/GetTopoGeomElements.html>`_ function to declaratively inspect what components are shared across boroughs.
es: Lo que nos dice que Queens y Brooklyn están en medio de guerras fronterizas. En esta consulta usamos la función `GetTopoGeomElements <https://postgis.net/docs/GetTopoGeomElements.html>` para inspeccionar declarativamente qué componentes se comparten entre boroughs.

source: What is returned are a set of topolements. A topoelement is represented as an array of 2 integers with the first number being the id of the element, and the second, being the layer (or primitive type) of the element. PostGIS GetTopoElements returns the primitives of a topogeometry with types number 1-3 corresponding to (1: nodes, 2: edges, and 3: faces). All the topoelements for neighborhoods and boroughs are type 3, which corresponds to a topological face. We can use the `ST_GetFaceGeometry <https://postgis.net/docs/ST_GetFaceGeometry.html>`_ to get a visual representation of these shared faces as follows:
es: Lo que se devuelve es un conjunto de topoelementos. Un topoelemento se representa como un arreglo de 2 enteros, donde el primer número es el id del elemento y el segundo es la capa (o tipo primitivo) del elemento. PostGIS GetTopoElements devuelve los primitivos de una topogeometría con los tipos numerados del 1 al 3, correspondientes a (1: nodos, 2: aristas, y 3: caras). Todos los topoelementos de barrios y boroughs son de tipo 3, lo que corresponde a una cara topológica. Podemos usar la función `ST_GetFaceGeometry <https://postgis.net/docs/ST_GetFaceGeometry.html>`_ para obtener una representación visual de estas caras compartidas de la siguiente manera:

source: The result will be 5 rows corresponding to border disputes between Queens and Brooklyn.
es: El resultado serán 5 filas correspondientes a disputas fronterizas entre Queens y Brooklyn.
sv: Resultatet blir 5 rader som motsvarar gränstvister mellan Queens och Brooklyn.

source: If we look at our neighborhoods, we'll see a similar story but with 44 border disputes:
es: Si miramos nuestros barrios, veremos una historia similar pero con 44 disputas fronterizas:
sv: Om vi tittar på våra grannskap ser vi en liknande historia men med 44 gränstvister:

source: Because boroughs are an aggregation of neighborhoods, we can fix the borough issue by fixing the neighborhood border disputes.
es: Dado que los boroughs son una agregación de barrios, podemos corregir el problema de los boroughs corrigiendo las disputas fronterizas de los barrios.
sv: Eftersom stadsdelar är en sammanslagning av grannskap kan vi lösa stadsdelsfrågan genom att lösa grannskapets gränstvister.

source: There are a number of ways we could fix this. We could go out surveying asking people what neighbhood do they think they are standing in. Alternatively we could just assign slivers of land to the neighborhood with the least amount of area or to the highest bidder.
es: Hay varias formas en que podríamos arreglar esto. Podríamos salir a encuestar a la gente preguntándoles en qué barrio creen que están parados. Alternativamente, podríamos simplemente asignar pequeñas franjas de terreno al barrio con la menor cantidad de área o al mejor postor.
sv: Det finns ett antal sätt att åtgärda detta. Vi skulle kunna gå ut och fråga folk i vilket grannskap de tror att de bor. Alternativt kan vi bara tilldela landområden till grannskapet med minst yta eller till den högsta budgivaren.

source: Removing elements from Topogeometries is handled using the `TopoGeom_remElement <https://postgis.net/docs/TopoGeom_remElement.html>`_ function. So lets get on with it, removing duplicaed elements from neighborhoods with the most amount of area as follows:
es: La eliminación de elementos de las topogeometrías se maneja usando la función `TopoGeom_remElement <https://postgis.net/docs/TopoGeom_remElement.html>`_. Así que procedamos a eliminar elementos duplicados de los barrios con la mayor cantidad de área de la siguiente manera:
sv: Att ta bort element från topogeometrier hanteras med hjälp av funktionen `TopoGeom_remElement <https://postgis.net/docs/TopoGeom_remElement.html>`_. Så låt oss sätta igång och ta bort duplicerade element från stadsdelar med störst yta enligt följande:

source: The result of the above is 29 neighborhoods were updated. If you rerun the border dispute queries for neighborhoods and boroughs, you'll find you have no more border disputes.
es: El resultado de lo anterior es que se actualizaron 29 barrios. Si vuelves a ejecutar las consultas de disputas fronterizas para barrios y boroughs, verás que ya no tienes disputas fronterizas.
sv: Resultatet av ovanstående är att 29 stadsdelar uppdaterades. Om du kör om gränstvistfrågorna för stadsdelar och distrikt kommer du att upptäcka att du inte har några fler gränstvister.

source: We do still have gaps of empty space between neighborhoods caused by intensive simplification. Such issues can be fixed by directly editing the topology using the `Topology Editor family of functions <https://postgis.net/docs/Topology.html#Topology_Editing>`_ and/or filling in the holes and assigning those to neighborhoods.
es: Todavía tenemos huecos de espacio vacío entre barrios causados por simplificación intensiva. Estos problemas pueden corregirse editando directamente la topología usando la `familia de funciones Topology Editor <https://postgis.net/docs/Topology.html#Topology_Editing>`_ y/o rellenando los huecos y asignándolos a los barrios.

source: Now we can express declaritively that boros are formed from a collection of neighborhoods by defining a column called *topo* in *nyc_boros_t* table that is of type POLYGON and is a collection of other topogeometries from *nyc_neighborhoods_t.topo* column.
sv: Nu kan vi deklarativt uttrycka att boros bildas av en samling grannskap genom att definiera en kolumn som heter *topo* i *nyc_boros_t*-tabellen som är av typen POLYGON och är en samling av andra topogeometrier från *nyc_neighborhoods_t.topo*-kolumnen.

source: Which tells us that Queens and Brooklyn are in the middle of border wars. In this query we use the `GetTopoGeomElements <https://postgis.net/docs/GetTopoGeomElements.html>`_ function to declaritively inspect what components are shared across boroughs.
sv: Vilket säger oss att Queens och Brooklyn är mitt uppe i ett gränskrig. I den här frågan använder vi funktionen `GetTopoGeomElements <https://postgis.net/docs/GetTopoGeomElements.html>`_ för att deklaritivt inspektera vilka komponenter som delas mellan stadsdelar.

source: What is returned are a set of topolements. A topoelement is represented as an array of 2 integers with the first number being the id of the element, and the second, being the layer (or primitive type) of the element. PostGIS GetTopoElements returns the primitives of a topogeometry with types number 1-3 corresponding to (1: nodes, 2: edges, and 3: faces). All the topoelements for neighborhoods and boroughs are type 3, which corresponds to a topological face. We can use the `ST_GetFaceGeometry <https://postgis.net/docs/ST_GetFaceGeometry.html>`_ to get a visual representation of these shared faces as folows:
sv: Det som returneras är en uppsättning topolements. Ett topoelement representeras som en array av 2 heltal där det första talet är elementets id och det andra är elementets lager (eller primitiva typ). PostGIS GetTopoElements returnerar primitiverna i en topogeometri med typerna nummer 1-3 som motsvarar (1: noder, 2: kanter och 3: ytor). Alla topoelements för grannskap och stadsdelar är av typ 3, vilket motsvarar en topologisk yta. Vi kan använda `ST_GetFaceGeometry <https://postgis.net/docs/ST_GetFaceGeometry.html>`_ för att få en visuell representation av dessa delade ansikten enligt följande:

source: We do still have gaps of empty space between neighborhoods caused by intensive simplication. Such issues can be fixed by directly editing the topology using the `Topology Editor family of functions <https://postgis.net/docs/Topology.html#Topology_Editing>`_ and/or filling in the holes and assigning those to neighborhoods.
sv: Vi har fortfarande tomrum mellan stadsdelar som orsakats av intensiv förenkling. Sådana problem kan lösas genom att direkt redigera topologin med hjälp av funktionerna i `Topology Editor-familjen <https://postgis.net/docs/Topology.html#Topology_Editing>`_ och/eller fylla i hålen och tilldela dem till grannskap.
