Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/topology.po
Languages: es, sv

source: Topology
es: Topología
sv: Topologi

source: PostGIS supports the SQL/MM SQL-MM 3 Topo-Geo and Topo-Net 3 specifications via an extension called **postgis_topology**. You can learn about all the functions and types provided by this extension in `Manual: PostGIS Topology <https://postgis.net/docs/Topology.html>`_. The *postgis_topology* extension includes another kind of core spatial type, called a **topogeometry**. In addition to the *topogeometry* spatial type, you will find functions for building *topologies* and populating topologies.
es: PostGIS soporta las especificaciones SQL/MM SQL-MM 3 Topo-Geo y Topo-Net 3 a través de una extensión llamada **postgis_topology**. Puedes conocer todas las funciones y tipos que proporciona esta extensión en `Manual: PostGIS Topology <https://postgis.net/docs/Topology.html>`_. La extensión *postgis_topology* incluye otra clase de tipo espacial central, llamado **topogeometry**. Además del tipo espacial *topogeomety*, encontrará funciones para construir *topologías* y poblar topologías.
sv: PostGIS stöder SQL/MM SQL-MM 3 Topo-Geo och Topo-Net 3 specifikationer via ett tillägg som heter **postgis_topology**. Du kan lära dig mer om alla funktioner och typer som tillhandahålls av detta tillägg i `Manual: PostGIS Topology <https://postgis.net/docs/Topology.html>`_. Tillägget *postgis_topology* innehåller en annan typ av spatial kärntyp, som kallas **topogeometry**. Förutom den spatiala typen *topogeometry* hittar du funktioner för att bygga *topologier* och fylla i topologier.

source: Before you can start using topologies, you must install postgis_topology extension as follows:
es: Antes de poder empezar a usar topologías, debes instalar la extensión postgis_topology de la siguiente forma:
sv: Innan du kan börja använda topologier måste du installera tillägget postgis_topology enligt följande:

source: After you install the extension, you will see a new schema in your database called `topology`. The `topology` schema catalogs all the topologies in your database.
es: Después de instalar la extensión, verás un nuevo esquema en tu base de datos llamado `topology`. El esquema `topology` cataloga todas las topologías en tu base de datos.
sv: När du har installerat tillägget kommer du att se ett nytt schema i din databas som heter `topology`. Schemat `topology` katalogiserar alla topologier i din databas.

source: The `topology` schema contains two tables and all the helper functions for topology.
es: El esquema `topology` contiene dos tablas y todas las funciones auxiliares para topología.
sv: Schemat `topology` innehåller två tabeller och alla hjälpfunktioner för topologi.

source: topology - lists all the topologies in your database, and what schema they are stored in
es: topology - lista todas las topologías en tu base de datos y en qué esquema están almacenadas
sv: topologi - listar alla topologier i databasen och i vilket schema de lagras

source: layer - lists all the table columns in your database that hold topogeometries
es: layer - lista todas las columnas de tabla en tu base de datos que contienen topogeometrías
sv: layer - listar alla tabellkolumner i din databas som innehåller topogeometrier

source: The *layer* table is very similar to the `raster_columns`, `geometry_columns`, and `geography_columns` catalogs we learned about earlier, but specifically for topogeometries.
es: La tabla *layer* es muy similar a los catálogos `raster_columns`, `geometry_columns` y `geography_columns` que aprendimos anteriormente, pero específicamente para topogeometrías.
sv: Tabellen *layer* är mycket lik katalogerna `raster_columns`, `geometry_columns` och `geography_columns` som vi lärde oss om tidigare, men specifikt för topogeometrier.

source: Creating topologies
es: Creación de topologías
sv: Skapa topologier

source: What exactly is a topology and a topogeometry, and how are they related? Before we explain, let's start by creating a topology to house our NYC topologically perfect data using the `CreateTopology <https://postgis.net/docs/CreateTopology.html>`_ function and set the tolerance to be 0.5 meters. Note the 0.5 is in meters since our spatial reference system is State Plany NY meters.
es: ¿Qué es exactamente una topología y una topogeometría, y cómo se relacionan? Antes de explicar, empecemos creando una topología para almacenar nuestros datos topológicamente perfectos de NYC usando la función `CreateTopology <https://postgis.net/docs/CreateTopology.html>`_ y establezcamos la tolerancia en 0.5 metros. Nota que 0.5 está en metros ya que nuestro sistema de referencia espacial es State Plane NY metros.
sv: Vad exakt är en topologi och en topogeometri, och hur är de relaterade? Innan vi förklarar, låt oss börja med att skapa en topologi för att hysa våra NYC-topologiskt perfekta data med hjälp av funktionen `CreateTopology <https://postgis.net/docs/CreateTopology.html>`_ och ställa in toleransen till 0,5 meter. Observera att 0,5 är i meter eftersom vårt spatiala referenssystem är State Plany NY meter.

source: Which outputs:
es: Cuya salida es:
sv: Vilket matar ut:

source: Which is the id it assigned the new topology. Once you run the above command, you will see a new schema in your database called `nyc_topo`. You can name the topology anything you want. My convention is to add `_topo` at the end to distinguish it from other schemas I have in my database.
es: Que es el identificador que se le ha asignado a la nueva topología. Una vez que ejecute el comando anterior, verá un nuevo esquema en su base de datos llamado `nyc_topo`. Puede nombrar la topología como desee. Mi convención es añadir `_topo` al final para distinguirla de otros esquemas que tengo en mi base de datos.
sv: Vilket är det id som den tilldelade den nya topologin. När du har kört ovanstående kommando kommer du att se ett nytt schema i din databas som heter `nyc_topo`. Du kan namnge topologin vad du vill. Min konvention är att lägga till `_topo` i slutet för att skilja det från andra scheman jag har i min databas.

source: If you explore the `topology.topology` table,
es: Si exploras la tabla `topology.topology`,
sv: Om du utforskar tabellen `topology.topology`,

source: You will see:
es: Verás:
sv: Du kommer att få se:

source: Storage of topologies and topogeometries
es: Almacenamiento de topologías y topogeometrías
sv: Lagring av topologier och topogeometrier

source: A topology is implemented as a schema in a PostgreSQL database. If you explore the `nyc_topo` schema, you will see these tables and views:
es: Una topología se implementa como un esquema en una base de datos PostgreSQL. Si exploras el esquema `nyc_topo`, verás estas tablas y vistas:
sv: En topologi implementeras som ett schema i en PostgreSQL-databas. Om du utforskar schemat `nyc_topo` kommer du att se dessa tabeller och vyer:

source: edge - This is a view built against edge_data, mostly for SQL/MM compliance.
es: edge - Esta es una vista construida sobre edge_data, principalmente para cumplimiento con SQL/MM.
sv: edge - Detta är en vy som bygger på edge_data, främst för SQL/MM-överensstämmelse.

source: It has a subset of the columns in the `edge_data` table.
es: Tiene un subconjunto de las columnas de la tabla `edge_data`.
sv: Den har en delmängd av kolumnerna i tabellen `edge_data`.

source: edge_data - Contains all the linestrings that make up the topology
es: edge_data - Contiene todas las linestrings que conforman la topología
sv: edge_data - Innehåller alla linjestrings som utgör topologin

source: face - Contains a list of all closed surfaces that can be formed from the edge_data.
es: face - Contiene una lista de todas las superficies cerradas que pueden formarse a partir de edge_data.
sv: face - Innehåller en lista över alla slutna ytor som kan bildas från edge_data.

source: It does not contain the actual geometry, but instead just the bounding box of the geometry.
es: No contiene la geometría real, sino solo la caja envolvente (bounding box) de la geometría.
sv: Den innehåller inte den faktiska geometrin utan bara geometrins avgränsningsbox.

source: node - Contains all the start and end points of all edges as well as points not connected to anything (isolated nodes)
es: node - Contiene todos los puntos iniciales y finales de todos los edges así como puntos no conectados a nada (nodos aislados)
sv: nod - Innehåller alla start- och slutpunkter för alla kanter samt punkter som inte är anslutna till något (isolerade noder)

source: relation - this defines what elements in a topology make up a topogeometry.
es: relation - define qué elementos en una topología conforman una topogeometría.
sv: relation - detta definierar vilka element i en topologi som utgör en topogeometri.

source: So what is a topogeometry? A topogeometry is a representation of a geometry formed from the edges, faces, nodes, and other topogeometries in a topology.
es: Entonces, ¿qué es una topogeometría? Una topogeometría es una representación de una geometría formada por los edges, faces, nodes y otras topogeometrías en una topología.
sv: Vad är då en topogeometri? En topogeometri är en representation av en geometri som bildas av kanter, ytor, noder och andra topogeometrier i en topologi.

source: Where does a topogeometry reside? It resides somewhere else which references elements of a topology via the *relation* table. Although we could throw the topogeometries in our `nyc_topo` schema, the general convention, is to define other tables in other schemas that have a topogeometry, and also have any other kind of data you might be interested in tracking.
es: ¿Dónde reside una topogeometría? Reside en otro lugar que referencia elementos de una topología mediante la tabla *relation*. Aunque podríamos almacenar las topogeometrías en nuestro esquema `nyc_topo`, la convención general es definir otras tablas en otros esquemas que tengan una columna topogeometry, junto con cualquier otro tipo de datos que queramos manejar.
sv: Var finns en topogeometri? Den finns någon annanstans som refererar till element i en topologi via *relation*-tabellen. Även om vi kunde kasta topogeometrierna i vårt `nyc_topo` -schema, är den allmänna konventionen att definiera andra tabeller i andra scheman som har en topogeometri och också har någon annan typ av data som du kanske är intresserad av att spåra.

source: Why use topogeometries?
es: ¿Por qué usar topogeometrías?
sv: Varför använda topogeometrier?

source: Using topogeometries keeps your data tidy and connected. Topogeometries are very useful for Cadastral work, where you want to make sure two parcels of land don't overlap each other even if you change the boundaries of one or you want to make sure roads stay connected as you change the geometries that form them. Geometries live in an island of their own, you can duplicate them, morph them. Geometries are carefree, not caring about other geometries that share space with them. Topogeometries, in contrast, follow the rules of their topology; they can't exist unless there is an edge, node, face, or other topogeometry that defines them. A topogeometry belongs to one and only one topology. A topogeometry is a relational model of a geometry and as such as each component (edges/faces/nodes) are moved, added etc, they change not one topogeometry shape, but all topogeometries that have components in common.
es: El uso de topogeometrías mantiene tus datos organizados y conectados. Son muy útiles en trabajos catastrales, donde quieres asegurarte de que dos parcelas no se superpongan aunque cambies los límites de una, o asegurarte de que las carreteras permanezcan conectadas al modificar las geometrías que las forman. Las geometrías viven en su propio “isla”, puedes duplicarlas, modificarlas, sin importar otras geometrías. Las topogeometrías, en contraste, siguen las reglas de su topología; no pueden existir sin un edge, node, face u otra topogeometría que las defina. Una topogeometría pertenece a una y solo una topología. Una topogeometría es un modelo relacional de una geometría y, como tal, a medida que cada componente (edges/faces/nodes) se mueve o se modifica, cambian no solo una topogeometría, sino todas las que comparten esos componentes.
sv: Genom att använda topogeometrier håller du dina data prydliga och sammankopplade. Topogeometrier är mycket användbara för lantmäteriarbete, där du vill se till att två skiften inte överlappar varandra även om du ändrar gränserna för det ena eller att vägar förblir sammankopplade när du ändrar geometrierna som bildar dem. Geometrier lever på en egen ö, man kan duplicera dem, morfa dem. Geometrier är bekymmerslösa och bryr sig inte om andra geometrier som delar utrymme med dem. Topogeometrier följer däremot reglerna för sin topologi; de kan inte existera om det inte finns en kant, nod, yta eller annan topogeometri som definierar dem. En topogeometri hör till en och endast en topologi. En topogeometri är en relationsmodell av en geometri och när varje komponent (kanter/ytor/noder) flyttas, läggs till etc. ändras inte en topogeometris form, utan alla topogeometrier som har gemensamma komponenter.

source: We have an `nyc_topo` topology devoid of any data. Let's populate it with our NYC data. Topology edges, faces, and nodes can be created in 2 keys ways.
es: Tenemos una topología `nyc_topo` vacía de datos. Vamos a llenarla con nuestros datos de NYC. Los edges, faces y nodes de la topología pueden crearse de dos formas.
sv: Vi har en `nyc_topo`-topologi som saknar data. Låt oss fylla på den med våra NYC-data. Topologikanter, ansikten och noder kan skapas på två olika sätt.

source: Edges, Faces, and Nodes can be created directly using topology primitive functions.
es: Crearlos directamente usando funciones primitivas de topología.
sv: Edges, Faces och Nodes kan skapas direkt med hjälp av primitiva topologifunktioner.

source: Edges, Faces, and Nodes can be formed by creating topogeometries. When a topogeometry is created from a geometry and their are missing edges, faces, or nodes that match its coordinates, then new edges, faces, and nodes are created as part of the process.
es: Crearlos a partir de topogeometrías. Cuando se crea una topogeometría a partir de una geometría y faltan edges, faces o nodes que coincidan con sus coordenadas, estos nuevos elementos se crean como parte del proceso.
sv: Edges, Faces och Nodes kan bildas genom att skapa topogeometrier. När en topogeometri skapas från en geometri och det saknas kanter, ytor eller noder som matchar dess koordinater, skapas nya kanter, ytor och noder som en del av processen.

source: Defining topogeometry columns and creating topogeometries
es: Definición de columnas de topogeometría y creación de topogeometrías
sv: Definiera kolumner för topogeometri och skapa topogeometrier

source: The most common way to populate topologies is to create topogeometries. Lets start by creating a table to hold neighborhoods and then add a topogeometry column using the `AddTopoGeometryColumn <https://postgis.net/docs/AddTopoGeometryColumn.html>`_ function.
es: La forma más común de poblar topologías es creando topogeometrías. Empecemos creando una tabla para almacenar barrios y luego añadamos una columna de tipo topogeometry usando la función `AddTopoGeometryColumn <https://postgis.net/docs/AddTopoGeometryColumn.html>`_.
sv: Det vanligaste sättet att fylla i topologier är att skapa topogeometrier. Vi börjar med att skapa en tabell som innehåller stadsdelar och lägger sedan till en topogeometrikolumn med hjälp av funktionen `AddTopoGeometryColumn <https://postgis.net/docs/AddTopoGeometryColumn.html>`_.

source: The output of the above is:
es: La salida es:
sv: Utgången av ovanstående är:

source: Now we are ready to populate our table. It's best to ensure your geometries are valid before adding, otherwise you'll get errors such as SQL\MM geometry is not simple.
es: Ahora estamos listos para poblar nuestra tabla. Es mejor asegurarse de que las geometrías sean válidas antes de añadirlas, de lo contrario aparecerán errores como “SQL/MM geometry is not simple”.
sv: Nu är vi redo att fylla i vår tabell. Det är bäst att se till att geometrierna är giltiga innan du lägger till dem, annars får du felmeddelanden som SQL\MM geometry is not simple.

source: So lets start by adding valid ones. The 1 used here refers to the layer_id generated from the previous query. If you don't know the layer id, you would look it up using the `FindLayer <https://postgis.net/docs/FindLayer.html>`_ function which we'll use in later examples.
es: Así que empecemos añadiendo geometrías válidas. El 1 usado aquí se refiere al layer_id generado en la consulta anterior. Si no conoces el layer id, lo buscarías usando la función `FindLayer <https://postgis.net/docs/FindLayer.html>`, que usaremos en ejemplos posteriores.
sv: Så låt oss börja med att lägga till giltiga sådana. Det 1 som används här hänvisar till det layer_id som genererades från den tidigare frågan. Om du inte känner till lager-ID:t kan du leta upp det med hjälp av funktionen `FindLayer <https://postgis.net/docs/FindLayer.html>`_ som vi använder i senare exempel.

source: For these examples you'll use the function `toTopoGeom <https://postgis.net/docs/toTopoGeom.html>`_ function to convert a geometry to it's topogeometry equivalent. toTopoGeom function handles a lot of book-keeping for you.
es: Para estos ejemplos usarás la función `toTopoGeom <https://postgis.net/docs/toTopoGeom.html>` que convierte una geometría en su equivalente topogeometry. La función toTopoGeom gestiona gran parte del trabajo por ti.
sv: I de här exemplen använder du funktionen `toTopoGeom <https://postgis.net/docs/toTopoGeom.html>`_ för att konvertera en geometri till dess topogeometriska motsvarighet. toTopoGeom-funktionen sköter en hel del bokföring åt dig.

source: The `toTopoGeom` function inspects the geometry passed in and injects nodes, edges, and faces as needed into your topology to form the shape of the geometry. It will then add relationships to the `relation` table that defines how this new topogeometry is related to these new and existing topology elements. In some cases pieces of the geometry may exist or existing pieces need to be split to form the new geometry.
es: La función `toTopoGeom` inspecciona la geometría pasada e inyecta nodes, edges y faces según sea necesario en tu topología para formar la geometría. Luego añadirá relaciones a la tabla `relation` que definen cómo esta nueva topogeometría se relaciona con los elementos nuevos y existentes de la topología. En algunos casos, piezas de la geometría ya pueden existir o necesitan dividirse para formar la nueva geometría.
sv: Funktionen `toTopoGeom` inspekterar den geometri som skickas in och injicerar noder, kanter och ytor efter behov i din topologi för att bilda geometrins form. Den lägger sedan till relationer i tabellen `relation` som definierar hur den nya topogeometrin är relaterad till dessa nya och befintliga topologielement. I vissa fall kan det finnas delar av geometrin eller så måste befintliga delar delas upp för att bilda den nya geometrin.

source: The above step should take 3-4 secs. Now lets add the invalid ones:
es: Este paso debería tardar 3-4 segundos. Ahora añadamos las no válidas:
sv: Ovanstående steg bör ta 3-4 sekunder. Låt oss nu lägga till de ogiltiga:

source: The above should take about 300-400ms.
es: Esto debería tardar unos 300-400 ms.
sv: Ovanstående bör ta cirka 300-400 ms.

source: Now we have data in our topology. A quick check will show, nyc_topo.edge, nyc_topo.node, and nyc_topo.face have data:
es: Ahora tenemos datos en nuestra topología. Una verificación rápida mostrará que nyc_topo.edge, nyc_topo.node y nyc_topo.face tienen datos:
sv: Nu har vi data i vår topologi. En snabb kontroll visar att nyc_topo.edge, nyc_topo.node och nyc_topo.face har data:

source: outputs:
es: La salida es:
sv: utgångar:

source: Now we can express declaratively that boros are formed from a collection of neighborhoods by defining a column called *topo* in *nyc_boros_t* table that is of type POLYGON and is a collection of other topogeometries from *nyc_neighborhoods_t.topo* column.
es: Ahora podemos expresar declarativamente que los boroughs se forman a partir de una colección de barrios definiendo una columna llamada *topo* en la tabla *nyc_boros_t* que es de tipo POLYGON y es una colección de otras topogeometrías de la columna *nyc_neighborhoods_t.topo*.

source: In order to populate this new table, we'll use the `CreateTopoGeom <https://postgis.net/docs/CreateTopoGeom.html>`_ function. Instead of starting with geometries to form a new topogeometry, the CreateTopoGeom starts with existing topology elements which may be primitives or other topogeometries to define a new topogeometry.
es: Para poblar esta nueva tabla, usaremos la función `CreateTopoGeom <https://postgis.net/docs/CreateTopoGeom.html>`. En lugar de partir de geometrías para formar una nueva topogeometría, CreateTopoGeom parte de elementos de topología existentes que pueden ser primitivos u otras topogeometrías para definir una nueva topogeometría.
sv: För att fylla i denna nya tabell använder vi funktionen `CreateTopoGeom <https://postgis.net/docs/CreateTopoGeom.html>`_. I stället för att börja med geometrier för att bilda en ny topogeometri, börjar CreateTopoGeom med befintliga topologielement som kan vara primitiver eller andra topogeometrier för att definiera en ny topogeometri.

source: Which will insert 5 records corresponding to the boroughs of New York.
es: Esto insertará 5 registros correspondientes a los boroughs de Nueva York.
sv: Vilket kommer att infoga 5 poster som motsvarar stadsdelarna i New York.

source: If you are using PostGIS 3.4 or higher, you can use the new cast to cast a topogeometry to a topoelement, and replace `topology.TopoElementArray_Agg( ARRAY[ (n.topo).id, (n.topo).layer_id ]::topoelement ) )` in the above example with the shorter `topology.TopoElementArray_Agg( n.topo::topoelement )`
es: Si usas PostGIS 3.4 o superior, puedes usar el nuevo cast para convertir una topogeometría en un topoelement y reemplazar `topology.TopoElementArray_Agg( ARRAY[ (n.topo).id, (n.topo).layer_id ]::topoelement ) )` en el ejemplo anterior por la forma más corta `topology.TopoElementArray_Agg( n.topo::topoelement )`
sv: Om du använder PostGIS 3.4 eller senare kan du använda det nya kastet för att kasta en topogeometri till ett topoelement och ersätta `topology.TopoElementArray_Agg( ARRAY[ (n.topo).id, (n.topo).layer_id ]::topoelement ) )` i exemplet ovan med det kortare `topology.TopoElementArray_Agg( n.topo::topoelement )`

source: To view these in pgAdmin, you can cast the topogeometry to a geometry as follows:
es: Para verlos en pgAdmin, puedes convertir la topogeometría a geometría de la siguiente manera:
sv: Om du vill visa dessa i pgAdmin kan du omvandla topogeometrin till en geometri på följande sätt:

source: The output will look like below:
es: La salida se verá como:
sv: Utdata kommer att se ut som nedan:
