Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/topology_topo_types.po
Languages: es, ja, sv

source: Isolated Edge Case
es: Caso de Arista Aislada
ja: 孤立エッジの場合
sv: Isolerat kantfall

source: There is a case that may be confusing, all the rules above follow in the same way but it is good to take a look.
es: Hay un caso que puede ser confuso. Todas las reglas anteriores se siguen de la misma manera, pero es bueno revisarlo.
ja: 混乱するかもしれない例です。上の規則全てを同じに適用していますが、見てみるといいです。
sv: Det finns ett fall som kan vara förvirrande, alla regler ovan följer på samma sätt men det är bra att ta en titt.

source: When we have an Edge that has no connections to other Edges, the first thing we can appreciate is that the Face of the Left is the same as the Right, in this case Face 0, the Universal Face.
es: Cuando tenemos una Arista que no tiene conexión con otras Aristas, lo primero que podemos apreciar es que la Cara de la Izquierda es la misma que la de la Derecha, en este caso la Cara 0, la Cara Universal.
ja: 他のエッジと接続しないエッジがある時、最初に私たちが理解できることは、エッジは左側のフェイスと右側のフェイスが同じということです。孤立エッジの場合は、0番フェイス すなわちユニバーサルフェイスです。
sv: När vi har en kant som inte har några kopplingar till andra kanter är det första vi kan förstå att vänstersidan är densamma som högersidan, i det här fallet Face 0, Universal Face.

source: If we follow the past logic, on the Left is the Face 0, which is the next edge who builds Face 0? Actually there is an Edge, and is itself, and it also has a perspective as before:
es: Si seguimos la lógica anterior, a la izquierda está la Cara 0. ¿Cuál es la siguiente arista que construye la Cara 0? En realidad hay una arista, y es ella misma, y también tiene una perspectiva como antes:
ja: 過去のロジックに従うと、左側は 0番フェイス となりますが、0番フェイス を構築する次のエッジはどれでしょうか？実際は、そのエッジ自体が該当します。前と同じ視点を持ちます。
sv: Om vi följer den tidigare logiken, till vänster är Face 0, vilket är nästa kant som bygger Face 0? Det finns faktiskt en kant, och den är sig själv, och den har också ett perspektiv som tidigare:

source: If we check the perspective direction we ends looking the same edge but in opposite direction, this means the Edge 1 and its Next Edge (Edge 1) has opposed directions.
es: Si revisamos la dirección de la perspectiva, terminamos viendo la misma arista pero en dirección opuesta. Esto significa que la Arista 1 y su Siguiente Arista (Arista 1) tienen direcciones opuestas.
ja: 視点の方向を確認すると、同じエッジを反対方向に見えていることになります。これは 1番エッジ と次のエッジ (1番エッジ) とが逆方向になっていることを意味します。
sv: Om vi kontrollerar perspektivriktningen slutar vi titta på samma kant men i motsatt riktning, vilket innebär att Edge 1 och dess nästa kant (Edge 1) har motsatta riktningar.

source: next_left_edge: -1 (This will always be negative while we see forward a isolated edge)
es: next_left_edge: -1 (Esto siempre será negativo mientras veamos hacia adelante una arista aislada)
ja: next_left_edge: -1 (孤立エッジを順方向に見ると常に負になります)
sv: next_left_edge: -1 (Detta kommer alltid att vara negativt när vi ser framåt en isolerad kant)

source: For the Next Right Edge is the same, the Next Edge will be it self, the only what it changes is the perspective:
es: Para la Next Right Edge es lo mismo. La siguiente arista será ella misma, lo único que cambia es la perspectiva:
ja: 次の右のエッジは同じですから、次のエッジは、それ自体となります。視点だけ変わります。
sv: För nästa högra kant är densamma, nästa kant kommer att vara sig själv, det enda som förändras är perspektivet:

source: When we look backwards any isolated edge, the perspective will always have the same direction as the Edge so:
es: Cuando miramos hacia atrás cualquier arista aislada, la perspectiva siempre tendrá la misma dirección que la Arista, así que:
ja: どの孤立エッジでも逆方向に見ると、視点はそのエッジと同じ方向となり、次のようになります:
sv: När vi tittar bakåt på en isolerad kant kommer perspektivet alltid att ha samma riktning som kanten:

source: next_right_edge: -1 (This will always be positive while we see backwar a isolated edge)
es: next_right_edge: -1 (Esto siempre será positivo mientras veamos hacia atrás una arista aislada)
ja: next_right_edge: -1 (孤立エッジを逆方向に見ると、これは常に正の数になります)
sv: next_right_edge: -1 (Detta kommer alltid att vara positivt medan vi ser bakåt en isolerad kant)

source: Full columns of edge_data
es: Columnas de la tabla edge_data
ja: edge_data の全てのカラム
sv: Fullständiga kolumner av edge_data

source: We already checked all the columns of the edge_data table:
es: Ya hemos revisado todas las columnas de la tabla edge_data:
ja: edge_dataテーブル の全てのカラムをすでに確認しています:
sv: Vi har redan kontrollerat alla kolumner i tabellen edge_data:

source: edge_id: Unique ID for the edge.
es: edge_id: ID único para la arista.
ja: edge_id: エッジの一意の ID。
sv: edge_id: Unikt ID för kanten.

source: start_node: ID for the node which is the same as the start point of the edge.
es: start_node: ID del nodo que es el mismo que el punto inicial de la arista.
ja: start_node: エッジの始端と同じノードの ID。
sv: start_node: ID för den nod som är densamma som startpunkten för kanten.

source: end_node: ID for the node which is the same as the end point of the edge.
es: end_node: ID del nodo que es el mismo que el punto final de la arista.
ja: end_node: エッジの終端と同じノードの ID。
sv: end_node: ID för den nod som är densamma som slutpunkten för kanten.

source: left_face: ID of the face on the left of the edge.
es: left_face: ID de la cara a la izquierda de la arista.
ja: left_face: エッジの左側のフェイスの ID。
sv: left_face: ID för den yta som ligger till vänster om kanten.

source: abs_next_left_edge: Next edge who builds the face on the left.
es: abs_next_left_edge: Siguiente arista que construye la cara en la izquierda.
ja: abs_next_left_edge: 左側のフェイスを構築する次のエッジ。
sv: abs_next_left_edge: Nästa kant som bygger ytan till vänster.

source: next_left_edge: abs_next_left_edge and negative sign if the right face is on the right of the next left edge.
es: next_left_edge: abs_next_left_edge y signo negativo si la cara derecha está a la derecha de la siguiente arista izquierda.
ja: next_left_edge: abs_next_left_edge と、右側のフェイスが次の左側のエッジの右側にあるならマイナス符号。
sv: next_left_edge: abs_next_left_edge och negativt tecken om den högra sidan är till höger om nästa vänstra kant.

source: right_face: ID of the face on the right of the edge.
es: right_face: ID de la cara a la derecha de la arista.
ja: right_face: 右側のフェイスの ID。
sv: right_face: ID för ytan till höger om kanten.

source: abs_next_right_edge: Next edge who builds the face on the right.
es: abs_next_right_edge: Siguiente arista que construye la cara en la derecha.
ja: abs_next_right_edge: 右側のエッジを構築する次のエッジ。
sv: abs_next_right_edge: Nästa kant som bygger ytan till höger.

source: next_right_edge: abs_next_right_edge and negative sign if the left face is on the right of the next right edge.
es: next_right_edge: abs_next_right_edge y signo negativo si la cara izquierda está a la derecha de la siguiente arista derecha.
ja: next_right_edge: abs_next_right_edge と、左側のフェイスが次の右側のエッジの右側にあるならマイナス符号。
sv: next_right_edge: abs_next_right_edge och negativt tecken om den vänstra sidan är till höger om nästa högra kant.

source: geom: Geometry of the edge.
es: geom: Geometría de la arista.
ja: geom: エッジのジオメトリ。
sv: geom: Geometri för kanten.

source: `Introductory workshop: PostGIS Topology Workshop <https://postgis.net/workshops/en/postgis-intro/topology.html>`_.
sv: `Introduktiv workshop: PostGIS Topology Workshop <https://postgis.net/workshops/en/postgis-intro/topology.html>`_.

source: nexr_right_edge: -4 (Perspective direction and Edge 4 direction are opposed)
sv: nexr_right_edge: -4 (Perspektivriktning och Edge 4-riktning är motsatta)
