Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/topology_topo_types.po
Languages: es, ja, sv

source: Topology Basic Types
es: Tipos Básicos de Topología
ja: トポロジ基本タイプ
sv: Grundläggande topologityper

source: Before read this document, at least check one of this documents:
es: Antes de leer este documento, consulte al menos uno de estos documentos:
ja: この文書を読む前に、次の文書の少なくとも一つを確認してください:
sv: Innan du läser detta dokument ska du åtminstone titta på ett av dessa dokument:

source: `Introductory workshop: PostGIS Topology Workshop <topology.html>`_.
es: `Taller introductorio: Taller de Topología PostGIS <topology.html>`_.

source: `Manual: PostGIS Topology <https://postgis.net/docs/Topology.html>`_.
es: `Manual: Topología en PostGIS <https://postgis.net/docs/Topology.html>`_.
ja: `マニュアル: PostGIS トポロジ <https://postgis.net/docs/ja/Topology.html>`_.
sv: `Handbok: PostGIS-topologi <https://postgis.net/docs/Topology.html>`_.

source: `ISO Topology: OGC-SFS Geometries <https://www.gaia-gis.it/fossil/libspatialite/wiki?name=topo-intro>`_.
es: `Topología en ISO: Geometrías OGC-SFS <https://www.gaia-gis.it/fossil/libspatialite/wiki?name=topo-intro>`_.

source: In this workshop, we will check some fundamentals of topology, its basics and definitions. It is not intended to be a way to use them directly, is to understand it to then be able to use it easily.
es: En este taller revisaremos algunos fundamentos de topología, sus bases y definiciones. No pretende ser una forma de utilizarlos directamente, es entenderlo para luego poder utilizarlo fácilmente.
ja: このワークショップでは、トポロジの基本や定義といった基礎的な部分について見ていきます。直接使うことを目的としたものでなく、理解することでトポロジを簡単に使えるようになることを目的としています。
sv: I den här workshopen kommer vi att gå igenom några grundläggande principer för topologi, dess grunder och definitioner. Det är inte tänkt att vara ett sätt att använda dem direkt, utan att förstå det för att sedan kunna använda det enkelt.

source: Types
es: Tipos
ja: タイプ

source: The basic topology works on three basic types.
es: La topología básica funciona con tres tipos básicos.
ja: 基本のトポロジは3種の基本タイプで動作します。
sv: Den grundläggande topologin fungerar på tre grundläggande typer.

source: Node: 2D point, everything starts or ends here
es: Nodo: punto 2D, todo empieza o acaba aquí
ja: ノード: 2次元のポイントで、すべてのものがノードから始まりノードで終わります
sv: Node: 2D-punkt, allt börjar eller slutar här

source: Edge: A linestring with direction that start and ends on a node
es: Arista: línea con dirección que comienza y termina en un nodo
ja: エッジ: 有向ラインストリングで、ノードから始まり、ノードで終わります
sv: Edge: En linestring med riktning som börjar och slutar på en nod

source: Face: Closed set of linestrings, that conforms a polygon
es: Cara (Face): Conjunto cerrado de líneas (linestrings), que conforma un polígono
ja: フェイス: 閉じたラインストリングの集合で、ポリゴンに適合します
sv: Face: Sluten uppsättning linestrings, som anpassar sig till en polygon

source: There are some rules for a set of nodes, edges and faces to be valid, check the ISO Topology document, has a very good summary of these conditions, a topology that follows all the rules, is a valid topology.
es: Existen algunas reglas para que un conjunto de nodos, aristas y caras sea válido. Revisa el documento ISO Topology, que tiene un muy buen resumen de estas condiciones. Una topología que sigue todas las reglas es una topología válida.
ja: ノード、エッジ、フェイスの集合のための規則があります。ISOトポロジドキュメントを見てください。これらの条件について非常によくまとまっています。全ての規則に沿うトポロジは妥当なトポロジです。
sv: Det finns vissa regler för att en uppsättning noder, kanter och ytor ska vara giltiga, se ISO Topology-dokumentet, som har en mycket bra sammanfattning av dessa villkor, en topologi som följer alla regler är en giltig topologi.

source: Is good to know, until now Postgis will save all this information internally, each type has its own unique ID, and with it we can edit and change them using the available functions, for example with ST_RemEdgeNewFace you can remove an edge and create a new face.
es: Es bueno saber que, hasta ahora, PostGIS guardará toda esta información internamente, cada tipo tiene su propio ID único, y con él podemos editarlos y modificarlos usando las funciones disponibles. Por ejemplo, con ST_RemEdgeNewFace puedes eliminar una arista y crear una nueva cara.
ja: 知るといい話です。PostGIS は全ての情報を内部に格納するまで、各々のタイプは一意の ID が付きます。この ID と有効な関数を使って、それらを編集や変更ができます。たとえば ST_RemEdgeNewFace を使うと、エッジを削除して、新しいフェイスを生成できます。
sv: Det är bra att veta, fram till nu sparar Postgis all denna information internt, varje typ har sitt eget unika ID, och med det kan vi redigera och ändra dem med hjälp av tillgängliga funktioner, till exempel med ST_RemEdgeNewFace kan du ta bort en kant och skapa en ny yta.

source: But there is still a missing piece, how do we say for example, a face has a specific attribute? Postgis implements several concepts to do this like Layers, TopoGeometry, TopoElement.
es: Pero aún falta una pieza: ¿cómo decimos, por ejemplo, que una cara tiene un atributo específico? PostGIS implementa varios conceptos para hacer esto como Layers, TopoGeometry, TopoElement.
ja: しかし、まだ埋まらないピースがあります。たとえば、フェイスが特定の属性を持たせるのにどうすればいいのでしょうか? PostGISはレイヤ、トポジオメトリ、トポエレメントといった概念を実装しています。
sv: Men det finns fortfarande en sak som saknas, hur säger vi till exempel att en yta har ett specifikt attribut? Postgis implementerar flera koncept för att göra detta som Layers, TopoGeometry, TopoElement.

source: Universal Face
es: Cara Universal
ja: ユニバーサルフェイス

source: It Might be intuitive to think that only the faces constructed by edges exist, there is one exception, all the white space out of all the faces is also a face!
es: Podría ser intuitivo pensar que solo existen las caras construidas por aristas, pero hay una excepción: ¡todo el espacio en blanco fuera de todas las caras también es una cara!
ja: 存在するエッジで構築されるフェイスだけを考えるのが直感的かも知れませんが、全てのフェイスの外側にある空白もまたフェイスなのです!
sv: Det kan vara intuitivt att tro att bara de faces som konstrueras av kanter existerar, men det finns ett undantag: allt vitt utrymme bland alla faces är också ett face!

source: The empty space is called the Universal Face, when a Topology is empty, all the space is the Universal Face, when we add a linestring is an edge of this face, then when we make a polygon it is like make a hole in the face and stealing it to assign it to a face.
es: El espacio vacío se llama la Cara Universal. Cuando una topología está vacía, todo el espacio es la Cara Universal. Cuando añadimos una línea (linestring), esta es una arista de esa cara; luego, cuando creamos un polígono, es como hacer un agujero en la cara y “robarlo” para asignarlo a una cara.
ja: 何もない空間はユニバーサルフェイスと呼ばれます。トポロジに何もないときは空間の全てがユニバーサルフェイスです。ここでラインストリングを追加すると、このフェイスのエッジで、このあと、ポリゴンを作る時には、フェイス内に穴を作り、それを奪ってフェイスに割り当てるようなかんじになります。
sv: Det tomma utrymmet kallas Universal Face, när en topologi är tom är allt utrymme Universal Face, när vi lägger till en linestring är en kant av denna yta, när vi sedan gör en polygon är det som att göra ett hål i ytan och stjäla det för att tilldela det till en yta.

source: This face is infinite and does not have any boundary.
es: Esta cara es infinita y no tiene ningún límite.
ja: このフェイスは無限大で境界を持ちません。
sv: Denna yta är oändlig och har inte någon gräns.

source: The Universal Face has the ID 0.
es: La Cara Universal tiene el ID 0.
ja: ユニバーサルフェイスの ID は 0 です。
sv: Universal Face har ID 0.

source: Edge interpretation
es: Interpretación de Aristas
ja: エッジの解釈
sv: Tolkning av kanter

source: To correctly represent a topology and their forms, there are some definitions that are used to construct the tables that store everything, the edge is on the more complex ones.
es: Para representar correctamente una topología y sus formas, hay algunas definiciones que se usan para construir las tablas que almacenan todo. La arista es una de las más complejas.
ja: トポロジとその形状を正しく表現するために、全てを保存するテーブルを構築するための定義が存在します。エッジは、より複雑な定義になっています。
sv: För att korrekt representera en topologi och dess former finns det vissa definitioner som används för att konstruera de tabeller som lagrar allt, kanten är på de mer komplexa.

source: All the information about edges is stored on the edge_data table, in your custom topology schema, and which information do we need in the edges? basically its nodes and faces information, edge is the primitive who connects both.
es: Toda la información sobre las aristas se almacena en la tabla edge_data, en tu esquema de topología personalizada. ¿Y qué información necesitamos en las aristas? Básicamente la información de sus nodos y caras. La arista es la primitiva que conecta ambos.
ja: エッジに関する情報はすべて、トポロジスキーマ内の edge_data テーブルに保存されています。どの情報がエッジに必要でしょうか? 基本的にはノードとフェイスの情報で、エッジは両社を接続するプリミティブです。
sv: All information om kanter lagras i tabellen edge_data, i ditt anpassade topologischema, och vilken information behöver vi i kanterna? i princip är det information om noder och ytor, kanten är den primitiva som förbinder båda.

source: These linestrings are called Edges because they are the edges of the faces.
es: Estas líneas se llaman Aristas porque son los bordes de las caras.
ja: これらのラインストリングは、フェイスのエッジになるので、エッジと呼ばれます。
sv: Dessa linestrings kallas Edges eftersom de är kanterna på ytorna.

source: Edge direction, left and right
es: Dirección de la arista, izquierda y derecha
ja: エッジ方向、左と右
sv: Kantriktning, vänster och höger

source: Edges in topology has a right defined perspective and view, when we see them must be done in the next way:
es: Las aristas en topología tienen una perspectiva y orientación definidas. Cuando las vemos, debe hacerse de la siguiente manera:
ja: トポロジのエッジには正しく定義された視点と視界とがあります。それらは次のように見えます:
sv: Kanter i topologin har ett rätt definierat perspektiv och vy, när vi ser dem måste det göras på nästa sätt:

source: When we want to see from the edge perspective is always from the end node to the start edge, always looking the edge forward.
es: Cuando queremos ver desde la perspectiva de la arista, siempre es desde el nodo final hacia el nodo inicial, siempre mirando hacia adelante en la arista.
ja: エッジから見たいとき、視点は常に終端ノードから始端ノードで、常にエッジ順方向に見ます。
sv: När vi vill se från kantperspektivet är det alltid från slutnoden till startkanten, alltid med kanten framåt.

source: The edges have left and right properties, as we see they are defined using the edge perspective, see the linestring from the start node to the end node, there will always be a well defined left and right.
es: Las aristas tienen propiedades de izquierda y derecha. Como vemos, estas se definen usando la perspectiva de la arista: mirando la línea desde el nodo inicial hacia el nodo final, siempre habrá un lado izquierdo y un lado derecho bien definidos.
ja: エッジは左属性と右属性を持ち、エッジの視線を使って定義します。すなわち、ラインストリングの始点ノードから終点ノードを見ます。常に定義づけられた左と右があります。
sv: Kanterna har vänster- och högeregenskaper, som vi ser definieras de med hjälp av kantperspektivet, se linjesträngen från startnoden till slutnoden, det kommer alltid att finnas en väldefinierad vänster och höger.

source: So see the edge forward and you always have a left and right side.
es: Así que mira la arista hacia adelante y siempre tendrás un lado izquierdo y uno derecho.
ja: エッジの前方向を見ることができ、左と右があることが分かります。
sv: Så se kanten framåt och du har alltid en vänster och en höger sida.

source: This helps to relate which faces are on each side of the edge:
es: Esto ayuda a relacionar qué caras están en cada lado de la arista:
ja: 次の図は、どのフェイスがエッジのどちらの側にあるかの関係を見る助けになります。
sv: Detta hjälper till att relatera vilka ytor som finns på vardera sidan av kanten:

source: Check the edges on the image, while almost all the edges go from down to up and left to right, there is an orange edge which has the opposite direction, so its sides left and right are swapped in reference to the others, but if you look the edge forward, the right and left are right.
es: Observa las aristas en la imagen: aunque casi todas van de abajo hacia arriba y de izquierda a derecha, hay una arista naranja que tiene la dirección opuesta, por lo que sus lados izquierdo y derecho están invertidos con respecto a las demás. Pero si miras la arista hacia adelante, el lado derecho e izquierdo son correctos.
ja: 画像のエッジを確認して、ほとんど全てのエッジが下から上に向かい、左から右に向かっています。逆方向になるエッジもあります。オレンジ色のエッジです。逆方向のエッジは、そうでないエッジとは右、左が入れ替わっています。ただ、エッジを順方向に見ると右左が正しくなります。
sv: Kontrollera kanterna på bilden, medan nästan alla kanter går från ner till upp och från vänster till höger, finns det en orange kant som har motsatt riktning, så dess sidor vänster och höger är ombytta i förhållande till de andra, men om du tittar på kanten framåt är höger och vänster rätt.

source: Continue seeing the orange edge, while on its right has a polygon built by the edges, on the left is the Universal Face.
es: Siguiendo con la arista naranja, mientras que a su derecha tiene un polígono construido por las aristas, a la izquierda está la Cara Universal.
ja: オレンジ色のエッジをそのまま見てください。エッジの右側にそのエッジで作られたポリゴンがあり、左側にユニバーサルフェイスがあります。
sv: Fortsätt att se den orange kanten, medan den till höger har en polygon byggd av kanterna, till vänster är Universal Face.

source: When we want to analyze any edge, and we need to see it from the edge perspective, it is always looking the edge in forward, never in backward!
es: Cuando queremos analizar cualquier arista, y necesitamos verla desde la perspectiva de la arista, siempre es mirándola hacia adelante, ¡nunca hacia atrás!
ja: あらゆるエッジを解析したい時には、エッジ視点の方向からエッジを見る必要があります。常にエッジの前方を見るようにして、後方を見るようにはしてはいけません!
sv: När vi vill analysera en kant, och vi måste se den från kantperspektivet, är det alltid att titta på kanten framåt, aldrig bakåt!

source: Which are all the next edges? Looking forward we go from start node to the end node, all the edges who start or end in the end node of the edge!
es: ¿Cuáles son las siguientes aristas? Mirando hacia adelante vamos del nodo inicial al nodo final, ¡todas las aristas que comienzan o terminan en el nodo final de la arista!
ja: 次のエッジの全てはどれ? 始端ノードから終端ノードへの順方向に見ていくと、エッジの終端ノードを始端または終端とする全てのエッジが当てはまるのです!
sv: Vilka är alla de kommande kanterna? Om vi tittar framåt går vi från startnoden till slutnoden, alla kanter som börjar eller slutar i kantnoden!

source: Edge Data
es: Datos de la Arista
ja: エッジデータ
sv: Kantdata

source: The edge_data table has information related to the edge, from what we know right now we can interpret the next columns:
es: La tabla edge_data tiene información relacionada con la arista. A partir de lo que sabemos hasta ahora, podemos interpretar las siguientes columnas:
ja: edge_data テーブルには、エッジ関連の情報が入っています。これまでで知ったことから次に示すカラムを解釈することができます:
sv: Tabellen edge_data innehåller information om kanten, utifrån vad vi vet just nu kan vi tolka nästa kolumner:

source: edge_id: Unique ID for the edge
es: edge_id: ID único para la arista
ja: edge_id: エッジの一意の ID
sv: edge_id: Unikt ID för kanten

source: start_node: ID for the node who is the same as the start point of the edge
es: start_node: ID del nodo que es el mismo que el punto inicial de la arista
ja: start_node: エッジの始端と同じノードの ID
sv: start_node: ID för den nod som är densamma som startpunkten för kanten

source: end_node: ID for the node who is the same as the end point of the edge
es: end_node: ID del nodo que es el mismo que el punto final de la arista
ja: end_node: エッジの終端ポイントと同じノードの ID
sv: end_node: ID för den nod som är densamma som slutpunkten för kanten

source: left_face: ID of the face on the left of the edge
es: left_face: ID de la cara a la izquierda de la arista
ja: left_face: エッジの左側のフェイスの ID
sv: left_face: ID för ytan till vänster om kanten

source: right_face: ID of the face on the right of the edge
es: right_face: ID de la cara a la derecha de la arista
ja: right_face: エッジの右側のフェイスの ID
sv: right_face: ID för ytan till höger om kanten

source: geom: Geometry of the edge
es: geom: Geometría de la arista
ja: geom: エッジのジオメトリ
sv: geom: Geometri för kanten

source: Abs Next Edge & Next Edge
es: Siguientes Aristas
ja: Abs Next Edge と Next Edge

source: The table edge_data has the columns abs_next_left_edge and abs_next_right_edge, at this moment it gets a little tricky how to interpret it.
es: La tabla edge_data tiene las columnas abs_next_left_edge y abs_next_right_edge. En este momento se vuelve un poco complicado cómo interpretarlas.
ja: edge_data テーブルには abs_next_left_edge と abs_next_right_edge というカラムがあります。この場では、少しトリッキーに解釈します。
sv: Tabellen edge_data har kolumnerna abs_next_left_edge och abs_next_right_edge, och nu blir det lite knepigt att tolka dem.

source: Until now we mainly see properties of the edge itself and what has on the sides, the next edge properties are different, do not ask only about the edge itself, it is about which is the next edge who builds the face on the right or left.
es: Hasta ahora hemos visto principalmente propiedades de la arista en sí y lo que tiene a los lados. Las propiedades de la arista siguiente son diferentes, no preguntan solo por la arista en sí, sino por cuál es la siguiente arista que construye la cara a la derecha o izquierda.
ja: 今まで主にエッジ自体のプロパティと、左側や右側にあるものを見ていましたが、next edge (次のエッジ) プロパティは違います。エッジ自体の情報ではなく、左側化右側のフェイスを構築する、次のエッジに関する情報が入ります。
sv: Hittills har vi främst sett egenskaper hos själva kanten och vad som har på sidorna, nästa kants egenskaper är annorlunda, fråga inte bara om själva kanten, det handlar om vilken som är nästa kant som bygger ytan till höger eller vänster.

source: The logic of the right_edge and the left_edge are very similar, so we will look first on the left one deeper and then show the right one.
es: La lógica de right_edge y left_edge es muy similar, así que primero veremos más a fondo la izquierda y luego mostraremos la derecha.
ja: right_edge と left_edge のロジックはよく似ているので、先に左側を掘り下げて見て、そのあとで右側を見ます。
sv: Logiken för höger_kant och vänster_kant är mycket lika, så vi kommer först att titta på den vänstra djupare och sedan visa den högra.

source: We will be using the next topology as example:
es: Usaremos la siguiente topología como ejemplo:
ja: 例として次のトポロジを使います:
sv: Vi kommer att använda nästa topologi som exempel:

source: Left
es: Izquierda
ja: 左側
sv: Vänster

source: Let's pick as an example the Edge 5, this one has on the Left the Face 2, looking forward which is the next edge who builds the Face 2?
es: Tomemos como ejemplo la Arista 5. Esta tiene a la izquierda la Cara 2. Mirando hacia adelante, ¿cuál es la siguiente arista que construye la Cara 2?
ja: 例として 5番エッジ を取り上げてみましょう。これには、左側に 2番フェイス があります。順方向に見て、このフェイスを構築する次のエッジはどこでしょう?
sv: Låt oss ta Edge 5 som exempel, den här har till vänster Face 2, om vi tittar framåt vilken är nästa edge vem bygger Face 2?

source: This is the Edge 6.
es: Es la Arista 6.
ja: 6番エッジ です。
sv: Det här är Edge 6.

source: Something very important here is the perspective we follow the lines, depending on the Edge direction, is like see the Face clockwise or anticlockwise.
es: Algo muy importante aquí es la perspectiva con la que seguimos las líneas. Dependiendo de la dirección de la Arista, es como ver la Cara en el sentido de las agujas del reloj o en sentido antihorario.
ja: ここで非常に重要なものはラインを追う視点で、これはエッジ方向に依存するもので、フェイスが時計回りか反時計回りかを見るようなものです。
sv: Något mycket viktigt här är perspektivet vi följer linjerna, beroende på kantriktningen, är det som att se detta face medurs eller moturs.

source: With this information we have abs_next_left_edge which will be 6.
es: Con esta información tenemos que abs_next_left_edge será 6.
ja: この情報で、abs_next_left_edge が 6 になるのが分かります。
sv: Med denna information har vi abs_next_left_edge som kommer att vara 6.

source: The next_left_edge is almost the same as abs_next_left_edge, except it can be negative which depends on the perspective we see the edge.
es: La next_left_edge es casi la misma que abs_next_left_edge, excepto que puede ser negativa, lo cual depende de la perspectiva con la que vemos la arista.
ja: next_left_edge は abs_next_left_edge とほぼ同じですが、エッジを見る視点によっては負数になることがあります。
sv: next_left_edge är nästan samma sak som abs_next_left_edge, förutom att den kan vara negativ, vilket beror på vilket perspektiv vi ser kanten från.

source: If we follow the Edge perspective we will have two directions, the direction of the next edge, and the direction of the perspective on the next edge.
es: Si seguimos la perspectiva de la Arista, tendremos dos direcciones: la dirección de la siguiente arista, y la dirección de la perspectiva en la siguiente arista.
ja: エッジ視点を追いかける場合には、次のエッジの方向と、次のエッジに来た時の視点での方向との二つの方向があります。
sv: Om vi följer Edge-perspektivet kommer vi att ha två riktningar, riktningen mot nästa kant och riktningen för perspektivet på nästa kant.

source: We will use the next sign in each case:
es: Usaremos el siguiente signo en cada caso:
ja: 次のエッジの符号は次のように使われます:
sv: Vi kommer att använda nästa tecken i varje fall:

source: Perspective direction and Next edge direction are opposed: "-"
es: La dirección de la perspectiva y la dirección de la siguiente arista son opuestas: "-"
ja: 視点方向と次のエッジの方向が違う: "-"
sv: Perspektivriktning och riktning mot nästa kant är motsatta: "-"

source: Perspective direction and Next edge direction are the same: None, keep the value positive
es: La dirección de la perspectiva y la dirección de la siguiente arista son las mismas: Ninguno, mantener el valor positivo
ja: 視点方向と次のエッジの方向が同じ: 符号なし、正の数のまま
sv: Perspektivriktningen och Next edge-riktningen är desamma: None, behåll värdet positivt

source: How the Perspective and Edge 6 have the same direction, next_left_edge will be 6.
es: Como la Perspectiva y la Arista 6 tienen la misma dirección, next_left_edge será 6.
ja: 視点と 6番エッジ は同じ方向なので、next_left_edge は 6 です。
sv: Eftersom perspektivet och Edge 6 har samma riktning kommer next_left_edge att vara 6.

source: Right
es: Derecha
ja: 右側
sv: Höger

source: The only difference between Left and Right analysis is the perspective, while in Left we use forward, in Right we will see backwards. Be careful, even if we look backwards the definition of Left Face and Right Face are still the same, looking forward! Only changes the perspective to follow.
es: La única diferencia entre el análisis Izquierda y Derecha es la perspectiva. Mientras que en Izquierda usamos hacia adelante, en Derecha veremos hacia atrás. Ten cuidado: incluso si miramos hacia atrás, la definición de Cara Izquierda y Cara Derecha sigue siendo la misma, mirando hacia adelante. Solo cambia la perspectiva a seguir.
ja: 左側分析と右側分析との違いは視点だけです。左側解析では順方向ですが、右側解析では逆方向です。逆方向に見ていたとしても左側フェイスの定義と右側フェイスの定義は、順方向で見るのと同じことに注意してください。エッジを追う視点だけが変わります。
sv: Den enda skillnaden mellan vänster och höger analys är perspektivet, medan vi i vänster använder framåt, kommer vi i höger att se bakåt. Var försiktig, även om vi tittar bakåt är definitionen av Left Face och Right Face fortfarande densamma, framåtblickande! Det är bara perspektivet som ändras.

source: The Edge 5 has the Face 0 on its Right, the Universal Face, looking Edge 5 backwards the next edge who builds Face 0 is the Edge 4.
es: La Arista 5 tiene la Cara 0 a su derecha, la Cara Universal. Mirando la Arista 5 hacia atrás, la siguiente arista que construye la Cara 0 es la Arista 4.
ja: 5番エッジ の右側に 0番フェイス すなわちユニバーサルフェイスがあります。5番エッジ を逆方向に見ると 0版エッジ を構築する次のエッジは 4番エッジ です。
sv: Edge 5 har Face 0 på sin högra sida, Universal Face, om man tittar Edge 5 bakåt är nästa kant som bygger Face 0 Edge 4.

source: Following the perspective of Edge 5 on Edge 4 we can see it goes up, while the Edge 4 goes down, the Perspective direction and the Edge 4 direction are opposed.
es: Siguiendo la perspectiva de la Arista 5 en la Arista 4, vemos que va hacia arriba, mientras que la Arista 4 va hacia abajo. La dirección de la Perspectiva y la dirección de la Arista 4 son opuestas.
ja: 4番エッジ 上で 5番エッジ の順方向の視点で見ると、4番エッジ が下に進み、視点方向と 4番エッジ の方向とが逆になります。
sv: Om vi följer perspektivet för Edge 5 på Edge 4 kan vi se att den går upp, medan Edge 4 går ner, perspektivets riktning och Edge 4:s riktning är motsatta.

source: next_right_edge: -4 (Perspective direction and Edge 4 direction are opposed)
es: next_right_edge: -4 (La dirección de la Perspectiva y la dirección de la Arista 4 son opuestas)
