Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/tuning.po
Languages: es, sv

source: Basic PostgreSQL Tuning
es: Afinamiento Básico de PostgreSQL
sv: Grundläggande PostgreSQL-tuning

source: PostgreSQL is a very versatile database system, capable of running efficiently in very low-resource environments and environments shared with a variety of other applications. In order to ensure it will run properly for many different environments, the default configuration is very conservative and not terribly appropriate for a high-performance production database. Add the fact that geospatial databases have different usage patterns, and the data tend to consist of fewer, much larger records than non-geospatial databases, and you can see that the default configuration will not be totally appropriate for our purposes.
es: PostgreSQL es un sistema de bases de datos muy versátil, capaz de ejecutarse de manera eficiente en entornos de muy bajos recursos y en entornos compartidos con una variedad de otras aplicaciones. Para garantizar que funcione correctamente en muchos entornos diferentes, la configuración predeterminada es muy conservadora y no resulta del todo adecuada para una base de datos de producción de alto rendimiento. Si añadimos el hecho de que las bases de datos geoespaciales tienen diferentes patrones de uso, y los datos tienden a consistir en menos registros pero mucho más grandes que en bases de datos no geoespaciales, se puede ver que la configuración por defecto no será totalmente apropiada para nuestros propósitos.
sv: PostgreSQL är ett mycket mångsidigt databassystem som kan köras effektivt i miljöer med mycket låga resurser och miljöer som delas med en mängd andra applikationer. För att säkerställa att den körs korrekt för många olika miljöer är standardkonfigurationen mycket konservativ och inte särskilt lämplig för en högpresterande produktionsdatabas. Lägg till det faktum att geospatiala databaser har andra användningsmönster och att data tenderar att bestå av färre, mycket större poster än icke-geospatiala databaser, så kan du se att standardkonfigurationen inte kommer att vara helt lämplig för våra syften.

source: All of these configuration parameters can edited in the `postgresql.conf` database configuration file. This is a regular text file and can be edited using any text editor. The changes will not take effect until the server is restarted.
es: Todos estos parámetros de configuración pueden editarse en el archivo de configuración de la base de datos postgresql.conf. Este es un archivo de texto normal y puede editarse con cualquier editor de texto. Los cambios no tendrán efecto hasta que se reinicie el servidor.
sv: Alla dessa konfigurationsparametrar kan redigeras i databasens konfigurationsfil `postgresql.conf`. Detta är en vanlig textfil som kan redigeras med valfri textredigerare. Ändringarna träder inte i kraft förrän servern startas om.

source: This section describes some of the configuration parameters that can be adjusted for a more production-ready geospatial database.
es: Esta sección describe algunos de los parámetros de configuración que pueden ajustarse para una base de datos geoespacial más preparada para producción.
sv: I det här avsnittet beskrivs några av de konfigurationsparametrar som kan justeras för att få en mer produktionsklar geospatial databas.

source: These values are recommendations only; each environment will differ and testing is required to determine the optimal configuration. But this section should get you off to a good start.
es: Estos valores son solo recomendaciones; cada entorno será diferente y se requiere hacer pruebas para determinar la configuración óptima. Pero esta sección debería servirte como un buen punto de partida.
sv: Dessa värden är endast rekommendationer; varje miljö kommer att skilja sig åt och tester krävs för att fastställa den optimala konfigurationen. Men det här avsnittet bör ge dig en bra start.

source: Sets the amount of memory the database server uses for shared memory buffers. These are shared amongst the back-end processes, as the name suggests. The default values are typically woefully inadequate for production databases.
es: Define la cantidad de memoria que el servidor de base de datos utiliza para los búferes de memoria compartida. Estos se comparten entre los procesos de back-end, como su nombre lo indica. Los valores predeterminados suelen ser totalmente inadecuados para bases de datos en producción.
sv: Ställer in mängden minne som databasservern använder för delade minnesbuffertar. Dessa delas mellan back-end-processerna, som namnet antyder. Standardvärdena är vanligtvis helt otillräckliga för produktionsdatabaser.

source: *Default value*: typically 32MB
es: *Default value*: típicamente 32MB
sv: *Standardvärde*: vanligtvis 32 MB

source: *Recommended value*: about 75% of database memory up to a max of about 2GB
es: *Recommended value*: alrededor del 75% de la memoria de la base de datos hasta un máximo de aproximadamente 2GB
sv: *Rekommenderat värde*: ca 75% of databasminne upp till max ca 2GB

source: In addition to the memory PostgreSQL sets aside for ``shared_buffers`` the query planner also takes into account how many disk blocks the operating system may have cached as part of its virtual file system. For systems with large amount of memory, this can be quite large. The ``effective_cache_size`` is approximately the amount of memory on the machine, less the ``shared_buffers``, less the ``work_mem`` times the expected number of connections, less any memory required for any other processes running on the machine, less about 1GB for other random operating system needs. The database will not **use** the extra cache directly, but it will compute plans expecting that the operating system has cached filesystem data in about that much memory.
es: Además de la memoria que PostgreSQL reserva para shared_buffers, el planificador de consultas también tiene en cuenta cuántos bloques de disco puede haber almacenado en caché el sistema operativo como parte de su sistema de archivos virtual. En sistemas con grandes cantidades de memoria, esto puede ser bastante elevado. El effective_cache_size es aproximadamente la cantidad de memoria de la máquina, menos shared_buffers, menos work_mem multiplicado por el número esperado de conexiones, menos cualquier memoria requerida para otros procesos que se estén ejecutando en la máquina, menos alrededor de 1GB para otras necesidades aleatorias del sistema operativo. La base de datos no usará directamente esta memoria adicional como caché, pero calculará planes suponiendo que el sistema operativo ha almacenado en caché datos del sistema de archivos en aproximadamente esa cantidad de memoria.
sv: Förutom det minne som PostgreSQL avsätter för `` delade buffertar `` tar frågeplaneraren också hänsyn till hur många diskblock operativsystemet kan ha cachat som en del av dess virtuella filsystem. För system med stor mängd minne kan detta vara ganska stort. Den "effektiva cachestorleken" är ungefär lika stor som maskinens minne, minus de "delade buffertarna", minus "arbetsminnet" gånger det förväntade antalet anslutningar, minus det minne som krävs för andra processer som körs på maskinen, minus ca 1 GB för andra slumpmässiga behov hos operativsystemet. Databasen kommer inte att **använda** den extra cachen direkt, men den kommer att beräkna planer som förväntar sig att operativsystemet har cachat filsystemdata i ungefär lika mycket minne.

source: *Default value*: typically 4GB
es: *Default value*: típicamente 4GB
sv: *Standardvärde*: typiskt 4GB

source: *Recommended value*: any amount of "free" memory expected to be around under ordinary operating conditions
es: *Recommended value*: cualquier cantidad de memoria “libre” que se espere tener bajo condiciones normales de operación
sv: *Rekommenderat värde*: den mängd "ledigt" minne som förväntas finnas i närheten under normala driftsförhållanden

source: Defines the amount of memory that internal sorting operations, indexing operations and hash tables can consume before the database switches to on-disk files. This value defines the available memory for each operation; complex queries may have several sort or hash operations running in parallel, and each connected session may be executing a query.
es: Define la cantidad de memoria que las operaciones internas de ordenamiento, operaciones de indexación y tablas hash pueden consumir antes de que la base de datos cambie a usar archivos en disco. Este valor define la memoria disponible para cada operación; las consultas complejas pueden tener varias operaciones de ordenamiento o hash ejecutándose en paralelo, y cada sesión conectada puede estar ejecutando una consulta.
sv: Definierar den mängd minne som interna sorteringsoperationer, indexeringsoperationer och hashtabeller kan förbruka innan databasen växlar till filer på disken. Detta värde definierar det tillgängliga minnet för varje operation; komplexa frågor kan ha flera sorterings- eller hashoperationer som körs parallellt, och varje ansluten session kan köra en fråga.

source: As such you must consider how many connections and the complexity of expected queries before increasing this value. The **benefit** to increasing is that the processing of more of these operations, including ORDER BY, and DISTINCT clauses, merge and hash joins, hash-based aggregation and hash-based processing of subqueries, can be accomplished without incurring disk writes. The **cost** of increasing is memory that will be used **per connection**, which can be quite high with production levels of connections.
es: Por lo tanto, debes considerar cuántas conexiones habrá y la complejidad de las consultas esperadas antes de aumentar este valor. El **beneficio** de aumentarlo es el procesamiento de más operaciones —incluyendo cláusulas ORDER BY y DISTINCT, uniones merge y hash, agregaciones basadas en hash y procesamiento de subconsultas con hash— puede realizarse sin incurrir en escrituras a disco. El **costo** de aumentarlo es que la memoria que se usará por conexión, lo que puede ser bastante elevado en niveles de producción con muchas conexiones.
sv: Därför måste du ta hänsyn till hur många anslutningar och hur komplexa de förväntade frågorna är innan du ökar detta värde. Fördelen** med att öka är att fler av dessa operationer, inklusive ORDER BY- och DISTINCT-klausuler, merge- och hash-joins, hash-baserad aggregering och hash-baserad bearbetning av underfrågor, kan utföras utan diskskrivning. Kostnaden** för att öka är minne som kommer att användas **per anslutning**, vilket kan vara ganska högt med produktionsnivåer av anslutningar.

source: *Default value*: 1MB
es: *Valor predeterminado*: 1MB
sv: *Standardvärde*: 1MB

source: *Recommended value*: 32MB
sv: *Rekommenderat värde*: 32 MB

source: Defines the amount of memory used for maintenance operations, including vacuuming, index and foreign key creation. As these operations are not terribly common, a higher value will only exact an occasional cost, and may substantially speed up maintenance activities This parameter can alternately be increased for a single session before the execution of a number of :command:`CREATE INDEX` or :command:`VACUUM` calls as shown below.
es: Define la cantidad de memoria utilizada para operaciones de mantenimiento, incluyendo vaciado (vacuum), creación de índices y de claves foráneas. Como estas operaciones no son muy comunes, un valor más alto solo tendrá un costo ocasional y puede acelerar sustancialmente las actividades de mantenimiento. Este parámetro también puede aumentarse para una sola sesión antes de ejecutar varios :command:CREATE INDEX o :command:VACUUM, como se muestra a continuación.
sv: Definierar mängden minne som används för underhållsoperationer, inklusive dammsugning, skapande av index och främmande nycklar. Eftersom dessa operationer inte är särskilt vanliga kommer ett högre värde bara att medföra en tillfällig kostnad och kan avsevärt påskynda underhållsaktiviteterna Denna parameter kan alternativt ökas för en enda session innan ett antal :command:`CREATE INDEX`- eller :command:`VACUUM`-anrop utförs enligt nedan.

source: *Default value*: 16MB
es: *Valor predeterminado*: 16MB
sv: *Standardvärde*: 16MB

source: *Recommended value*: 128MB
es: *Valor recomendado*: 128MB
sv: *Rekommenderat värde*: 128 MB

source: Sets the amount of memory used for write-ahead log (WAL) data. Write-ahead logs provide a high-performance mechanism for insuring data-integrity. During each change command, the effects of the changes are written first to the WAL files and flushed to disk. Only once the WAL files have been flushed will the changes be written to the data files themselves. This allows the data files to be written to disk in an optimal and asynchronous manner while ensuring that, in the event of a crash, all data changes can be recovered from the WAL.
es: Define la cantidad de memoria utilizada para los registros de escritura anticipada (WAL, write-ahead log). Los WAL proporcionan un mecanismo de alto rendimiento para garantizar la integridad de los datos. Durante cada comando de modificación, los efectos de los cambios se escriben primero en los archivos WAL y se vacían en el disco. Solo una vez que los archivos WAL se han vaciado, los cambios se escriben en los archivos de datos. Esto permite que los archivos de datos se escriban en el disco de manera óptima y asíncrona, asegurando que, en caso de un fallo, todos los cambios de datos puedan recuperarse a partir del WAL.
sv: Anger hur mycket minne som används för WAL-data (Write-Ahead Log). Write-ahead-loggar ger en högpresterande mekanism för att säkerställa dataintegritet. Under varje ändringskommando skrivs effekterna av ändringarna först till WAL-filerna och rensas sedan till disk. Först när WAL-filerna har rensats skrivs ändringarna till själva datafilerna. Detta gör att datafilerna kan skrivas till disken på ett optimalt och asynkront sätt samtidigt som det säkerställs att alla dataändringar kan återställas från WAL-filen i händelse av en krasch.

source: The size of this buffer only needs to be large enough to hold WAL data for a single typical transaction. While the default value is often sufficient for most data, geospatial data tends to be much larger. Therefore, it is recommended to increase the size of this parameter.
es: El tamaño de este búfer solo necesita ser lo suficientemente grande para contener los datos WAL de una transacción típica. Aunque el valor predeterminado suele ser suficiente para la mayoría de los datos, los datos geoespaciales tienden a ser mucho más grandes. Por lo tanto, se recomienda aumentar el tamaño de este parámetro.
sv: Storleken på denna buffert behöver bara vara tillräckligt stor för att rymma WAL-data för en enda typisk transaktion. Standardvärdet är ofta tillräckligt för de flesta data, men geospatiala data tenderar att vara mycket större. Därför rekommenderas att du ökar storleken på den här parametern.

source: *Default value*: 64kB
es: *Valor predeterminado*: 64kB
sv: *Standardvärde*: 64kB

source: *Recommended value*: 1MB
es: *Valor recomendado*: 1MB
sv: *Rekommenderat värde*: 1 MB

source: checkpoint_segments
sv: checkpoint_segment

source: This value sets the maximum number of log file segments (typically 16MB) that can be filled between automatic WAL checkpoints. A WAL checkpoint is a point in the sequence of WAL transactions at which it is guaranteed that the data files have been updated with all information before the checkpoint. At this time all dirty data pages are flushed to disk and a checkpoint record is written to the log file. This allows the crash recovery process to find the latest checkpoint record and apply all following log segments to complete the data recovery.
es: Este valor define el número máximo de segmentos de archivo de registro (típicamente 16MB) que pueden llenarse entre puntos de control automáticos de WAL (checkpoints). Un punto de control es un punto en la secuencia de transacciones WAL en el que se garantiza que los archivos de datos se han actualizado con toda la información anterior al punto de control. En ese momento, todas las páginas de datos sucias se vacían al disco y se escribe un registro de punto de control en el archivo de log. Esto permite que el proceso de recuperación tras un fallo encuentre el último registro de punto de control y aplique todos los segmentos posteriores para completar la recuperación de datos.
sv: Detta värde anger det maximala antalet loggfilssegment (vanligtvis 16 MB) som kan fyllas mellan automatiska WAL-kontrollpunkter. En WAL-kontrollpunkt är en punkt i sekvensen av WAL-transaktioner där det garanteras att datafilerna har uppdaterats med all information före kontrollpunkten. Vid denna tidpunkt spolas alla smutsiga datasidor till disken och en kontrollpunktspost skrivs till loggfilen. Detta gör det möjligt för crash recovery-processen att hitta den senaste checkpoint-posten och använda alla följande loggsegment för att slutföra dataåterställningen.

source: Because the checkpoint process requires the flushing of all dirty data pages to disk, it creates a significant I/O load. The same argument from above applies; geospatial data is large enough to unbalance non-geospatial optimizations. Increasing this value will prevent excessive checkpoints, though it may cause the server to restart more slowly in the event of a crash.
es: Como el proceso de punto de control requiere vaciar todas las páginas de datos sucias al disco, crea una carga de E/S significativa. El mismo argumento anterior aplica aquí: los datos geoespaciales son lo bastante grandes para desequilibrar las optimizaciones no geoespaciales. Aumentar este valor evitará puntos de control excesivos, aunque puede hacer que el servidor tarde más en reiniciarse en caso de fallo.
sv: Eftersom checkpoint-processen kräver att alla smutsiga datasidor spolas över till disk, skapar den en betydande I/O-belastning. Samma argument som ovan gäller; geospatiala data är tillräckligt stora för att skapa obalans i optimeringar som inte är geospatiala. Om du ökar det här värdet förhindras överdrivna kontrollpunkter, men det kan leda till att servern startar om långsammare vid en krasch.

source: *Default value*: 3
es: *Valor predeterminado*: 3
sv: *Standardvärde*: 3

source: *Recommended value*: 6
es: *Valor recomendado*: 6
sv: *Rekommenderat värde*: 6

source: random_page_cost
sv: slumpmässig_sidkostnad

source: This is a unit-less value that represents the cost of a random page access from disk. This value is relative to a number of other cost parameters including sequential page access, and CPU operation costs. While there is no magic bullet for this value, the default is generally conservative and for databases running on spinning media. The random access cost for SSD should be set even lower.
es: Este es un valor sin unidades que representa el costo de un acceso aleatorio a una página en disco. Este valor es relativo a otros parámetros de costo, incluyendo el acceso secuencial a páginas y los costos de operación de CPU. Aunque no existe un valor único perfecto, el valor predeterminado suele ser conservador y está pensado para bases de datos que funcionan sobre discos mecánicos (spinning media). Para SSD, el costo de acceso aleatorio debería configurarse aún más bajo.
sv: Detta är ett enhetslöst värde som representerar kostnaden för en slumpmässig sidåtkomst från disk. Detta värde är relativt ett antal andra kostnadsparametrar, inklusive sekventiell sidåtkomst och CPU-driftskostnader. Det finns ingen patentlösning för det här värdet, men standardvärdet är i allmänhet konservativt och gäller för databaser som körs på roterande media. Kostnaden för slumpmässig åtkomst för SSD bör sättas ännu lägre.

source: This value can be set on a per-session basis using the ``SET random_page_cost TO 2.0`` command, which can be useful for testing how it effects query plans.
es: Este valor puede establecerse por sesión usando el comando SET random_page_cost TO 2.0, lo cual puede ser útil para probar cómo afecta a los planes de consulta.
sv: Detta värde kan ställas in per session med kommandot ``SET random_page_cost TO 2.0``, vilket kan vara användbart för att testa hur det påverkar frågeplanerna.

source: *Default value*: 4.0
es: Valor predeterminado: 4.0
sv: *Standardvärde*: 4.0

source: *Recommended value*: 2.0 for spinning media, 1.0 for SSD
es: Valor recomendado: 2.0 para discos mecánicos, 1.0 para SSD
sv: *Rekommenderat värde*: 2.0 för roterande media, 1,0 för SSD

source: This is the parameter that controls the cost of a sequential page access. This value does not generally require adjustment but the difference between this value and ``random_page_cost`` greatly affects the choices made by the query planner. This value can also be set on a per-session basis.
es: Este parámetro controla el costo de un acceso secuencial a páginas. Generalmente no requiere ajustes, pero la diferencia entre este valor y random_page_cost afecta en gran medida a las decisiones tomadas por el planificador de consultas. Este valor también puede configurarse por sesión.
sv: Detta är den parameter som styr kostnaden för en sekventiell sidåtkomst. Det här värdet behöver i allmänhet inte justeras, men skillnaden mellan detta värde och ``random_page_cost`` påverkar i hög grad de val som görs av frågeplaneraren. Detta värde kan också ställas in per session.

source: *Default value*: 1.0
es: Valor predeterminado: 1.0
sv: *Standardvärde*: 1.0

source: *Recommended value*: 1.0
es: Valor recomendado: 1.0
sv: *Rekommenderat värde*: 1.0

source: Reload configuration
es: Recargar configuración
sv: Ladda om konfigurationen

source: After these changes are made, save changes and reload the configuration. The easiest way to do this is to restart the PostgreSQL service.
es: Después de realizar estos cambios, guarda y recarga la configuración. La forma más sencilla de hacerlo es reiniciando el servicio de PostgreSQL.
sv: När dessa ändringar har gjorts sparar du ändringarna och laddar om konfigurationen. Det enklaste sättet att göra detta är att starta om PostgreSQL-tjänsten.

source: In pgAdmin, right-click the server **PostGIS (localhost:5432)** and select *Disconnect*.
es: En pgAdmin, haz clic derecho en el servidor **PostGIS (localhost:5432)** y selecciona *Disconnect*.
sv: I pgAdmin högerklickar du på servern **PostGIS (localhost:5432)** och väljer *Disconnect*.

source: In Windows Services (``services.msc``) right-click **PostgreSQL** and select *Restart*.
es: En Servicios de Windows (services.msc), haz clic derecho en **PostgreSQL** y selecciona *Restart*.
sv: I Windows Services (``services.msc``) högerklickar du på **PostgreSQL** och väljer *Restart*.

source: Back in pgAdmin, click the server again select *Disconnect*.
es: De vuelta en pgAdmin, haz clic nuevamente en el servidor y selecciona *Disconnect*.
sv: Tillbaka i pgAdmin klickar du på servern igen och väljer *Disconnect*.
