Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/upgrades.po
Languages: es, sv, uk, zh_hans

source: Software Upgrades
es: Actualizaciones del Software
sv: Uppgraderingar av programvara
uk: Оновлення програмного забезпечення
zh_hans: 软件升级

source: Because PostGIS resides within PostgreSQL every PostGIS installation actually consists of two versions of software: the PostgreSQL version and the PostGIS version. As a general principle, each version of PostGIS can be theoretically run within a number of versions of PostgreSQL, and vice versa.
es: Dado que PostGIS reside dentro de PostgreSQL, cada instalación de PostGIS consta en realidad de dos versiones de software: la versión de PostgreSQL y la versión de PostGIS. Como principio general, cada versión de PostGIS puede ejecutarse teóricamente dentro de varias versiones de PostgreSQL, y viceversa.
sv: Eftersom PostGIS finns inom PostgreSQL består varje PostGIS-installation faktiskt av två versioner av programvara: PostgreSQL-versionen och PostGIS-versionen. Som en allmän princip kan varje version av PostGIS teoretiskt köras inom ett antal versioner av PostgreSQL och vice versa.
uk: Оскільки PostGIS знаходиться всередині PostgreSQL, кожна інсталяція PostGIS фактично складається з двох версій програмного забезпечення: версії PostgreSQL та версії PostGIS. Як загальне правило, кожна версія PostGIS теоретично може працювати в декількох версіях PostgreSQL і навпаки.
zh_hans: 由于PostGIS内置于PostgreSQL中，因此每个PostGIS安装实际上包含两个软件版本：PostgreSQL版本和PostGIS版本。通常来说，每个PostGIS版本理论上可以兼容多个PostgreSQL版本运行，反之亦然。

source: In practice, the exact version pair available will be dictated by the packager who has built your PostgreSQL distribution. Most Linux packages includes a couple PostGIS versions for each PostgreSQL version release, allowing the parts to be upgraded either independently or simultaneously, depending on your preferences.
es: En la práctica, el par de versiones disponibles será dictado por el gestor de paquetes de instalación que ha construido su distribución PostgreSQL. La mayoría de los paquetes de Linux incluyen un par de versiones de PostGIS para cada versión de PostgreSQL, permitiendo que las partes se actualicen de forma independiente o simultánea, dependiendo de sus preferencias.
sv: I praktiken kommer det exakta versionsparet som finns tillgängligt att dikteras av förpackaren som har byggt din PostgreSQL-distribution. De flesta Linux-paket innehåller ett par PostGIS-versioner för varje PostgreSQL-version, vilket gör att delarna kan uppgraderas antingen oberoende eller samtidigt, beroende på dina önskemål.
uk: На практиці точна версія буде залежати від розробника, який створив ваш дистрибутив PostgreSQL. Більшість пакетів для Linux містять кілька версій PostGIS для кожної версії PostgreSQL, що дозволяє оновлювати компоненти окремо або одночасно, залежно від ваших уподобань.
zh_hans: 实际可用的版本组合取决于您使用的PostgreSQL发行版的打包者。大多数Linux软件包会为每个PostgreSQL版本提供多个PostGIS版本选项，允许根据需求选择独立升级或同步升级各个组件。

source: Upgrades can be considered in terms of upgrading each component.
es: Las actualizaciones pueden considerarse en términos de actualizar cada componente.
sv: Uppgraderingar kan betraktas som en uppgradering av varje komponent.
uk: Оновлення можна розглядати з точки зору модернізації кожного компонента.
zh_hans: 组件级升级方案可按以下维度规划。

source: Upgrading PostgreSQL
es: Actualizando PostgreSQL
sv: Uppgradering av PostgreSQL
uk: Оновлення PostgreSQL
zh_hans: 升级PostgreSQL

source: There are two kinds of PostgreSQL upgrade scenarios:
es: Existen dos tipos de escenarios de actualización de PostgreSQL:
sv: Det finns två typer av PostgreSQL-uppgraderingsscenarier:
uk: Існує два типи сценаріїв оновлення PostgreSQL:
zh_hans: PostgreSQL 升级场景分为两种类型：

source: A "minor upgrade" when the software version increases at the "patch" level. For example, from 8.4.3 to 8.4.4, or from 9.0.1 to 9.0.3. Increases of more than one patch version are just fine. Minor upgrades fix bugs but do not add any new features or change behaviour.
es: Una "actualización menor" cuando la versión del software aumenta a nivel de "parche". Por ejemplo, de 8.4.3 a 8.4.4, o de 9.0.1 a 9.0.3. Aumentos de más de una versión de parche también están bien. Las actualizaciones menores corrigen errores pero no agregan nuevas características ni cambian el comportamiento.
sv: En "mindre uppgradering" när programvaruversionen ökar på "patch"-nivå. Till exempel från 8.4.3 till 8.4.4, eller från 9.0.1 till 9.0.3. Ökningar med mer än en patchversion är helt okej. Mindre uppgraderingar åtgärdar buggar men lägger inte till några nya funktioner eller ändrar beteendet.
uk: «Незначне оновлення» — це підвищення версії програмного забезпечення на рівень «патча». Наприклад, з 8.4.3 до 8.4.4 або з 9.0.1 до 9.0.3. Підвищення на кілька версій патча є цілком прийнятним. Незначні оновлення виправляють помилки, але не додають нових функцій і не змінюють поведінку програми.
zh_hans: 当软件版本在「补丁」级别更新时，即构成「次要版本升级」。例如从 8.4.3 升级到 8.4.4，或从 9.0.1 升级到 9.0.3（支持跨多个补丁版本升级）。此类升级仅修复漏洞，不引入新功能或改变系统行为。

source: A "major upgrade" when the "major" or "minor" versions increase. For example, from 8.4.5 to 9.0.0, or from 9.0.5 to 9.1.1. Major upgrades add new features and change behavior.
es: Una "actualización mayor" cuando aumentan las versiones "mayor" o "menor". Por ejemplo, de 8.4.5 a 9.0.0, o de 9.0.5 a 9.1.1. Las actualizaciones mayores agregan nuevas características y cambian el comportamiento.
sv: En "större uppgradering" när "större" eller "mindre" versioner ökar. Till exempel från 8.4.5 till 9.0.0, eller från 9.0.5 till 9.1.1. Större uppgraderingar lägger till nya funktioner och ändrar beteende.
uk: «Значне оновлення», коли збільшується «основна» або «додаткова» версія. Наприклад, з 8.4.5 до 9.0.0 або з 9.0.5 до 9.1.1. Значні оновлення додають нові функції та змінюють поведінку.
zh_hans: 当「主版本」或「次版本」号增加时即构成「主版本升级」。例如从 8.4.5 升级到 9.0.0，或从 9.0.5 升级到 9.1.1。此类升级将引入新特性并可能改变系统行为。

source: Minor PostgreSQL Upgrades
es: Actualizaciones menores de PostgreSQL
sv: Mindre uppgraderingar av PostgreSQL
uk: Незначні оновлення PostgreSQL
zh_hans: PostgreSQL 次要版本升级

source: For "minor upgrades", no special process is necessary. Simply install the new software, and re-start the server.
es: Para las "actualizaciones menores", no es necesario un proceso especial. Simplemente instala el nuevo software y reinicia el servidor.
sv: För "mindre uppgraderingar" behövs ingen särskild process. Installera helt enkelt den nya programvaran och starta om servern.
uk: Для «незначних оновлень» спеціальних процедур не потрібно. Просто встановіть нове програмне забезпечення та перезапустіть сервер.
zh_hans: "次要版本升级"，无需特殊操作流程。只需安装新版本软件并重启服务器即可。

source: Major PostgreSQL Upgrades
es: Actualizaciones mayores de PostgreSQL
sv: Stora uppgraderingar av PostgreSQL
uk: Значні оновлення PostgreSQL
zh_hans: PostgreSQL 主版本升级

source: For "major upgrades" there are two ways to carry out the upgrade.
es: Para las "actualizaciones mayores" hay dos formas de llevar a cabo la actualización.
sv: För "större uppgraderingar" finns det två sätt att genomföra uppgraderingen.
uk: Для «значних оновлень» існує два способи виконання оновлення.
zh_hans: 对于"主版本升级"，存在两种升级方式。

source: Dump/Restore
es: Volacdo(Dump)/Restaurar
sv: Dumpning/återställning
uk: Вивантаження/відновлення
zh_hans: 备份/恢复

source: Dumping and restoring involves converting all the data to a platform neutral format (text representations) on dump, and back to native representations on restore, so it can be time consuming and CPU intensive. However, if you are migrating to a new architecture or operating system, it's a required process. It's also a time-tested and well-understood upgrade path, so if your database is not too big, there's no reason not to stick with it.
es: Volcar y restaurar implica convertir todos los datos a un formato neutral de plataforma (representaciones de texto) al hacer el volcado, y de vuelta a representaciones nativas al restaurar, por lo que puede consumir tiempo y ser intensivo en CPU. Sin embargo, si estás migrando a una nueva arquitectura o sistema operativo, es un proceso requerido. También es una ruta de actualización probada y bien entendida, así que si tu base de datos no es demasiado grande, no hay razón para no seguir con ella.
sv: Dumpning och återställning innebär att alla data konverteras till ett plattformsneutralt format (textrepresentationer) vid dumpning och tillbaka till ursprungliga representationer vid återställning, så det kan vara tidskrävande och CPU-intensivt. Men om du migrerar till en ny arkitektur eller ett nytt operativsystem är det en nödvändig process. Det är också en tidtestad och välkänd uppgraderingsväg, så om din databas inte är för stor finns det ingen anledning att inte hålla fast vid den.
uk: Створення резервної копії та відновлення передбачає перетворення всіх даних у платформонезалежний формат (текстові представлення) під час створення резервної копії та повернення до вихідних представлень під час відновлення, що може бути трудомістким і вимагати значних ресурсів процесора. Однак, якщо ви переходите на нову архітектуру або операційну систему, це необхідний процес. Це також перевірений часом і добре зрозумілий шлях оновлення, тому, якщо ваша база даних не надто велика, немає причин відмовлятися від нього.
zh_hans: 备份与恢复操作需要将全部数据转为平台无关格式（文本表示）进行转储，并在恢复时重新转换为原生格式，因此可能耗时较长且消耗CPU资源。但若需迁移至新硬件架构或操作系统，此流程必不可少。作为经过时间验证的可靠升级方案，只要数据库规模适中，该方式始终是稳妥选择。

source: Dump your data ``pg_dumpall`` from the old database.
es: Vuelca tus datos con ``pg_dumpall`` desde la base de datos antigua.
sv: Dumpa dina data ``pg_dumpall`` från den gamla databasen.
uk: Вивантажте дані ``pg_dumpall`` зі старої бази даних.
zh_hans: 将旧数据库中的数据通过 ``pg_dumpall`` 命令进行完整转储。

source: Install the new version of PostgreSQL and the same version of PostGIS you are using in your old database. You need to match the PostGIS version so that the dump file function definitions reference an expected version of the PostGIS library.
es: Instala la nueva versión de PostgreSQL y la misma versión de PostGIS que estás usando en tu base de datos antigua. Necesitas que coincida la versión de PostGIS para que las definiciones de funciones en el archivo de volcado hagan referencia a la versión esperada de la biblioteca PostGIS.
sv: Installera den nya versionen av PostgreSQL och samma version av PostGIS som du använder i din gamla databas. Du måste matcha PostGIS-versionen så att funktionsdefinitionerna för dumpfilen refererar till en förväntad version av PostGIS-biblioteket.
uk: Встановіть нову версію PostgreSQL та ту саму версію PostGIS, яку ви використовуєте у старій базі даних. Версії PostGIS повинні збігатися, щоб функції файлу дампа посилалися на очікувану версію бібліотеки PostGIS.
zh_hans: 安装新版本 PostgreSQL 及与旧数据库完全一致的 PostGIS 版本。必须保持 PostGIS 版本匹配，以确保转储文件中的函数定义能正确关联到预期版本的 PostGIS 库。

source: Initialize the new data area using the ``initdb`` program from the new software.
es: Inicializa la nueva área de datos usando el programa ``initdb`` del nuevo software.
sv: Initialisera det nya dataområdet med hjälp av programmet ``initdb`` från den nya programvaran.
uk: Ініціалізуйте нову область даних за допомогою програми ``initdb`` з нового програмного забезпечення.
zh_hans: 使用新版本软件中的 ``initdb``程序初始化数据存储区。

source: Start the new server on the new data area.
es: Inicia el nuevo servidor en la nueva área de datos.
sv: Starta den nya servern på det nya dataområdet.
uk: Запустіть новий сервер у новій області даних.
zh_hans: 在新数据存储区启动新版本PostgreSQL服务。

source: Restore the dump file using ``pg_restore``.
es: Restaura el archivo de volcado usando ``pg_restore``.
sv: Återställ dumpfilen med hjälp av ``pg_restore``.
uk: Відновіть файл дампа за допомогою ``pg_restore``.
zh_hans: 使用 ``pg_restore``命令恢复数据库转储文件。

source: The pg_upgrade_ utility allows PostgreSQL data directories to be upgraded without the requirement for a dump/restore step. The utility cannot handle changes to the data files themselves, but handles the more common and frequent changes to system tables that occur in PostgreSQL major upgrades.
es: La utilidad pg_upgrade_ permite que los directorios de datos de PostgreSQL se actualicen sin el requisito de un paso de volcado/restauración. La utilidad no puede manejar cambios en los propios archivos de datos, pero maneja los cambios más comunes y frecuentes en las tablas del sistema que ocurren en las actualizaciones mayores de PostgreSQL.
sv: Verktyget pg_upgrade_ gör att PostgreSQL-datakataloger kan uppgraderas utan krav på ett dumpnings- / återställningssteg. Verktyget kan inte hantera ändringar i själva datafilerna, men hanterar de vanligaste och vanligaste ändringarna i systemtabeller som inträffar i PostgreSQL större uppgraderingar.
uk: Утиліта pg_upgrade_ дозволяє оновлювати каталоги даних PostgreSQL без необхідності виконання кроків зливу/відновлення. Утиліта не може обробляти зміни в самих файлах даних, але обробляє більш поширені та часті зміни в системних таблицях, які відбуваються під час основних оновлень PostgreSQL.
zh_hans: pg_upgrade 工具允许直接升级PostgreSQL数据目录，无需进行数据转储/恢复操作。该工具虽无法处理数据文件本身的变更，但能应对PostgreSQL主版本升级中常见的系统表结构变化。

source: The full instructions for running the upgrade process are in the pg_upgrade_ web page at the PostgreSQL site.
es: Las instrucciones completas para ejecutar el proceso de actualización están en la página web de pg_upgrade_ en el sitio de PostgreSQL.
sv: De fullständiga instruktionerna för att köra uppgraderingsprocessen finns på webbsidan pg_upgrade_ på PostgreSQL-webbplatsen.
uk: Повна інструкція щодо виконання процесу оновлення знаходиться на веб-сторінці pg_upgrade_ на сайті PostgreSQL.
zh_hans: PostgreSQL 官网的 pg_upgrade 页面提供了完整的升级操作指南。

source: The pg_upgrade_ program expects to have access to both versions of PostgreSQL it is working with, the old and the new version, so you will have to install them both.
es: El programa pg_upgrade_ espera tener acceso a ambas versiones de PostgreSQL con las que está trabajando, la versión antigua y la nueva, por lo que tendrás que instalar ambas.
sv: Programmet pg_upgrade_ förväntar sig att ha tillgång till båda versionerna av PostgreSQL som det arbetar med, den gamla och den nya versionen, så du måste installera dem båda.
uk: Програма pg_upgrade_ очікує мати доступ до обох версій PostgreSQL, з якими вона працює, старої та нової, тому вам доведеться встановити обидві.
zh_hans: pg_upgrade 程序要求同时访问新旧两个PostgreSQL版本，因此需预先安装这两个版本。

source: Install the new version of PostgreSQL you will be using.
es: Instala la nueva versión de PostgreSQL que vas a usar.
sv: Installera den nya versionen av PostgreSQL som du kommer att använda.
uk: Встановіть нову версію PostgreSQL, яку ви будете використовувати.
zh_hans: 安装待使用的 PostgreSQL 新版本。

source: Install the same version of PostGIS you are using in the old PostgreSQL into the new PostgreSQL.
es: Instala en el nuevo PostgreSQL la misma versión de PostGIS que estabas usando en el PostgreSQL antiguo.
sv: Installera samma version av PostGIS som du använder i den gamla PostgreSQL i den nya PostgreSQL.
uk: Встановіть ту саму версію PostGIS, яку ви використовуєте в старому PostgreSQL, у новий PostgreSQL.
zh_hans: 在新版 PostgreSQL 中安装与旧版本完全相同的 PostGIS 版本。

source: Initialize the new PostgreSQL data area with the new copy of ``initdb``.
es: Inicializa la nueva área de datos de PostgreSQL con la nueva copia de ``initdb``.
sv: Initiera det nya PostgreSQL-dataområdet med den nya kopian av ``initdb``.
uk: Ініціалізуйте нову область даних PostgreSQL за допомогою нової копії ``initdb``.
zh_hans: 使用新版``initdb``初始化 PostgreSQL 数据存储区。

source: Ensure both the old and new PostgreSQL servers are turned off.
es: Asegúrate de que tanto el servidor antiguo como el nuevo de PostgreSQL estén apagados.
sv: Se till att både den gamla och den nya PostgreSQL-servrarna är avstängda.
uk: Переконайтеся, що старий і новий сервери PostgreSQL вимкнені.
zh_hans: 确保新旧 PostgreSQL 服务均处于停止状态。

source: Run pg_upgrade_, making sure to use the binary from the new software installation.
es: Ejecuta pg_upgrade_, asegurándote de usar el binario de la nueva instalación de software.
sv: Kör pg_upgrade_ och se till att använda binärfilen från installationen av den nya programvaran.
uk: Запустіть pg_upgrade_, переконавшись, що використовуєте бінарний файл з нової інсталяції програмного забезпечення.
zh_hans: 执行 pg_upgrade 命令，并确保使用新版本软件安装目录中的二进制文件。

source: If pg_upgrade_ generated any ``.sql`` files, run them now.
es: Si pg_upgrade_ generó algún archivo ``.sql``, ejecútalos ahora.
sv: Om pg_upgrade_ genererade några ``.sql``-filer, kör dem nu.
uk: Якщо pg_upgrade_ створив будь-які файли ``.sql``, запустіть їх зараз.
zh_hans: 若 pg_upgrade 生成任何 ``.sql``脚本文件，请立即执行。

source: Start the new server.
es: Inicia el nuevo servidor.
sv: Starta den nya servern.
uk: Запустіть новий сервер.
zh_hans: 启动新的服务。

source: Upgrading PostGIS
es: Actualización de PostGIS
sv: Uppgradering av PostGIS
uk: Оновлення PostGIS
zh_hans: PostGIS 升级指南

source: PostGIS deals with minor and upgrades through the ``EXTENSION`` mechanism. If you spatially-enabled your database using ``CREATE EXTENSION postgis``, you can update your database using the same functionality.
es: PostGIS maneja las actualizaciones menores y mayores a través del mecanismo de ``EXTENSION``. Si habilitaste espacialmente tu base de datos usando ``CREATE EXTENSION postgis``, puedes actualizar tu base de datos usando la misma funcionalidad.
sv: PostGIS hanterar mindre och uppgraderingar genom mekanismen ``EXTENSION``. Om du spatialt aktiverat din databas med hjälp av ``CREATE EXTENSION postgis``, kan du uppdatera din databas med samma funktionalitet.
uk: PostGIS обробляє незначні оновлення та модернізації за допомогою механізму ``EXTENSION``. Якщо ви надали базі даних просторові можливості за допомогою ``CREATE EXTENSION postgis``, ви можете оновити базу даних за допомогою тієї ж функції.
zh_hans: PostGIS 通过 ``EXTENSION`` 机制处理次要版本与升级。若您曾使用 ``CREATE EXTENSION postgis``命令为数据库启用空间功能，可通过相同机制进行更新。

source: First, install the new software so it is available to the database.
es: Primero, instala el nuevo software para que esté disponible en la base de datos.
sv: Först installerar du den nya programvaran så att den är tillgänglig för databasen.
uk: Спочатку встановіть нове програмне забезпечення, щоб воно було доступне для бази даних.
zh_hans: 首先安装新版 PostgreSQL 软件，确保数据库可调用新版本组件。

source: Then, run the SQL to upgrade your PostGIS extension.
es: Luego, ejecuta el SQL para actualizar tu extensión de PostGIS.
sv: Kör sedan SQL för att uppgradera ditt PostGIS-tillägg.
uk: Потім запустіть SQL, щоб оновити розширення PostGIS.
zh_hans: 随后执行以下SQL命令升级PostGIS扩展。
