Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/validity.po
Languages: es, sv, uk

source: Validity
es: Validez
sv: Validitet
uk: Валідність

source: In 90% of the cases the answer to the question, "why is my query giving me a 'TopologyException' error" is "one or more of the inputs are invalid". Which begs the question: what does it mean to be invalid, and why should we care?
es: En el 90% de los casos, la respuesta a la pregunta "¿por qué mi consulta da un error 'TopologyException'?" es "una o varias de las entradas no son válidas". Lo que nos lleva a preguntarnos: ¿qué significa que no sea válida y por qué debería importarnos?
sv: I 90% o av fallen är svaret på frågan "varför ger min fråga mig ett 'TopologyException'-fel" "en eller flera av ingångarna är ogiltiga". Vilket väcker frågan: vad innebär det att vara ogiltig, och varför ska vi bry oss?
uk: У 90% випадків відповідь на питання «чому мій запит видає помилку «TopologyException»» звучить так: «one or more of the inputs are invalid. Це викликає питання: що означає «invalid» і чому нам слід про це турбуватися?

source: What is Validity
es: Qué es la Validez
sv: Vad är validitet
uk: Що таке валідність

source: Validity is most important for polygons, which define bounded areas and require a good deal of structure. Lines are very simple and cannot be invalid, nor can points.
es: La validez es más importante para los polígonos, que definen áreas delimitadas y requieren mucha estructura. Las líneas son muy sencillas y no pueden ser inválidas, ni tampoco los puntos.
sv: Validitet är viktigast för polygoner, som definierar avgränsade områden och kräver en hel del struktur. Linjer är mycket enkla och kan inte vara ogiltiga, inte heller punkter.
uk: Валідність є найважливішою для полігонів, які визначають обмежені області і вимагають значної структури. Лінії є дуже простими і не можуть бути недійсними, так само як і точки.

source: Some of the rules of polygon validity feel obvious, and others feel arbitrary (and in fact, are arbitrary).
es: Algunas de las reglas de validez de los polígonos parecen obvias y otras arbitrarias (y, de hecho, lo son).
sv: Vissa av reglerna för polygoners giltighet känns självklara, medan andra känns godtyckliga (och faktiskt är godtyckliga).
uk: Деякі правила валідності полігонів здаються очевидними, а інші — довільними (і насправді є довільними).

source: Polygon rings must close.
es: Los anillos del polígono deben cerrarse.
sv: Polygonringar måste stängas.
uk: Полігонми повинні бути замкненими.

source: Rings that define holes should be inside rings that define exterior boundaries.
es: Los anillos que definen agujeros deben estar dentro de los anillos que definen límites exteriores.
sv: Ringar som definierar hål bör vara inuti ringar som definierar yttre gränser.
uk: Кільця, що визначають отвори, повинні знаходитися всередині кілець, що визначають зовнішні межі.

source: Rings may not self-intersect (they may neither touch nor cross themselves).
es: Los anillos no pueden autointersectarse (no pueden tocarse ni cruzarse).
sv: Ringar får inte korsa sig själva (de får varken röra vid eller korsa sig själva).
uk: Кільця не можуть перетинатися між собою (вони не можуть ні стикатися, ні перетинатися).

source: Rings may not touch other rings, except at a point.
es: Los anillos no pueden tocar a otros anillos, excepto en un punto.
sv: Ringarna får inte röra vid andra ringar, utom vid en punkt.
uk: Кільця не можуть торкатися інших кілець, за винятком однієї точки.

source: Elements of multi-polygons may not touch each other.
es: Los elementos de los multipolígonos no pueden tocarse entre sí.
sv: Element i multipolygoner får inte röra vid varandra.
uk: Елементи багатокутників не можуть торкатися один одного.

source: The last three rules are in the arbitrary category. There are other ways to define polygons that are equally self-consistent but the rules above are the ones used by the :term:`OGC` :term:`SFSQL` standard that PostGIS conforms to.
es: Las tres últimas reglas podrían catalogarse como arbitrarias. Hay otras formas de definir polígonos que son igualmente autoconsistentes, pero las reglas anteriores son las utilizadas por el estándar :term:`OGC` :term:`SFSQL` que PostGIS cumple.
sv: De tre sista reglerna är i kategorin godtyckliga. Det finns andra sätt att definiera polygoner som är lika självkonsistenta men reglerna ovan är de som används av :term:`OGC` :term:`SFSQL`-standarden som PostGIS följer.
uk: Останні три правила належать до категорії довільних. Існують інші способи визначення багатокутників, які є рівноцінними, але вищезазначені правила використовуються стандартом :term:`OGC` :term:`SFSQL`, якому відповідає PostGIS.

source: The reason the rules are important is because algorithms for geometry calculations depend on consistent structure in the inputs. It is possible to build algorithms that have no structural assumptions, but those routines tend to be very slow, because the first step in any structure-free routine is to *analyze the inputs and build structure into them*.
es: La razón por la que las reglas son importantes es porque los algoritmos para cálculos geométricos dependen de una estructura consistente en las entradas. Es posible construir algoritmos que no tengan suposiciones estructurales, pero esas rutinas tienden a ser muy lentas, porque el primer paso en cualquier rutina sin estructura es *analizar las entradas y construir estructura en ellas*.
sv: Anledningen till att reglerna är viktiga är att algoritmer för geometriberäkningar är beroende av en konsekvent struktur i indata. Det är möjligt att bygga algoritmer som inte har några strukturella antaganden, men dessa rutiner tenderar att vara mycket långsamma, eftersom det första steget i en strukturfri rutin är att *analysera indata och bygga in struktur i dem*.
uk: Причина, чому правила є важливими, полягає в тому, що алгоритми для обчислень з геометрією залежать від узгодженої структури вхідних даних. Можна створити алгоритми, які не роблять жодних структурних припущень, але такі процедури зазвичай працюють дуже повільно, оскільки першим кроком у будь-якій процедурі без попередньої структури є аналіз вхідних даних і побудова структури в них.

source: Here's an example of why structure matters. This polygon is invalid:
es: He aquí un ejemplo del por qué la estructura importa. Este polígono no es válido:
sv: Här är ett exempel på varför strukturen är viktig. Den här polygonen är ogiltig:
uk: Ось приклад того, чому структура має значення. Цей багатокутник є некоректним:

source: You can see the invalidity a little more clearly in this diagram:
es: Puede ver la invalidez un poco más claramente en este diagrama:
sv: Du kan se ogiltigheten lite tydligare i det här diagrammet:
uk: На цій діаграмі можна трохи чіткіше побачити помилку:

source: The outer ring is actually a figure-eight, with a self-intersection in the middle. Note that the graphic routines successfully render the polygon fill, so that visually it is appears to be an "area": two one-unit squares, so a total area of two units of area.
es: El anillo exterior es en realidad una figura de ocho, con una auto-intersección en el centro. Obsérvese que las rutinas gráficas representan correctamente el relleno del polígono, de modo que visualmente parece un "área": dos cuadrados de una unidad, es decir, un área total de dos unidades de área.
sv: Den yttre ringen är egentligen en åtta, med en självkorsande punkt i mitten. Observera att de grafiska rutinerna lyckas rendera polygonfyllningen, så att det visuellt ser ut som en "yta": två rutor med en enhet, så en total yta på två ytenheter.
uk: Зовнішнє кільце насправді має форму «вісімки» з самоперетином посередині. Зверніть увагу, що графічні процедури успішно відображають заповнення полігону, тож візуально він виглядає як «площа»: два квадрати розміром один на один, тобто загальна площа — дві одиниці.

source: Let's see what the database thinks the area of our polygon is:
es: Veamos cuál cree la base de datos que es el área de nuestro polígono:
sv: Låt oss se vad databasen tror att ytan på vår polygon är:
uk: Давайте подивимося, яку площу нашого багатокутника визначає база даних:

source: What's going on here? The algorithm that calculates area assumes that rings do not self-intersect. A well-behaved ring will always have the area that is bounded (the interior) on one side of the bounding line (it doesn't matter which side, just that it is on *one* side). However, in our (poorly behaved) figure-eight, the bounded area is to the right of the line for one lobe and to the left for the other. This causes the areas calculated for each lobe to cancel out (one comes out as 1, the other as -1) hence the "zero area" result.
es: ¿Qué ocurre aquí? El algoritmo que calcula el área asume que los anillos no se auto-intersecan. Un anillo que se comporte bien siempre tendrá el área delimitada (el interior) a un lado de la línea de delimitación (no importa a qué lado, sólo que sea a *un* lado). Sin embargo, en nuestro (mal comportamiento) ocho, el área delimitada está a la derecha de la línea para un lóbulo y a la izquierda para el otro. Esto hace que las áreas calculadas para cada lóbulo se anulen (una sale como 1, la otra como -1), de ahí el resultado de "área cero".
sv: Vad är det som händer här? Algoritmen som beräknar arean förutsätter att ringar inte skär varandra. En välskött ring kommer alltid att ha det område som avgränsas (det inre) på ena sidan av begränsningslinjen (det spelar ingen roll vilken sida, bara det är på *en* sida). Men i vår (illa skötta) åtta ligger det avgränsade området till höger om linjen för den ena loben och till vänster för den andra. Detta leder till att de ytor som beräknas för varje lob tar ut varandra (den ena blir 1, den andra -1), därav resultatet "noll yta".
uk: Що тут відбувається? Алгоритм, який обчислює площу, передбачає, що кільця не мають самоперетинів. «Правильне» кільце завжди має площу, обмежену (внутрішню частину), розташовану з одного боку від обмежувальної лінії (неважливо, з якого саме боку, головне — що лише з одного). Однак у нашій (неправильно побудованій) «вісімці» обмежена площа для однієї петлі знаходиться праворуч від лінії, а для іншої — ліворуч. Це призводить до того, що обчислені площі для кожної петлі взаємно компенсуються (одна виходить як +1, інша як −1), і в результаті маємо «нульову площу».

source: Detecting Validity
es: Detectando Validez
sv: Detektering av validitet
uk: Визначення валідності

source: In the previous example we had one polygon that we **knew** was invalid. How do we detect invalidity in a table with millions of geometries? With the :command:`ST_IsValid(geometry)` function. Used against our figure-eight, we get a quick answer:
es: En el ejemplo anterior teníamos un polígono que **sabíamos** era inválido. ¿Cómo detectamos la invalidez en una tabla con millones de geometrías? Con la función :command:`ST_IsValid(geometry)`. Usada contra nuestro "ocho", obtenemos una respuesta rápida:
sv: I det föregående exemplet hade vi en polygon som vi **visste** var ogiltig. Hur upptäcker vi ogiltighet i en tabell med miljontals geometrier? Med funktionen :command:`ST_IsValid(geometry)`. När den används mot vår åttonde figur får vi ett snabbt svar:
uk: У попередньому прикладі ми мали один багатокутник, про який **знали**, що він є недійсним. Як виявити недійсність у таблиці з мільйонами геометрій? За допомогою функції :command:`ST_IsValid(geometry)`. Застосувавши її до нашої вісімки, ми отримуємо швидку відповідь:

source: Now we know that the feature is invalid, but we don't know why. We can use the :command:`ST_IsValidReason(geometry)` function to find out the source of the invalidity:
es: Ahora sabemos que la entidad es inválida, pero no sabemos por qué. Podemos usar la función :command:`ST_IsValidReason(geometry)` para encontrar la causa de la invalidez:
sv: Nu vet vi att funktionen är ogiltig, men vi vet inte varför. Vi kan använda funktionen :command:`ST_IsValidReason(geometry)` för att ta reda på källan till ogiltigheten:
uk: Тепер ми знаємо, що об'єкт є недійсним, але не знаємо, чому. Ми можемо використати функцію :command:`ST_IsValidReason(geometry)`, щоб з'ясувати причину недійсності:

source: Note that in addition to the reason (self-intersection) the location of the invalidity (coordinate (1 1)) is also returned.
es: Observa que además de la razón (autointersección) también se devuelve la ubicación de la invalidez (coordenada (1 1)).
sv: Observera att förutom orsaken (självskärning) returneras även platsen för invaliditeten (koordinat (1 1)).
uk: Зверніть увагу, що крім причини (самоперетин) також повертається місце розташування недопустимого елемента (координати (1 1)).

source: We can use the :command:`ST_IsValid(geometry)` function to test our tables too:
es: Podemos usar la función :command:`ST_IsValid(geometry)` para probar nuestras tablas también:
sv: Vi kan också använda funktionen :command:`ST_IsValid(geometry)` för att testa våra tabeller:
uk: Ми також можемо скористатися функцією :command:ST_IsValid(geometry), щоб перевірити наші таблиці:

source: Repairing Invalidity
es: Reparar la no validez
sv: Reparation av invaliditet
uk: Виправлення некоректної геометрії

source: Repairing invalidity involves stripping a polygon down to its simplest structures (rings), ensuring the rings follow the rules of validity, then building up new polygons that follow the rules of ring enclosure. Frequently the results are intuitive, but in the case of extremely ill-behaved inputs, the valid outputs may not conform to your intuition of how they should look. Recent versions of PostGIS include different algorithms for geometry repair: read the `manual page <http://postgis.net/docs/ST_MakeValid.html>`_ carefully and choose the one you like best.
es: La reparación de invalidez implica reducir un polígono a sus estructuras más simples (anillos), asegurando que los anillos sigan las reglas de validez, y luego construir nuevos polígonos que sigan las reglas de encierro de anillos. Frecuentemente los resultados son intuitivos, pero en el caso de entradas extremadamente problemáticas, las salidas válidas pueden no ajustarse a tu intuición de cómo deberían verse. Las versiones recientes de PostGIS incluyen diferentes algoritmos para la reparación de geometrías: lee con cuidado la `página del manual <http://postgis.net/docs/ST_MakeValid.html>`_ y elige el que más te guste.
sv: Reparation av ogiltighet innebär att en polygon strippas ner till sina enklaste strukturer (ringar), att ringarna följer giltighetsreglerna och att nya polygoner byggs upp som följer reglerna för inneslutning av ringar. Ofta är resultaten intuitiva, men i fallet med extremt olämpliga indata kanske de giltiga utdata inte överensstämmer med din intuition om hur de borde se ut. De senaste versionerna av PostGIS innehåller olika algoritmer för geometrireparation: läs `manualsidan <http://postgis.net/docs/ST_MakeValid.html>`_ noggrant och välj den du tycker bäst om.
uk: Виправлення некоректної геометрії передбачає розбиття полігону на його найпростіші структури (кільця), перевірку, що кільця відповідають правилам валідації, а потім побудову нових полігонів, що дотримуються правил вкладення/замикання кілець. Часто результати бувають інтуїтивно зрозумілими, але у випадку надто «погано» сформованих вхідних даних валідні вихідні геометрії можуть не відповідати вашому уявленню про те, як вони мали б виглядати. У новіших версіях PostGIS є кілька алгоритмів для відновлення геометрій — уважно прочитайте сторінку довідки ST_MakeValid і виберіть той, який вам підходить.

source: For example, here's a classic invalidity -- the "banana polygon" -- a single ring that encloses an area but bends around to touch itself, leaving a "hole" which is not actually a hole.
es: Por ejemplo, aquí hay un caso clásico de invalidez -- el "polígono banana" -- un único anillo que encierra un área pero se dobla para tocarse a sí mismo, dejando un "agujero" que en realidad no es un agujero.
sv: Här är till exempel en klassisk ogiltighet - "bananpolygonen" - en enda ring som omsluter ett område men böjer sig runt för att röra vid sig själv och lämnar ett "hål" som egentligen inte är ett hål.
uk: Наприклад, ось класичний випадок некоректної геометрії — «банановий полігон» — одне кільце, яке охоплює площу, але вигинається так, що торкається само себе, утворюючи «дірку», яка насправді не є діркою.

source: Running `ST_MakeValid <http://postgis.net/docs/ST_MakeValid.html>`_ on the polygon returns a valid :term:`OGC` polygon, consisting of an outer and inner ring that touch at one point.
es: Ejecutar `ST_MakeValid <http://postgis.net/docs/ST_MakeValid.html>`_ en el polígono devuelve un polígono :term:`OGC` válido, consistente en un anillo exterior e interior que se tocan en un punto.
sv: Om du kör `ST_MakeValid <http://postgis.net/docs/ST_MakeValid.html>`_ på polygonen får du tillbaka en giltig :term:`OGC`-polygon, bestående av en yttre och en inre ring som berör varandra i en punkt.
uk: Виконання команди `ST_MakeValid <http://postgis.net/docs/ST_MakeValid.html>`_ на полігоні повертає валідний полігон :term:`OGC`, що складається з зовнішнього та внутрішнього кілець, які стикаються в одній точці.

source: The "banana polygon" (or "inverted shell") is a case where the :term:`OGC` topology model for valid geometry and the model used internally by ESRI differ. The ESRI model considers rings that touch to be invalid, and prefers the banana form for this kind of shape. The OGC model is the reverse. Neither is "correct", they are just different ways to model the same situation.
es: El "polígono banana" (o "concha invertida") es un caso donde el modelo topológico :term:`OGC` para geometrías válidas y el modelo usado internamente por ESRI difieren. El modelo de ESRI considera inválidos los anillos que se tocan, y prefiere la forma banana para este tipo de figura. El modelo OGC es lo contrario. Ninguno es "correcto", son solo formas diferentes de modelar la misma situación.
sv: "Bananpolygonen" (eller "det inverterade skalet") är ett fall där :term:`OGC` topologimodell för giltig geometri och den modell som används internt av ESRI skiljer sig åt. ESRI-modellen anser att ringar som rör vid varandra är ogiltiga och föredrar bananformen för denna typ av form. OGC-modellen är den omvända. Ingen av dem är "korrekt", de är bara olika sätt att modellera samma situation.
uk: «Банановий полігон» (або «інверсна оболонка») — це випадок, коли топологічна модель валідної геометрії за :term:OGC та модель, яку внутрішньо використовує ESRI, відрізняються. Модель ESRI вважає кільця, що торкаються, некоректними й надає перевагу банановій формі для такого типу фігур. Модель OGC — навпаки. Жодна з них не є «правильною» чи «неправильною» — це просто різні способи моделювання однієї й тієї ж ситуації.

source: Bulk Validity Repair
es: Reparación de invalidez en lote
sv: Reparation av bulkvaliditet
uk: Масове виправлення геометрії

source: Here's an example of SQL to flag invalid geometries for review while adding a repaired version to the table.
es: Aquí hay un ejemplo de SQL para marcar geometrías inválidas para revisión mientras se agrega una versión reparada a la tabla.
sv: Här är ett exempel på SQL för att flagga ogiltiga geometrier för granskning samtidigt som en reparerad version läggs till i tabellen.
uk: Ось приклад SQL-запиту, який позначає некоректні геометрії для перевірки та одночасно додає виправлену версію до таблиці.

source: A good tool for visually repairing invalid geometry is OpenJump (http://openjump.org) which includes a validation routine under **Tools->QA->Validate Selected Layers**.
es: Una buena herramienta para reparar visualmente geometrías inválidas es OpenJump (http://openjump.org) que incluye una rutina de validación en **Tools->QA->Validate Selected Layers**.
sv: Ett bra verktyg för att visuellt reparera ogiltig geometri är OpenJump (http://openjump.org) som innehåller en valideringsrutin under **Tools->QA->Validate Selected Layers**.
uk: Хорошим інструментом для візуального виправлення некоректної геометрії є OpenJump (http://openjump.org), який містить функцію перевірки коректності за шляхом Tools->QA->Validate Selected Layers.

source: Function List
es: Lista de funciones
sv: Funktionslista
uk: Список функцій

source: `ST_IsValid(geometry A) <http://postgis.net/docs/ST_IsValid.html>`_: Returns a boolean indiciting whether the geometery is valid.
es: `ST_IsValid(geometry A) <http://postgis.net/docs/ST_IsValid.html>`_: Devuelve un valor booleano que indica si la geometría es válida.
sv: `ST_IsValid(geometri A) <http://postgis.net/docs/ST_IsValid.html>`_: Returnerar en boolean som anger om geometrin är giltig.
uk: ST_IsValid(geometry A) <http://postgis.net/docs/ST_IsValid.html>_: Повертає булеве значення, яке вказує, чи є геометрія коректною.

source: `ST_IsValidReason(geometry A) <http://postgis.net/docs/ST_IsValidReason.html>`_: Returns a text string with the reason for the invalidity and a coordinate of invalidity.
es: `ST_IsValidReason(geometry A) <http://postgis.net/docs/ST_IsValidReason.html>`_: Devuelve una cadena de texto con la razón de la invalidez y una coordenada de invalidez.
sv: `ST_IsValidReason(geometri A) <http://postgis.net/docs/ST_IsValidReason.html>`_: Returnerar en textsträng med orsaken till ogiltigheten och en koordinat för ogiltigheten.
uk: ST_IsValidReason(geometry A) <http://postgis.net/docs/ST_IsValidReason.html>_: Повертає текстовий рядок із причиною некоректності та координатою, де вона виникає.

source: `ST_MakeValid(geometry A) <http://postgis.net/docs/ST_MakeValid.html>`_: Returns a geometry re-constructed to obey the validity rules.
es: `ST_MakeValid(geometry A) <http://postgis.net/docs/ST_MakeValid.html>`_: Devuelve una geometría reconstruida para cumplir con las reglas de validez.
sv: `ST_MakeValid(geometri A) <http://postgis.net/docs/ST_MakeValid.html>`_: Returnerar en geometri som är omkonstruerad för att följa giltighetsreglerna.
uk: `ST_MakeValid(геометрія A) <http://postgis.net/docs/ST_MakeValid.html>`_: Повертає геометрію, реконструйовану відповідно до правил валідності.
