Repository: adamlaska/postgis-workshops
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/welcome.po
Languages: es, sv

source: Welcome
es: Bienvenido
sv: Välkommen

source: Workshop Conventions
es: Convenciones usadas en el Taller
sv: Workshop-konventioner

source: These sections conform to a number of conventions to make it easier to follow the conversation. This section gives a brief overview of what to expect in the way of typographic conventions, as well as a short overview of the structure of each workbook.
es: Estas secciones se ajustan a una serie de convenciones para facilitar el seguimiento de la interacción. Esta sección ofrece un breve resumen de las convenciones tipográficas y de la estructura de cada cuaderno.
sv: Dessa avsnitt följer ett antal konventioner för att göra det lättare att följa samtalet. I detta avsnitt ges en kort översikt över vad du kan förvänta dig i form av typografiska konventioner, samt en kort översikt över strukturen i varje arbetsbok.

source: Directions
es: Indicaciones
sv: Anvisningar

source: Directions for you, the workshop attendee, will be noted by **bold** font.
es: Las indicaciones para usted, el asistente al taller, se indicarán con letra **negrita**.
sv: Anvisningar för dig som deltar i workshopen markeras med **fett** typsnitt.

source: For example:
es: Por ejemplo:
sv: Till exempel:

source: Click **Next** to continue.
es: Pulse **Siguiente** para continuar.
sv: Klicka på **Nästa** för att fortsätta.

source: Code
es: Código
sv: Kod

source: SQL query examples will be displayed in an offset box
es: Se mostrarán los ejemplos de consultas SQL en un cuadro
sv: Exempel på SQL-frågor visas i en offset-ruta

source: These examples can be entered into the query window or command line interface.
es: Estos ejemplos pueden introducirse en la ventana de consulta o en la interfaz de línea de comandos.
sv: Dessa exempel kan matas in i frågefönstret eller kommandoradsgränssnittet.

source: Notes
es: Notas
sv: Anteckningar

source: Notes are used to provide information that is useful but not critical to the overall understanding of the topic.
es: Las notas se utilizan para proporcionar información útil pero que no es crítica para la comprensión global del tema.
sv: Anteckningar används för att ge information som är användbar men inte avgörande för den övergripande förståelsen av ämnet.

source: If you haven't eaten an apple today, the doctor may be on the way.
es: Si hoy no te has comido una manzana, el médico puede estar de camino.
sv: Om du inte har ätit ett äpple i dag kan läkaren vara på väg.

source: Functions
es: Funciones
sv: Funktioner

source: Where function names are defined in the text, they will be rendered in a :command:`bold` font.
es: Cuando se definan nombres de funciones en el texto, se mostrarán en :command:`bold`.
sv: Om funktionsnamn definieras i texten återges de med teckensnittet :command:`bold`.

source: :command:`ST_Touches(geometry A, geometry B)` returns TRUE if either of the geometries' boundaries intersect
es: :command:`ST_Touches(geometry A, geometry B)` devuelve TRUE si cualquiera de los límites de las geometrías se cruzan
sv: :command:`ST_Touches(geometry A, geometry B)` returnerar TRUE om någon av geometriernas gränser skär varandra

source: Files, Tables and Column Names
es: Archivos, Tablas y Nombres de Columnas
sv: Filer, tabeller och kolumnnamn

source: File names, paths, table names and column names will be shown in ``fixed-width`` font.
es: Los nombres de archivo, las rutas, los nombres de tabla y los nombres de columna se mostrarán en tipo de letra ``monoespaciado``.
sv: Filnamn, sökvägar, tabellnamn och kolumnnamn visas i teckensnitt med "fast bredd".

source: Select the ``name`` column in the ``nyc_streets`` table.
es: Selecciona la columna ``name`` de la tabla ``nyc_streets``.
sv: Välj kolumnen ``name`` i tabellen ``nyc_streets``.

source: Menus and Form elements
es: Menús y Formularios
sv: Menyer och formulärelement

source: Menus/submenus and form elements such as fields or check boxes and other on-screen artifacts are displayed in *italics*.
es: Los menús/submenús y los elementos de formulario tales como campos, casillas de verificación y otros artefactos se muestran en *cursiva*.
sv: Menyer/undermenyer och formulärelement som fält eller kryssrutor och andra artefakter på skärmen visas med *kursiv stil*.

source: Click on the *File > New* menu. Check the box that says *Confirm*.
es: Haga clic en el menú *Archivo > Nuevo*. Marca la casilla que dice *Confirmar*.
sv: Klicka på menyn *File > New*. Markera rutan där det står *Confirm*.

source: Workflow
es: Flujo de Trabajo
sv: Arbetsflöde

source: Sections are designed to be progressive. Each section will start with the assumption that you have completed and understood the previous section in the series and will build on that knowledge. A single section will progress through a handful of ideas and provide working examples wherever possible. At the end of a section, where appropriate, we have included a handful of exercises to allow you to try out the ideas we've presented. In some cases the section will include "Things To Try". These tasks contain more complex problems than the exercises and is designed to challenge participants with advanced knowledge.
es: Las secciones están diseñadas para ser abordadas de manera progresiva. Cada sección empezará con la suposición de que usted ha completado y comprendido la sección anterior de la serie y se basará en ese conocimiento. Cada sección tratará un puñado de ideas y proporcionará ejemplos prácticos siempre que sea posible. Al final de cada sección, cuando procede, incluimos una serie de ejercicios que le permitirán poner en práctica las ideas presentadas. En algunos casos, la sección incluirá «Cosas que probar». Estas tareas contienen problemas más complejos que los ejercicios y están pensadas para desafiar a los participantes con conocimientos avanzados.
sv: Avsnitten är utformade för att vara progressiva. Varje avsnitt börjar med antagandet att du har läst och förstått det föregående avsnittet i serien och bygger vidare på den kunskapen. I ett enskilt avsnitt går vi igenom en handfull idéer och ger arbetsexempel där så är möjligt. I slutet av ett avsnitt har vi, där det är lämpligt, inkluderat en handfull övningar så att du kan prova de idéer vi har presenterat. I vissa fall innehåller avsnittet "Saker att prova". Dessa uppgifter innehåller mer komplexa problem än övningarna och är utformade för att utmana deltagare med avancerade kunskaper.
